package com.meixiang.beauty.webapp.traffic.dto.sjtystjfxjc;

import com.alibaba.fastjson.annotation.JSONField;
import java.util.Date;
import java.util.List;

public class Ttjjhjht2DTO {


    /**
     * 序列号
     **/
    @JSONField(name="serialNo")
    private Integer serialNo;

    /**
     *行标识
    **/
    @JSONField(name="recid")
    private String recid;

    /**
     *行版本
    **/
    @JSONField(name="recver")
    private Double recver;

    /**
     *单位
    **/
    @JSONField(name="unitid")
    private String unitid;

    /**
     *数据时期
    **/
    @JSONField(name="datatime")
    private String datatime;

    /**
     *浮动行顺序号
    **/
    @JSONField(name="floatorder")
    private Double floatorder;

    /**
     *上年年底到达数-公路里程
    **/
    @JSONField(name="ys01010201000000000100000000")
    private Double ys01010201000000000100000000;

    /**
     *上年年底到达数-公路里程（国道）
    **/
    @JSONField(name="ys01010201000000000101000000")
    private Double ys01010201000000000101000000;

    /**
     *上年年底到达数-公路里程（国道中国家高速公路）
    **/
    @JSONField(name="ys01010201000000000111000000")
    private Double ys01010201000000000111000000;

    /**
     *上年年底到达数-公路里程（省道）
    **/
    @JSONField(name="ys01010201000000000112000000")
    private Double ys01010201000000000112000000;

    /**
     *上年年底到达数-公路里程（县道）
    **/
    @JSONField(name="ys01010201000000000113000000")
    private Double ys01010201000000000113000000;

    /**
     *上年年底到达数-公路里程（乡道）
    **/
    @JSONField(name="ys01010201000000000102000000")
    private Double ys01010201000000000102000000;

    /**
     *上年年底到达数-公路里程（专用公路）
    **/
    @JSONField(name="ys01010201000000000121000000")
    private Double ys01010201000000000121000000;

    /**
     *上年年底到达数-公路里程（村道）
    **/
    @JSONField(name="ys01010201000000000122000000")
    private Double ys01010201000000000122000000;

    /**
     *本年新建数-公路里程
    **/
    @JSONField(name="ys01010201000000000123000000")
    private Double ys01010201000000000123000000;

    /**
     *本年新建数-公路里程（国道）
    **/
    @JSONField(name="ys01010201000000000124000000")
    private Double ys01010201000000000124000000;

    /**
     *本年新建数-公路里程（国道中国家高速公路）
    **/
    @JSONField(name="ys01010201000000000200000000")
    private Double ys01010201000000000200000000;

    /**
     *本年新建数-公路里程（省道）
    **/
    @JSONField(name="ys01010201000000000201000000")
    private Double ys01010201000000000201000000;

    /**
     *本年新建数-公路里程（县道）
    **/
    @JSONField(name="ys01010201000000000211000000")
    private Double ys01010201000000000211000000;

    /**
     *本年新建数-公路里程（乡道）
    **/
    @JSONField(name="ys01010201000000000212000000")
    private Double ys01010201000000000212000000;

    /**
     *本年新建数-公路里程（专用公路）
    **/
    @JSONField(name="ys01010201000000000213000000")
    private Double ys01010201000000000213000000;

    /**
     *本年新建数-公路里程（村道）
    **/
    @JSONField(name="ys01010201000000000202000000")
    private Double ys01010201000000000202000000;

    /**
     *本年改建数-公路里程
    **/
    @JSONField(name="ys01010201000000000221000000")
    private Double ys01010201000000000221000000;

    /**
     *本年改建数-公路里程（国道）
    **/
    @JSONField(name="ys01010201000000000222000000")
    private Double ys01010201000000000222000000;

    /**
     *本年改建数-公路里程（国道中国家高速公路）
    **/
    @JSONField(name="ys01010201000000000223000000")
    private Double ys01010201000000000223000000;

    /**
     *本年改建数-公路里程（省道）
    **/
    @JSONField(name="ys01010201000000000224000000")
    private Double ys01010201000000000224000000;

    /**
     *本年改建数-公路里程（县道）
    **/
    @JSONField(name="ys01010201010000000100000000")
    private Double ys01010201010000000100000000;

    /**
     *本年改建数-公路里程（乡道）
    **/
    @JSONField(name="ys01010201010000000101000000")
    private Double ys01010201010000000101000000;

    /**
     *本年改建数-公路里程（专用公路）
    **/
    @JSONField(name="ys01010201010000000111000000")
    private Double ys01010201010000000111000000;

    /**
     *本年改建数-公路里程（村道）
    **/
    @JSONField(name="ys01010201010000000112000000")
    private Double ys01010201010000000112000000;

    /**
     *本年年底到达数-公路里程
    **/
    @JSONField(name="ys01010201010000000113000000")
    private Double ys01010201010000000113000000;

    /**
     *本年年底到达数-公路里程（国道）
    **/
    @JSONField(name="ys01010201010000000102000000")
    private Double ys01010201010000000102000000;

    /**
     *本年年底到达数-公路里程（国道中国家高速公路）
    **/
    @JSONField(name="ys01010201010000000121000000")
    private Double ys01010201010000000121000000;

    /**
     *本年年底到达数-公路里程（省道）
    **/
    @JSONField(name="ys01010201010000000122000000")
    private Double ys01010201010000000122000000;

    /**
     *本年年底到达数-公路里程（县道）
    **/
    @JSONField(name="ys01010201010000000123000000")
    private Double ys01010201010000000123000000;

    /**
     *本年年底到达数-公路里程（乡道）
    **/
    @JSONField(name="ys01010201010000000124000000")
    private Double ys01010201010000000124000000;

    /**
     *本年年底到达数-公路里程（专用公路）
    **/
    @JSONField(name="ys01010201010000000200000000")
    private Double ys01010201010000000200000000;

    /**
     *本年年底到达数-公路里程（村道）
    **/
    @JSONField(name="ys01010201010000000201000000")
    private Double ys01010201010000000201000000;

    /**
     *上年年底到达数-有铺装路面（高级）公路里程
    **/
    @JSONField(name="ys01010201010000000211000000")
    private Double ys01010201010000000211000000;

    /**
     *上年年底到达数-有铺装路面（高级）公路里程（国道）
    **/
    @JSONField(name="ys01010201010000000212000000")
    private Double ys01010201010000000212000000;

    /**
     *上年年底到达数-有铺装路面（高级）公路里程（国道中国家高速公路）
    **/
    @JSONField(name="ys01010201010000000213000000")
    private Double ys01010201010000000213000000;

    /**
     *上年年底到达数-有铺装路面（高级）公路里程（省道）
    **/
    @JSONField(name="ys01010201010000000202000000")
    private Double ys01010201010000000202000000;

    /**
     *上年年底到达数-有铺装路面（高级）公路里程（县道）
    **/
    @JSONField(name="ys01010201010000000221000000")
    private Double ys01010201010000000221000000;

    /**
     *上年年底到达数-有铺装路面（高级）公路里程（乡道）
    **/
    @JSONField(name="ys01010201010000000222000000")
    private Double ys01010201010000000222000000;

    /**
     *上年年底到达数-有铺装路面（高级）公路里程（专用公路）
    **/
    @JSONField(name="ys01010201010000000223000000")
    private Double ys01010201010000000223000000;

    /**
     *上年年底到达数-有铺装路面（高级）公路里程（村道）
    **/
    @JSONField(name="ys01010201010000000224000000")
    private Double ys01010201010000000224000000;

    /**
     *本年新建数-有铺装路面（高级）公路里程
    **/
    @JSONField(name="ys01010201010100000100000000")
    private Double ys01010201010100000100000000;

    /**
     *本年新建数-有铺装路面（高级）公路里程（国道）
    **/
    @JSONField(name="ys01010201010100000101000000")
    private Double ys01010201010100000101000000;

    /**
     *本年新建数-有铺装路面（高级）公路里程（国道中国家高速公路）
    **/
    @JSONField(name="ys01010201010100000111000000")
    private Double ys01010201010100000111000000;

    /**
     *本年新建数-有铺装路面（高级）公路里程（省道）
    **/
    @JSONField(name="ys01010201010100000112000000")
    private Double ys01010201010100000112000000;

    /**
     *本年新建数-有铺装路面（高级）公路里程（县道）
    **/
    @JSONField(name="ys01010201010100000113000000")
    private Double ys01010201010100000113000000;

    /**
     *本年新建数-有铺装路面（高级）公路里程（乡道）
    **/
    @JSONField(name="ys01010201010100000102000000")
    private Double ys01010201010100000102000000;

    /**
     *本年新建数-有铺装路面（高级）公路里程（专用公路）
    **/
    @JSONField(name="ys01010201010100000121000000")
    private Double ys01010201010100000121000000;

    /**
     *本年新建数-有铺装路面（高级）公路里程（村道）
    **/
    @JSONField(name="ys01010201010100000122000000")
    private Double ys01010201010100000122000000;

    /**
     *本年改建数-有铺装路面（高级）公路里程
    **/
    @JSONField(name="ys01010201010100000123000000")
    private Double ys01010201010100000123000000;

    /**
     *本年改建数-有铺装路面（高级）公路里程（国道）
    **/
    @JSONField(name="ys01010201010100000124000000")
    private Double ys01010201010100000124000000;

    /**
     *本年改建数-有铺装路面（高级）公路里程（国道中国家高速公路）
    **/
    @JSONField(name="ys01010201010100000200000000")
    private Double ys01010201010100000200000000;

    /**
     *本年改建数-有铺装路面（高级）公路里程（省道）
    **/
    @JSONField(name="ys01010201010100000201000000")
    private Double ys01010201010100000201000000;

    /**
     *本年改建数-有铺装路面（高级）公路里程（县道）
    **/
    @JSONField(name="ys01010201010100000211000000")
    private Double ys01010201010100000211000000;

    /**
     *本年改建数-有铺装路面（高级）公路里程（乡道）
    **/
    @JSONField(name="ys01010201010100000212000000")
    private Double ys01010201010100000212000000;

    /**
     *本年改建数-有铺装路面（高级）公路里程（专用公路）
    **/
    @JSONField(name="ys01010201010100000213000000")
    private Double ys01010201010100000213000000;

    /**
     *本年改建数-有铺装路面（高级）公路里程（村道）
    **/
    @JSONField(name="ys01010201010100000202000000")
    private Double ys01010201010100000202000000;

    /**
     *本年年底到达数-有铺装路面（高级）公路里程
    **/
    @JSONField(name="ys01010201010100000221000000")
    private Double ys01010201010100000221000000;

    /**
     *本年年底到达数-有铺装路面（高级）公路里程（国道）
    **/
    @JSONField(name="ys01010201010100000222000000")
    private Double ys01010201010100000222000000;

    /**
     *本年年底到达数-有铺装路面（高级）公路里程（国道中国家高速公路）
    **/
    @JSONField(name="ys01010201010100000223000000")
    private Double ys01010201010100000223000000;

    /**
     *本年年底到达数-有铺装路面（高级）公路里程（省道）
    **/
    @JSONField(name="ys01010201010100000224000000")
    private Double ys01010201010100000224000000;

    /**
     *本年年底到达数-有铺装路面（高级）公路里程（县道）
    **/
    @JSONField(name="ys01010201020000000100000000")
    private Double ys01010201020000000100000000;

    /**
     *本年年底到达数-有铺装路面（高级）公路里程（乡道）
    **/
    @JSONField(name="ys01010201020000000101000000")
    private Double ys01010201020000000101000000;

    /**
     *本年年底到达数-有铺装路面（高级）公路里程（专用公路）
    **/
    @JSONField(name="ys01010201020000000111000000")
    private Double ys01010201020000000111000000;

    /**
     *本年年底到达数-有铺装路面（高级）公路里程（村道）
    **/
    @JSONField(name="ys01010201020000000112000000")
    private Double ys01010201020000000112000000;

    /**
     *上年年底到达数-沥青混凝土路面公路里程
    **/
    @JSONField(name="ys01010201020000000113000000")
    private Double ys01010201020000000113000000;

    /**
     *上年年底到达数-沥青混凝土路面公路里程（国道）
    **/
    @JSONField(name="ys01010201020000000102000000")
    private Double ys01010201020000000102000000;

    /**
     *上年年底到达数-沥青混凝土路面公路里程（国道中国家高速公路）
    **/
    @JSONField(name="ys01010201020000000121000000")
    private Double ys01010201020000000121000000;

    /**
     *上年年底到达数-沥青混凝土路面公路里程（省道）
    **/
    @JSONField(name="ys01010201020000000122000000")
    private Double ys01010201020000000122000000;

    /**
     *上年年底到达数-沥青混凝土路面公路里程（县道）
    **/
    @JSONField(name="ys01010201020000000123000000")
    private Double ys01010201020000000123000000;

    /**
     *上年年底到达数-沥青混凝土路面公路里程（乡道）
    **/
    @JSONField(name="ys01010201020000000124000000")
    private Double ys01010201020000000124000000;

    /**
     *上年年底到达数-沥青混凝土路面公路里程（专用公路）
    **/
    @JSONField(name="ys01010201020000000200000000")
    private Double ys01010201020000000200000000;

    /**
     *上年年底到达数-沥青混凝土路面公路里程（村道）
    **/
    @JSONField(name="ys01010201020000000201000000")
    private Double ys01010201020000000201000000;

    /**
     *本年新建数-沥青混凝土路面公路里程
    **/
    @JSONField(name="ys01010201020000000211000000")
    private Double ys01010201020000000211000000;

    /**
     *本年新建数-沥青混凝土路面公路里程（国道）
    **/
    @JSONField(name="ys01010201020000000212000000")
    private Double ys01010201020000000212000000;

    /**
     *本年新建数-沥青混凝土路面公路里程（国道中国家高速公路）
    **/
    @JSONField(name="ys01010201020000000213000000")
    private Double ys01010201020000000213000000;

    /**
     *本年新建数-沥青混凝土路面公路里程（省道）
    **/
    @JSONField(name="ys01010201020000000202000000")
    private Double ys01010201020000000202000000;

    /**
     *本年新建数-沥青混凝土路面公路里程（县道）
    **/
    @JSONField(name="ys01010201020000000221000000")
    private Double ys01010201020000000221000000;

    /**
     *本年新建数-沥青混凝土路面公路里程（乡道）
    **/
    @JSONField(name="ys01010201020000000222000000")
    private Double ys01010201020000000222000000;

    /**
     *本年新建数-沥青混凝土路面公路里程（专用公路）
    **/
    @JSONField(name="ys01010201020000000223000000")
    private Double ys01010201020000000223000000;

    /**
     *本年新建数-沥青混凝土路面公路里程（村道）
    **/
    @JSONField(name="ys01010201020000000224000000")
    private Double ys01010201020000000224000000;

    /**
     *本年改建数-沥青混凝土路面公路里程
    **/
    @JSONField(name="ys01010201030000000100000000")
    private Double ys01010201030000000100000000;

    /**
     *本年改建数-沥青混凝土路面公路里程（国道）
    **/
    @JSONField(name="ys01010201030000000101000000")
    private Double ys01010201030000000101000000;

    /**
     *本年改建数-沥青混凝土路面公路里程（国道中国家高速公路）
    **/
    @JSONField(name="ys01010201030000000111000000")
    private Double ys01010201030000000111000000;

    /**
     *本年改建数-沥青混凝土路面公路里程（省道）
    **/
    @JSONField(name="ys01010201030000000112000000")
    private Double ys01010201030000000112000000;

    /**
     *本年改建数-沥青混凝土路面公路里程（县道）
    **/
    @JSONField(name="ys01010201030000000113000000")
    private Double ys01010201030000000113000000;

    /**
     *本年改建数-沥青混凝土路面公路里程（乡道）
    **/
    @JSONField(name="ys01010201030000000102000000")
    private Double ys01010201030000000102000000;

    /**
     *本年改建数-沥青混凝土路面公路里程（专用公路）
    **/
    @JSONField(name="ys01010201030000000121000000")
    private Double ys01010201030000000121000000;

    /**
     *本年改建数-沥青混凝土路面公路里程（村道）
    **/
    @JSONField(name="ys01010201030000000122000000")
    private Double ys01010201030000000122000000;

    /**
     *本年年底到达数-沥青混凝土路面公路里程
    **/
    @JSONField(name="ys01010201030000000123000000")
    private Double ys01010201030000000123000000;

    /**
     *本年年底到达数-沥青混凝土路面公路里程（国道）
    **/
    @JSONField(name="ys01010201030000000124000000")
    private Double ys01010201030000000124000000;

    /**
     *本年年底到达数-沥青混凝土路面公路里程（国道中国家高速公路）
    **/
    @JSONField(name="ys01010201030000000200000000")
    private Double ys01010201030000000200000000;

    /**
     *本年年底到达数-沥青混凝土路面公路里程（省道）
    **/
    @JSONField(name="ys01010201030000000201000000")
    private Double ys01010201030000000201000000;

    /**
     *本年年底到达数-沥青混凝土路面公路里程（县道）
    **/
    @JSONField(name="ys01010201030000000211000000")
    private Double ys01010201030000000211000000;

    /**
     *本年年底到达数-沥青混凝土路面公路里程（乡道）
    **/
    @JSONField(name="ys01010201030000000212000000")
    private Double ys01010201030000000212000000;

    /**
     *本年年底到达数-沥青混凝土路面公路里程（专用公路）
    **/
    @JSONField(name="ys01010201030000000213000000")
    private Double ys01010201030000000213000000;

    /**
     *本年年底到达数-沥青混凝土路面公路里程（村道）
    **/
    @JSONField(name="ys01010201030000000202000000")
    private Double ys01010201030000000202000000;

    /**
     *上年年底到达数-水泥混凝土路面公路里程
    **/
    @JSONField(name="ys01010201030000000221000000")
    private Double ys01010201030000000221000000;

    /**
     *上年年底到达数-水泥混凝土路面公路里程（国道）
    **/
    @JSONField(name="ys01010201030000000222000000")
    private Double ys01010201030000000222000000;

    /**
     *上年年底到达数-水泥混凝土路面公路里程（国道中国家高速公路）
    **/
    @JSONField(name="ys01010201030000000223000000")
    private Double ys01010201030000000223000000;

    /**
     *上年年底到达数-水泥混凝土路面公路里程（省道）
    **/
    @JSONField(name="ys01010201030000000224000000")
    private Double ys01010201030000000224000000;

    /**
     *上年年底到达数-水泥混凝土路面公路里程（县道）
    **/
    @JSONField(name="ys01010201040000000100000000")
    private Double ys01010201040000000100000000;

    /**
     *上年年底到达数-水泥混凝土路面公路里程（乡道）
    **/
    @JSONField(name="ys01010201040000000101000000")
    private Double ys01010201040000000101000000;

    /**
     *上年年底到达数-水泥混凝土路面公路里程（专用公路）
    **/
    @JSONField(name="ys01010201040000000111000000")
    private Double ys01010201040000000111000000;

    /**
     *上年年底到达数-水泥混凝土路面公路里程（村道）
    **/
    @JSONField(name="ys01010201040000000112000000")
    private Double ys01010201040000000112000000;

    /**
     *本年新建数-水泥混凝土路面公路里程
    **/
    @JSONField(name="ys01010201040000000113000000")
    private Double ys01010201040000000113000000;

    /**
     *本年新建数-水泥混凝土路面公路里程（国道）
    **/
    @JSONField(name="ys01010201040000000102000000")
    private Double ys01010201040000000102000000;

    /**
     *本年新建数-水泥混凝土路面公路里程（国道中国家高速公路）
    **/
    @JSONField(name="ys01010201040000000121000000")
    private Double ys01010201040000000121000000;

    /**
     *本年新建数-水泥混凝土路面公路里程（省道）
    **/
    @JSONField(name="ys01010201040000000122000000")
    private Double ys01010201040000000122000000;

    /**
     *本年新建数-水泥混凝土路面公路里程（县道）
    **/
    @JSONField(name="ys01010201040000000123000000")
    private Double ys01010201040000000123000000;

    /**
     *本年新建数-水泥混凝土路面公路里程（乡道）
    **/
    @JSONField(name="ys01010201040000000124000000")
    private Double ys01010201040000000124000000;

    /**
     *本年新建数-水泥混凝土路面公路里程（专用公路）
    **/
    @JSONField(name="ys01010201040000000200000000")
    private Double ys01010201040000000200000000;

    /**
     *本年新建数-水泥混凝土路面公路里程（村道）
    **/
    @JSONField(name="ys01010201040000000201000000")
    private Double ys01010201040000000201000000;

    /**
     *本年改建数-水泥混凝土路面公路里程
    **/
    @JSONField(name="ys01010201040000000211000000")
    private Double ys01010201040000000211000000;

    /**
     *本年改建数-水泥混凝土路面公路里程（国道）
    **/
    @JSONField(name="ys01010201040000000212000000")
    private Double ys01010201040000000212000000;

    /**
     *本年改建数-水泥混凝土路面公路里程（国道中国家高速公路）
    **/
    @JSONField(name="ys01010201040000000213000000")
    private Double ys01010201040000000213000000;

    /**
     *本年改建数-水泥混凝土路面公路里程（省道）
    **/
    @JSONField(name="ys01010201040000000202000000")
    private Double ys01010201040000000202000000;

    /**
     *本年改建数-水泥混凝土路面公路里程（县道）
    **/
    @JSONField(name="ys01010201040000000221000000")
    private Double ys01010201040000000221000000;

    /**
     *本年改建数-水泥混凝土路面公路里程（乡道）
    **/
    @JSONField(name="ys01010201040000000222000000")
    private Double ys01010201040000000222000000;

    /**
     *本年改建数-水泥混凝土路面公路里程（专用公路）
    **/
    @JSONField(name="ys01010201040000000223000000")
    private Double ys01010201040000000223000000;

    /**
     *本年改建数-水泥混凝土路面公路里程（村道）
    **/
    @JSONField(name="ys01010201040000000224000000")
    private Double ys01010201040000000224000000;

    /**
     *本年年底到达数-水泥混凝土路面公路里程
    **/
    @JSONField(name="ys01010201050000000100000000")
    private Double ys01010201050000000100000000;

    /**
     *本年年底到达数-水泥混凝土路面公路里程（国道）
    **/
    @JSONField(name="ys01010201050000000101000000")
    private Double ys01010201050000000101000000;

    /**
     *本年年底到达数-水泥混凝土路面公路里程（国道中国家高速公路）
    **/
    @JSONField(name="ys01010201050000000111000000")
    private Double ys01010201050000000111000000;

    /**
     *本年年底到达数-水泥混凝土路面公路里程（省道）
    **/
    @JSONField(name="ys01010201050000000112000000")
    private Double ys01010201050000000112000000;

    /**
     *本年年底到达数-水泥混凝土路面公路里程（县道）
    **/
    @JSONField(name="ys01010201050000000113000000")
    private Double ys01010201050000000113000000;

    /**
     *本年年底到达数-水泥混凝土路面公路里程（乡道）
    **/
    @JSONField(name="ys01010201050000000102000000")
    private Double ys01010201050000000102000000;

    /**
     *本年年底到达数-水泥混凝土路面公路里程（专用公路）
    **/
    @JSONField(name="ys01010201050000000121000000")
    private Double ys01010201050000000121000000;

    /**
     *本年年底到达数-水泥混凝土路面公路里程（村道）
    **/
    @JSONField(name="ys01010201050000000122000000")
    private Double ys01010201050000000122000000;

    /**
     *上年年底到达数-简易铺装路面（次高级）公路里程
    **/
    @JSONField(name="ys01010201050000000123000000")
    private Double ys01010201050000000123000000;

    /**
     *上年年底到达数-简易铺装路面（次高级）公路里程（国道）
    **/
    @JSONField(name="ys01010201050000000124000000")
    private Double ys01010201050000000124000000;

    /**
     *上年年底到达数-简易铺装路面（次高级）公路里程（国道中国家高速公路）
    **/
    @JSONField(name="ys01010201050000000200000000")
    private Double ys01010201050000000200000000;

    /**
     *上年年底到达数-简易铺装路面（次高级）公路里程（省道）
    **/
    @JSONField(name="ys01010201050000000201000000")
    private Double ys01010201050000000201000000;

    /**
     *上年年底到达数-简易铺装路面（次高级）公路里程（县道）
    **/
    @JSONField(name="ys01010201050000000211000000")
    private Double ys01010201050000000211000000;

    /**
     *上年年底到达数-简易铺装路面（次高级）公路里程（乡道）
    **/
    @JSONField(name="ys01010201050000000212000000")
    private Double ys01010201050000000212000000;

    /**
     *上年年底到达数-简易铺装路面（次高级）公路里程（专用公路）
    **/
    @JSONField(name="ys01010201050000000213000000")
    private Double ys01010201050000000213000000;

    /**
     *上年年底到达数-简易铺装路面（次高级）公路里程（村道）
    **/
    @JSONField(name="ys01010201050000000202000000")
    private Double ys01010201050000000202000000;

    /**
     *本年新建数-简易铺装路面（次高级）公路里程
    **/
    @JSONField(name="ys01010201050000000221000000")
    private Double ys01010201050000000221000000;

    /**
     *本年新建数-简易铺装路面（次高级）公路里程（国道）
    **/
    @JSONField(name="ys01010201050000000222000000")
    private Double ys01010201050000000222000000;

    /**
     *本年新建数-简易铺装路面（次高级）公路里程（国道中国家高速公路）
    **/
    @JSONField(name="ys01010201050000000223000000")
    private Double ys01010201050000000223000000;

    /**
     *本年新建数-简易铺装路面（次高级）公路里程（省道）
    **/
    @JSONField(name="ys01010201050000000224000000")
    private Double ys01010201050000000224000000;

    /**
     *本年新建数-简易铺装路面（次高级）公路里程（县道）
    **/
    @JSONField(name="ys01010201060000000100000000")
    private Double ys01010201060000000100000000;

    /**
     *本年新建数-简易铺装路面（次高级）公路里程（乡道）
    **/
    @JSONField(name="ys01010201060000000101000000")
    private Double ys01010201060000000101000000;

    /**
     *本年新建数-简易铺装路面（次高级）公路里程（专用公路）
    **/
    @JSONField(name="ys01010201060000000111000000")
    private Double ys01010201060000000111000000;

    /**
     *本年新建数-简易铺装路面（次高级）公路里程（村道）
    **/
    @JSONField(name="ys01010201060000000112000000")
    private Double ys01010201060000000112000000;

    /**
     *本年改建数-简易铺装路面（次高级）公路里程
    **/
    @JSONField(name="ys01010201060000000113000000")
    private Double ys01010201060000000113000000;

    /**
     *本年改建数-简易铺装路面（次高级）公路里程（国道）
    **/
    @JSONField(name="ys01010201060000000102000000")
    private Double ys01010201060000000102000000;

    /**
     *本年改建数-简易铺装路面（次高级）公路里程（国道中国家高速公路）
    **/
    @JSONField(name="ys01010201060000000121000000")
    private Double ys01010201060000000121000000;

    /**
     *本年改建数-简易铺装路面（次高级）公路里程（省道）
    **/
    @JSONField(name="ys01010201060000000122000000")
    private Double ys01010201060000000122000000;

    /**
     *本年改建数-简易铺装路面（次高级）公路里程（县道）
    **/
    @JSONField(name="ys01010201060000000123000000")
    private Double ys01010201060000000123000000;

    /**
     *本年改建数-简易铺装路面（次高级）公路里程（乡道）
    **/
    @JSONField(name="ys01010201060000000124000000")
    private Double ys01010201060000000124000000;

    /**
     *本年改建数-简易铺装路面（次高级）公路里程（专用公路）
    **/
    @JSONField(name="ys01010201060000000200000000")
    private Double ys01010201060000000200000000;

    /**
     *本年改建数-简易铺装路面（次高级）公路里程（村道）
    **/
    @JSONField(name="ys01010201060000000201000000")
    private Double ys01010201060000000201000000;

    /**
     *本年年底到达数-简易铺装路面（次高级）公路里程
    **/
    @JSONField(name="ys01010201060000000211000000")
    private Double ys01010201060000000211000000;

    /**
     *本年年底到达数-简易铺装路面（次高级）公路里程（国道）
    **/
    @JSONField(name="ys01010201060000000212000000")
    private Double ys01010201060000000212000000;

    /**
     *本年年底到达数-简易铺装路面（次高级）公路里程（国道中国家高速公路）
    **/
    @JSONField(name="ys01010201060000000213000000")
    private Double ys01010201060000000213000000;

    /**
     *本年年底到达数-简易铺装路面（次高级）公路里程（省道）
    **/
    @JSONField(name="ys01010201060000000202000000")
    private Double ys01010201060000000202000000;

    /**
     *本年年底到达数-简易铺装路面（次高级）公路里程（县道）
    **/
    @JSONField(name="ys01010201060000000221000000")
    private Double ys01010201060000000221000000;

    /**
     *本年年底到达数-简易铺装路面（次高级）公路里程（乡道）
    **/
    @JSONField(name="ys01010201060000000222000000")
    private Double ys01010201060000000222000000;

    /**
     *本年年底到达数-简易铺装路面（次高级）公路里程（专用公路）
    **/
    @JSONField(name="ys01010201060000000223000000")
    private Double ys01010201060000000223000000;

    /**
     *本年年底到达数-简易铺装路面（次高级）公路里程（村道）
    **/
    @JSONField(name="ys01010201060000000224000000")
    private Double ys01010201060000000224000000;

    /**
     *上年年底到达数-未铺装路面（中级、低级、无路面）公路里程
    **/
    @JSONField(name="ys01010202000000000100000000")
    private Double ys01010202000000000100000000;

    /**
     *上年年底到达数-未铺装路面（中级、低级、无路面）公路里程（国道）
    **/
    @JSONField(name="ys01010202000000000101000000")
    private Double ys01010202000000000101000000;

    /**
     *上年年底到达数-未铺装路面（中级、低级、无路面）公路里程（国道中国家高速公路）
    **/
    @JSONField(name="ys01010202000000000111000000")
    private Double ys01010202000000000111000000;

    /**
     *上年年底到达数-未铺装路面（中级、低级、无路面）公路里程（省道）
    **/
    @JSONField(name="ys01010202000000000112000000")
    private Double ys01010202000000000112000000;

    /**
     *上年年底到达数-未铺装路面（中级、低级、无路面）公路里程（县道）
    **/
    @JSONField(name="ys01010202000000000113000000")
    private Double ys01010202000000000113000000;

    /**
     *上年年底到达数-未铺装路面（中级、低级、无路面）公路里程（乡道）
    **/
    @JSONField(name="ys01010202000000000102000000")
    private Double ys01010202000000000102000000;

    /**
     *上年年底到达数-未铺装路面（中级、低级、无路面）公路里程（专用公路）
    **/
    @JSONField(name="ys01010202000000000121000000")
    private Double ys01010202000000000121000000;

    /**
     *上年年底到达数-未铺装路面（中级、低级、无路面）公路里程（村道）
    **/
    @JSONField(name="ys01010202000000000122000000")
    private Double ys01010202000000000122000000;

    /**
     *本年新建数-未铺装路面（中级、低级、无路面）公路里程
    **/
    @JSONField(name="ys01010202000000000123000000")
    private Double ys01010202000000000123000000;

    /**
     *本年新建数-未铺装路面（中级、低级、无路面）公路里程（国道）
    **/
    @JSONField(name="ys01010202000000000124000000")
    private Double ys01010202000000000124000000;

    /**
     *本年新建数-未铺装路面（中级、低级、无路面）公路里程（国道中国家高速公路）
    **/
    @JSONField(name="ys01010202000000000200000000")
    private Double ys01010202000000000200000000;

    /**
     *本年新建数-未铺装路面（中级、低级、无路面）公路里程（省道）
    **/
    @JSONField(name="ys01010202000000000201000000")
    private Double ys01010202000000000201000000;

    /**
     *本年新建数-未铺装路面（中级、低级、无路面）公路里程（县道）
    **/
    @JSONField(name="ys01010202000000000211000000")
    private Double ys01010202000000000211000000;

    /**
     *本年新建数-未铺装路面（中级、低级、无路面）公路里程（乡道）
    **/
    @JSONField(name="ys01010202000000000212000000")
    private Double ys01010202000000000212000000;

    /**
     *本年新建数-未铺装路面（中级、低级、无路面）公路里程（专用公路）
    **/
    @JSONField(name="ys01010202000000000213000000")
    private Double ys01010202000000000213000000;

    /**
     *本年新建数-未铺装路面（中级、低级、无路面）公路里程（村道）
    **/
    @JSONField(name="ys01010202000000000202000000")
    private Double ys01010202000000000202000000;

    /**
     *本年改建数-未铺装路面（中级、低级、无路面）公路里程
    **/
    @JSONField(name="ys01010202000000000221000000")
    private Double ys01010202000000000221000000;

    /**
     *本年改建数-未铺装路面（中级、低级、无路面）公路里程（国道）
    **/
    @JSONField(name="ys01010202000000000222000000")
    private Double ys01010202000000000222000000;

    /**
     *本年改建数-未铺装路面（中级、低级、无路面）公路里程（国道中国家高速公路）
    **/
    @JSONField(name="ys01010202000000000223000000")
    private Double ys01010202000000000223000000;

    /**
     *本年改建数-未铺装路面（中级、低级、无路面）公路里程（省道）
    **/
    @JSONField(name="ys01010202000000000224000000")
    private Double ys01010202000000000224000000;

    /**
     *本年改建数-未铺装路面（中级、低级、无路面）公路里程（县道）
    **/
    @JSONField(name="ys01010202010000000100000000")
    private Double ys01010202010000000100000000;

    /**
     *本年改建数-未铺装路面（中级、低级、无路面）公路里程（乡道）
    **/
    @JSONField(name="ys01010202010000000101000000")
    private Double ys01010202010000000101000000;

    /**
     *本年改建数-未铺装路面（中级、低级、无路面）公路里程（专用公路）
    **/
    @JSONField(name="ys01010202010000000111000000")
    private Double ys01010202010000000111000000;

    /**
     *本年改建数-未铺装路面（中级、低级、无路面）公路里程（村道）
    **/
    @JSONField(name="ys01010202010000000112000000")
    private Double ys01010202010000000112000000;

    /**
     *本年年底到达数-未铺装路面（中级、低级、无路面）公路里程
    **/
    @JSONField(name="ys01010202010000000113000000")
    private Double ys01010202010000000113000000;

    /**
     *本年年底到达数-未铺装路面（中级、低级、无路面）公路里程（国道）
    **/
    @JSONField(name="ys01010202010000000102000000")
    private Double ys01010202010000000102000000;

    /**
     *本年年底到达数-未铺装路面（中级、低级、无路面）公路里程（国道中国家高速公路）
    **/
    @JSONField(name="ys01010202010000000121000000")
    private Double ys01010202010000000121000000;

    /**
     *本年年底到达数-未铺装路面（中级、低级、无路面）公路里程（省道）
    **/
    @JSONField(name="ys01010202010000000122000000")
    private Double ys01010202010000000122000000;

    /**
     *本年年底到达数-未铺装路面（中级、低级、无路面）公路里程（县道）
    **/
    @JSONField(name="ys01010202010000000123000000")
    private Double ys01010202010000000123000000;

    /**
     *本年年底到达数-未铺装路面（中级、低级、无路面）公路里程（乡道）
    **/
    @JSONField(name="ys01010202010000000124000000")
    private Double ys01010202010000000124000000;

    /**
     *本年年底到达数-未铺装路面（中级、低级、无路面）公路里程（专用公路）
    **/
    @JSONField(name="ys01010202010000000200000000")
    private Double ys01010202010000000200000000;

    /**
     *本年年底到达数-未铺装路面（中级、低级、无路面）公路里程（村道）
    **/
    @JSONField(name="ys01010202010000000201000000")
    private Double ys01010202010000000201000000;

    /**
     *上年年底到达数-公路可绿化里程
    **/
    @JSONField(name="ys01010202010000000211000000")
    private Double ys01010202010000000211000000;

    /**
     *上年年底到达数-公路可绿化里程（国道）
    **/
    @JSONField(name="ys01010202010000000212000000")
    private Double ys01010202010000000212000000;

    /**
     *上年年底到达数-公路可绿化里程（国道中国家高速公路）
    **/
    @JSONField(name="ys01010202010000000213000000")
    private Double ys01010202010000000213000000;

    /**
     *上年年底到达数-公路可绿化里程（省道）
    **/
    @JSONField(name="ys01010202010000000202000000")
    private Double ys01010202010000000202000000;

    /**
     *上年年底到达数-公路可绿化里程（县道）
    **/
    @JSONField(name="ys01010202010000000221000000")
    private Double ys01010202010000000221000000;

    /**
     *上年年底到达数-公路可绿化里程（乡道）
    **/
    @JSONField(name="ys01010202010000000222000000")
    private Double ys01010202010000000222000000;

    /**
     *上年年底到达数-公路可绿化里程（专用公路）
    **/
    @JSONField(name="ys01010202010000000223000000")
    private Double ys01010202010000000223000000;

    /**
     *上年年底到达数-公路可绿化里程（村道）
    **/
    @JSONField(name="ys01010202010000000224000000")
    private Double ys01010202010000000224000000;

    /**
     *本年新建数-公路可绿化里程
    **/
    @JSONField(name="ys01010202010100000100000000")
    private Double ys01010202010100000100000000;

    /**
     *本年新建数-公路可绿化里程（国道）
    **/
    @JSONField(name="ys01010202010100000101000000")
    private Double ys01010202010100000101000000;

    /**
     *本年新建数-公路可绿化里程（国道中国家高速公路）
    **/
    @JSONField(name="ys01010202010100000111000000")
    private Double ys01010202010100000111000000;

    /**
     *本年新建数-公路可绿化里程（省道）
    **/
    @JSONField(name="ys01010202010100000112000000")
    private Double ys01010202010100000112000000;

    /**
     *本年新建数-公路可绿化里程（县道）
    **/
    @JSONField(name="ys01010202010100000113000000")
    private Double ys01010202010100000113000000;

    /**
     *本年新建数-公路可绿化里程（乡道）
    **/
    @JSONField(name="ys01010202010100000102000000")
    private Double ys01010202010100000102000000;

    /**
     *本年新建数-公路可绿化里程（专用公路）
    **/
    @JSONField(name="ys01010202010100000121000000")
    private Double ys01010202010100000121000000;

    /**
     *本年新建数-公路可绿化里程（村道）
    **/
    @JSONField(name="ys01010202010100000122000000")
    private Double ys01010202010100000122000000;

    /**
     *本年改建数-公路可绿化里程
    **/
    @JSONField(name="ys01010202010100000123000000")
    private Double ys01010202010100000123000000;

    /**
     *本年改建数-公路可绿化里程（国道）
    **/
    @JSONField(name="ys01010202010100000124000000")
    private Double ys01010202010100000124000000;

    /**
     *本年改建数-公路可绿化里程（国道中国家高速公路）
    **/
    @JSONField(name="ys01010202010100000200000000")
    private Double ys01010202010100000200000000;

    /**
     *本年改建数-公路可绿化里程（省道）
    **/
    @JSONField(name="ys01010202010100000201000000")
    private Double ys01010202010100000201000000;

    /**
     *本年改建数-公路可绿化里程（县道）
    **/
    @JSONField(name="ys01010202010100000211000000")
    private Double ys01010202010100000211000000;

    /**
     *本年改建数-公路可绿化里程（乡道）
    **/
    @JSONField(name="ys01010202010100000212000000")
    private Double ys01010202010100000212000000;

    /**
     *本年改建数-公路可绿化里程（专用公路）
    **/
    @JSONField(name="ys01010202010100000213000000")
    private Double ys01010202010100000213000000;

    /**
     *本年改建数-公路可绿化里程（村道）
    **/
    @JSONField(name="ys01010202010100000202000000")
    private Double ys01010202010100000202000000;

    /**
     *本年年底到达数-公路可绿化里程
    **/
    @JSONField(name="ys01010202010100000221000000")
    private Double ys01010202010100000221000000;

    /**
     *本年年底到达数-公路可绿化里程（国道）
    **/
    @JSONField(name="ys01010202010100000222000000")
    private Double ys01010202010100000222000000;

    /**
     *本年年底到达数-公路可绿化里程（国道中国家高速公路）
    **/
    @JSONField(name="ys01010202010100000223000000")
    private Double ys01010202010100000223000000;

    /**
     *本年年底到达数-公路可绿化里程（省道）
    **/
    @JSONField(name="ys01010202010100000224000000")
    private Double ys01010202010100000224000000;

    /**
     *本年年底到达数-公路可绿化里程（县道）
    **/
    @JSONField(name="ys01010202020000000100000000")
    private Double ys01010202020000000100000000;

    /**
     *本年年底到达数-公路可绿化里程（乡道）
    **/
    @JSONField(name="ys01010202020000000101000000")
    private Double ys01010202020000000101000000;

    /**
     *本年年底到达数-公路可绿化里程（专用公路）
    **/
    @JSONField(name="ys01010202020000000111000000")
    private Double ys01010202020000000111000000;

    /**
     *本年年底到达数-公路可绿化里程（村道）
    **/
    @JSONField(name="ys01010202020000000112000000")
    private Double ys01010202020000000112000000;

    /**
     *上年年底到达数-公路已绿化里程
    **/
    @JSONField(name="ys01010202020000000113000000")
    private Double ys01010202020000000113000000;

    /**
     *上年年底到达数-公路已绿化里程（国道）
    **/
    @JSONField(name="ys01010202020000000102000000")
    private Double ys01010202020000000102000000;

    /**
     *上年年底到达数-公路已绿化里程（国道中国家高速公路）
    **/
    @JSONField(name="ys01010202020000000121000000")
    private Double ys01010202020000000121000000;

    /**
     *上年年底到达数-公路已绿化里程（省道）
    **/
    @JSONField(name="ys01010202020000000122000000")
    private Double ys01010202020000000122000000;

    /**
     *上年年底到达数-公路已绿化里程（县道）
    **/
    @JSONField(name="ys01010202020000000123000000")
    private Double ys01010202020000000123000000;

    /**
     *上年年底到达数-公路已绿化里程（乡道）
    **/
    @JSONField(name="ys01010202020000000124000000")
    private Double ys01010202020000000124000000;

    /**
     *上年年底到达数-公路已绿化里程（专用公路）
    **/
    @JSONField(name="ys01010202020000000200000000")
    private Double ys01010202020000000200000000;

    /**
     *上年年底到达数-公路已绿化里程（村道）
    **/
    @JSONField(name="ys01010202020000000201000000")
    private Double ys01010202020000000201000000;

    /**
     *本年新建数-公路已绿化里程
    **/
    @JSONField(name="ys01010202020000000211000000")
    private Double ys01010202020000000211000000;

    /**
     *本年新建数-公路已绿化里程（国道）
    **/
    @JSONField(name="ys01010202020000000212000000")
    private Double ys01010202020000000212000000;

    /**
     *本年新建数-公路已绿化里程（国道中国家高速公路）
    **/
    @JSONField(name="ys01010202020000000213000000")
    private Double ys01010202020000000213000000;

    /**
     *本年新建数-公路已绿化里程（省道）
    **/
    @JSONField(name="ys01010202020000000202000000")
    private Double ys01010202020000000202000000;

    /**
     *本年新建数-公路已绿化里程（县道）
    **/
    @JSONField(name="ys01010202020000000221000000")
    private Double ys01010202020000000221000000;

    /**
     *本年新建数-公路已绿化里程（乡道）
    **/
    @JSONField(name="ys01010202020000000222000000")
    private Double ys01010202020000000222000000;

    /**
     *本年新建数-公路已绿化里程（专用公路）
    **/
    @JSONField(name="ys01010202020000000223000000")
    private Double ys01010202020000000223000000;

    /**
     *本年新建数-公路已绿化里程（村道）
    **/
    @JSONField(name="ys01010202020000000224000000")
    private Double ys01010202020000000224000000;

    /**
     *本年改建数-公路已绿化里程
    **/
    @JSONField(name="ys01010202030000000100000000")
    private Double ys01010202030000000100000000;

    /**
     *本年改建数-公路已绿化里程（国道）
    **/
    @JSONField(name="ys01010202030000000101000000")
    private Double ys01010202030000000101000000;

    /**
     *本年改建数-公路已绿化里程（国道中国家高速公路）
    **/
    @JSONField(name="ys01010202030000000111000000")
    private Double ys01010202030000000111000000;

    /**
     *本年改建数-公路已绿化里程（省道）
    **/
    @JSONField(name="ys01010202030000000112000000")
    private Double ys01010202030000000112000000;

    /**
     *本年改建数-公路已绿化里程（县道）
    **/
    @JSONField(name="ys01010202030000000113000000")
    private Double ys01010202030000000113000000;

    /**
     *本年改建数-公路已绿化里程（乡道）
    **/
    @JSONField(name="ys01010202030000000102000000")
    private Double ys01010202030000000102000000;

    /**
     *本年改建数-公路已绿化里程（专用公路）
    **/
    @JSONField(name="ys01010202030000000121000000")
    private Double ys01010202030000000121000000;

    public String getRecid() {
        return recid;
    }

    public void setRecid(String recid) {
        this.recid = recid;
    }

    public Double getRecver() {
        return recver;
    }

    public void setRecver(Double recver) {
        this.recver = recver;
    }

    public String getUnitid() {
        return unitid;
    }

    public void setUnitid(String unitid) {
        this.unitid = unitid;
    }

    public String getDatatime() {
        return datatime;
    }

    public void setDatatime(String datatime) {
        this.datatime = datatime;
    }

    public Double getFloatorder() {
        return floatorder;
    }

    public void setFloatorder(Double floatorder) {
        this.floatorder = floatorder;
    }

    public Double getYs01010201000000000100000000() {
        return ys01010201000000000100000000;
    }

    public void setYs01010201000000000100000000(Double ys01010201000000000100000000) {
        this.ys01010201000000000100000000 = ys01010201000000000100000000;
    }

    public Double getYs01010201000000000101000000() {
        return ys01010201000000000101000000;
    }

    public void setYs01010201000000000101000000(Double ys01010201000000000101000000) {
        this.ys01010201000000000101000000 = ys01010201000000000101000000;
    }

    public Double getYs01010201000000000111000000() {
        return ys01010201000000000111000000;
    }

    public void setYs01010201000000000111000000(Double ys01010201000000000111000000) {
        this.ys01010201000000000111000000 = ys01010201000000000111000000;
    }

    public Double getYs01010201000000000112000000() {
        return ys01010201000000000112000000;
    }

    public void setYs01010201000000000112000000(Double ys01010201000000000112000000) {
        this.ys01010201000000000112000000 = ys01010201000000000112000000;
    }

    public Double getYs01010201000000000113000000() {
        return ys01010201000000000113000000;
    }

    public void setYs01010201000000000113000000(Double ys01010201000000000113000000) {
        this.ys01010201000000000113000000 = ys01010201000000000113000000;
    }

    public Double getYs01010201000000000102000000() {
        return ys01010201000000000102000000;
    }

    public void setYs01010201000000000102000000(Double ys01010201000000000102000000) {
        this.ys01010201000000000102000000 = ys01010201000000000102000000;
    }

    public Double getYs01010201000000000121000000() {
        return ys01010201000000000121000000;
    }

    public void setYs01010201000000000121000000(Double ys01010201000000000121000000) {
        this.ys01010201000000000121000000 = ys01010201000000000121000000;
    }

    public Double getYs01010201000000000122000000() {
        return ys01010201000000000122000000;
    }

    public void setYs01010201000000000122000000(Double ys01010201000000000122000000) {
        this.ys01010201000000000122000000 = ys01010201000000000122000000;
    }

    public Double getYs01010201000000000123000000() {
        return ys01010201000000000123000000;
    }

    public void setYs01010201000000000123000000(Double ys01010201000000000123000000) {
        this.ys01010201000000000123000000 = ys01010201000000000123000000;
    }

    public Double getYs01010201000000000124000000() {
        return ys01010201000000000124000000;
    }

    public void setYs01010201000000000124000000(Double ys01010201000000000124000000) {
        this.ys01010201000000000124000000 = ys01010201000000000124000000;
    }

    public Double getYs01010201000000000200000000() {
        return ys01010201000000000200000000;
    }

    public void setYs01010201000000000200000000(Double ys01010201000000000200000000) {
        this.ys01010201000000000200000000 = ys01010201000000000200000000;
    }

    public Double getYs01010201000000000201000000() {
        return ys01010201000000000201000000;
    }

    public void setYs01010201000000000201000000(Double ys01010201000000000201000000) {
        this.ys01010201000000000201000000 = ys01010201000000000201000000;
    }

    public Double getYs01010201000000000211000000() {
        return ys01010201000000000211000000;
    }

    public void setYs01010201000000000211000000(Double ys01010201000000000211000000) {
        this.ys01010201000000000211000000 = ys01010201000000000211000000;
    }

    public Double getYs01010201000000000212000000() {
        return ys01010201000000000212000000;
    }

    public void setYs01010201000000000212000000(Double ys01010201000000000212000000) {
        this.ys01010201000000000212000000 = ys01010201000000000212000000;
    }

    public Double getYs01010201000000000213000000() {
        return ys01010201000000000213000000;
    }

    public void setYs01010201000000000213000000(Double ys01010201000000000213000000) {
        this.ys01010201000000000213000000 = ys01010201000000000213000000;
    }

    public Double getYs01010201000000000202000000() {
        return ys01010201000000000202000000;
    }

    public void setYs01010201000000000202000000(Double ys01010201000000000202000000) {
        this.ys01010201000000000202000000 = ys01010201000000000202000000;
    }

    public Double getYs01010201000000000221000000() {
        return ys01010201000000000221000000;
    }

    public void setYs01010201000000000221000000(Double ys01010201000000000221000000) {
        this.ys01010201000000000221000000 = ys01010201000000000221000000;
    }

    public Double getYs01010201000000000222000000() {
        return ys01010201000000000222000000;
    }

    public void setYs01010201000000000222000000(Double ys01010201000000000222000000) {
        this.ys01010201000000000222000000 = ys01010201000000000222000000;
    }

    public Double getYs01010201000000000223000000() {
        return ys01010201000000000223000000;
    }

    public void setYs01010201000000000223000000(Double ys01010201000000000223000000) {
        this.ys01010201000000000223000000 = ys01010201000000000223000000;
    }

    public Double getYs01010201000000000224000000() {
        return ys01010201000000000224000000;
    }

    public void setYs01010201000000000224000000(Double ys01010201000000000224000000) {
        this.ys01010201000000000224000000 = ys01010201000000000224000000;
    }

    public Double getYs01010201010000000100000000() {
        return ys01010201010000000100000000;
    }

    public void setYs01010201010000000100000000(Double ys01010201010000000100000000) {
        this.ys01010201010000000100000000 = ys01010201010000000100000000;
    }

    public Double getYs01010201010000000101000000() {
        return ys01010201010000000101000000;
    }

    public void setYs01010201010000000101000000(Double ys01010201010000000101000000) {
        this.ys01010201010000000101000000 = ys01010201010000000101000000;
    }

    public Double getYs01010201010000000111000000() {
        return ys01010201010000000111000000;
    }

    public void setYs01010201010000000111000000(Double ys01010201010000000111000000) {
        this.ys01010201010000000111000000 = ys01010201010000000111000000;
    }

    public Double getYs01010201010000000112000000() {
        return ys01010201010000000112000000;
    }

    public void setYs01010201010000000112000000(Double ys01010201010000000112000000) {
        this.ys01010201010000000112000000 = ys01010201010000000112000000;
    }

    public Double getYs01010201010000000113000000() {
        return ys01010201010000000113000000;
    }

    public void setYs01010201010000000113000000(Double ys01010201010000000113000000) {
        this.ys01010201010000000113000000 = ys01010201010000000113000000;
    }

    public Double getYs01010201010000000102000000() {
        return ys01010201010000000102000000;
    }

    public void setYs01010201010000000102000000(Double ys01010201010000000102000000) {
        this.ys01010201010000000102000000 = ys01010201010000000102000000;
    }

    public Double getYs01010201010000000121000000() {
        return ys01010201010000000121000000;
    }

    public void setYs01010201010000000121000000(Double ys01010201010000000121000000) {
        this.ys01010201010000000121000000 = ys01010201010000000121000000;
    }

    public Double getYs01010201010000000122000000() {
        return ys01010201010000000122000000;
    }

    public void setYs01010201010000000122000000(Double ys01010201010000000122000000) {
        this.ys01010201010000000122000000 = ys01010201010000000122000000;
    }

    public Double getYs01010201010000000123000000() {
        return ys01010201010000000123000000;
    }

    public void setYs01010201010000000123000000(Double ys01010201010000000123000000) {
        this.ys01010201010000000123000000 = ys01010201010000000123000000;
    }

    public Double getYs01010201010000000124000000() {
        return ys01010201010000000124000000;
    }

    public void setYs01010201010000000124000000(Double ys01010201010000000124000000) {
        this.ys01010201010000000124000000 = ys01010201010000000124000000;
    }

    public Double getYs01010201010000000200000000() {
        return ys01010201010000000200000000;
    }

    public void setYs01010201010000000200000000(Double ys01010201010000000200000000) {
        this.ys01010201010000000200000000 = ys01010201010000000200000000;
    }

    public Double getYs01010201010000000201000000() {
        return ys01010201010000000201000000;
    }

    public void setYs01010201010000000201000000(Double ys01010201010000000201000000) {
        this.ys01010201010000000201000000 = ys01010201010000000201000000;
    }

    public Double getYs01010201010000000211000000() {
        return ys01010201010000000211000000;
    }

    public void setYs01010201010000000211000000(Double ys01010201010000000211000000) {
        this.ys01010201010000000211000000 = ys01010201010000000211000000;
    }

    public Double getYs01010201010000000212000000() {
        return ys01010201010000000212000000;
    }

    public void setYs01010201010000000212000000(Double ys01010201010000000212000000) {
        this.ys01010201010000000212000000 = ys01010201010000000212000000;
    }

    public Double getYs01010201010000000213000000() {
        return ys01010201010000000213000000;
    }

    public void setYs01010201010000000213000000(Double ys01010201010000000213000000) {
        this.ys01010201010000000213000000 = ys01010201010000000213000000;
    }

    public Double getYs01010201010000000202000000() {
        return ys01010201010000000202000000;
    }

    public void setYs01010201010000000202000000(Double ys01010201010000000202000000) {
        this.ys01010201010000000202000000 = ys01010201010000000202000000;
    }

    public Double getYs01010201010000000221000000() {
        return ys01010201010000000221000000;
    }

    public void setYs01010201010000000221000000(Double ys01010201010000000221000000) {
        this.ys01010201010000000221000000 = ys01010201010000000221000000;
    }

    public Double getYs01010201010000000222000000() {
        return ys01010201010000000222000000;
    }

    public void setYs01010201010000000222000000(Double ys01010201010000000222000000) {
        this.ys01010201010000000222000000 = ys01010201010000000222000000;
    }

    public Double getYs01010201010000000223000000() {
        return ys01010201010000000223000000;
    }

    public void setYs01010201010000000223000000(Double ys01010201010000000223000000) {
        this.ys01010201010000000223000000 = ys01010201010000000223000000;
    }

    public Double getYs01010201010000000224000000() {
        return ys01010201010000000224000000;
    }

    public void setYs01010201010000000224000000(Double ys01010201010000000224000000) {
        this.ys01010201010000000224000000 = ys01010201010000000224000000;
    }

    public Double getYs01010201010100000100000000() {
        return ys01010201010100000100000000;
    }

    public void setYs01010201010100000100000000(Double ys01010201010100000100000000) {
        this.ys01010201010100000100000000 = ys01010201010100000100000000;
    }

    public Double getYs01010201010100000101000000() {
        return ys01010201010100000101000000;
    }

    public void setYs01010201010100000101000000(Double ys01010201010100000101000000) {
        this.ys01010201010100000101000000 = ys01010201010100000101000000;
    }

    public Double getYs01010201010100000111000000() {
        return ys01010201010100000111000000;
    }

    public void setYs01010201010100000111000000(Double ys01010201010100000111000000) {
        this.ys01010201010100000111000000 = ys01010201010100000111000000;
    }

    public Double getYs01010201010100000112000000() {
        return ys01010201010100000112000000;
    }

    public void setYs01010201010100000112000000(Double ys01010201010100000112000000) {
        this.ys01010201010100000112000000 = ys01010201010100000112000000;
    }

    public Double getYs01010201010100000113000000() {
        return ys01010201010100000113000000;
    }

    public void setYs01010201010100000113000000(Double ys01010201010100000113000000) {
        this.ys01010201010100000113000000 = ys01010201010100000113000000;
    }

    public Double getYs01010201010100000102000000() {
        return ys01010201010100000102000000;
    }

    public void setYs01010201010100000102000000(Double ys01010201010100000102000000) {
        this.ys01010201010100000102000000 = ys01010201010100000102000000;
    }

    public Double getYs01010201010100000121000000() {
        return ys01010201010100000121000000;
    }

    public void setYs01010201010100000121000000(Double ys01010201010100000121000000) {
        this.ys01010201010100000121000000 = ys01010201010100000121000000;
    }

    public Double getYs01010201010100000122000000() {
        return ys01010201010100000122000000;
    }

    public void setYs01010201010100000122000000(Double ys01010201010100000122000000) {
        this.ys01010201010100000122000000 = ys01010201010100000122000000;
    }

    public Double getYs01010201010100000123000000() {
        return ys01010201010100000123000000;
    }

    public void setYs01010201010100000123000000(Double ys01010201010100000123000000) {
        this.ys01010201010100000123000000 = ys01010201010100000123000000;
    }

    public Double getYs01010201010100000124000000() {
        return ys01010201010100000124000000;
    }

    public void setYs01010201010100000124000000(Double ys01010201010100000124000000) {
        this.ys01010201010100000124000000 = ys01010201010100000124000000;
    }

    public Double getYs01010201010100000200000000() {
        return ys01010201010100000200000000;
    }

    public void setYs01010201010100000200000000(Double ys01010201010100000200000000) {
        this.ys01010201010100000200000000 = ys01010201010100000200000000;
    }

    public Double getYs01010201010100000201000000() {
        return ys01010201010100000201000000;
    }

    public void setYs01010201010100000201000000(Double ys01010201010100000201000000) {
        this.ys01010201010100000201000000 = ys01010201010100000201000000;
    }

    public Double getYs01010201010100000211000000() {
        return ys01010201010100000211000000;
    }

    public void setYs01010201010100000211000000(Double ys01010201010100000211000000) {
        this.ys01010201010100000211000000 = ys01010201010100000211000000;
    }

    public Double getYs01010201010100000212000000() {
        return ys01010201010100000212000000;
    }

    public void setYs01010201010100000212000000(Double ys01010201010100000212000000) {
        this.ys01010201010100000212000000 = ys01010201010100000212000000;
    }

    public Double getYs01010201010100000213000000() {
        return ys01010201010100000213000000;
    }

    public void setYs01010201010100000213000000(Double ys01010201010100000213000000) {
        this.ys01010201010100000213000000 = ys01010201010100000213000000;
    }

    public Double getYs01010201010100000202000000() {
        return ys01010201010100000202000000;
    }

    public void setYs01010201010100000202000000(Double ys01010201010100000202000000) {
        this.ys01010201010100000202000000 = ys01010201010100000202000000;
    }

    public Double getYs01010201010100000221000000() {
        return ys01010201010100000221000000;
    }

    public void setYs01010201010100000221000000(Double ys01010201010100000221000000) {
        this.ys01010201010100000221000000 = ys01010201010100000221000000;
    }

    public Double getYs01010201010100000222000000() {
        return ys01010201010100000222000000;
    }

    public void setYs01010201010100000222000000(Double ys01010201010100000222000000) {
        this.ys01010201010100000222000000 = ys01010201010100000222000000;
    }

    public Double getYs01010201010100000223000000() {
        return ys01010201010100000223000000;
    }

    public void setYs01010201010100000223000000(Double ys01010201010100000223000000) {
        this.ys01010201010100000223000000 = ys01010201010100000223000000;
    }

    public Double getYs01010201010100000224000000() {
        return ys01010201010100000224000000;
    }

    public void setYs01010201010100000224000000(Double ys01010201010100000224000000) {
        this.ys01010201010100000224000000 = ys01010201010100000224000000;
    }

    public Double getYs01010201020000000100000000() {
        return ys01010201020000000100000000;
    }

    public void setYs01010201020000000100000000(Double ys01010201020000000100000000) {
        this.ys01010201020000000100000000 = ys01010201020000000100000000;
    }

    public Double getYs01010201020000000101000000() {
        return ys01010201020000000101000000;
    }

    public void setYs01010201020000000101000000(Double ys01010201020000000101000000) {
        this.ys01010201020000000101000000 = ys01010201020000000101000000;
    }

    public Double getYs01010201020000000111000000() {
        return ys01010201020000000111000000;
    }

    public void setYs01010201020000000111000000(Double ys01010201020000000111000000) {
        this.ys01010201020000000111000000 = ys01010201020000000111000000;
    }

    public Double getYs01010201020000000112000000() {
        return ys01010201020000000112000000;
    }

    public void setYs01010201020000000112000000(Double ys01010201020000000112000000) {
        this.ys01010201020000000112000000 = ys01010201020000000112000000;
    }

    public Double getYs01010201020000000113000000() {
        return ys01010201020000000113000000;
    }

    public void setYs01010201020000000113000000(Double ys01010201020000000113000000) {
        this.ys01010201020000000113000000 = ys01010201020000000113000000;
    }

    public Double getYs01010201020000000102000000() {
        return ys01010201020000000102000000;
    }

    public void setYs01010201020000000102000000(Double ys01010201020000000102000000) {
        this.ys01010201020000000102000000 = ys01010201020000000102000000;
    }

    public Double getYs01010201020000000121000000() {
        return ys01010201020000000121000000;
    }

    public void setYs01010201020000000121000000(Double ys01010201020000000121000000) {
        this.ys01010201020000000121000000 = ys01010201020000000121000000;
    }

    public Double getYs01010201020000000122000000() {
        return ys01010201020000000122000000;
    }

    public void setYs01010201020000000122000000(Double ys01010201020000000122000000) {
        this.ys01010201020000000122000000 = ys01010201020000000122000000;
    }

    public Double getYs01010201020000000123000000() {
        return ys01010201020000000123000000;
    }

    public void setYs01010201020000000123000000(Double ys01010201020000000123000000) {
        this.ys01010201020000000123000000 = ys01010201020000000123000000;
    }

    public Double getYs01010201020000000124000000() {
        return ys01010201020000000124000000;
    }

    public void setYs01010201020000000124000000(Double ys01010201020000000124000000) {
        this.ys01010201020000000124000000 = ys01010201020000000124000000;
    }

    public Double getYs01010201020000000200000000() {
        return ys01010201020000000200000000;
    }

    public void setYs01010201020000000200000000(Double ys01010201020000000200000000) {
        this.ys01010201020000000200000000 = ys01010201020000000200000000;
    }

    public Double getYs01010201020000000201000000() {
        return ys01010201020000000201000000;
    }

    public void setYs01010201020000000201000000(Double ys01010201020000000201000000) {
        this.ys01010201020000000201000000 = ys01010201020000000201000000;
    }

    public Double getYs01010201020000000211000000() {
        return ys01010201020000000211000000;
    }

    public void setYs01010201020000000211000000(Double ys01010201020000000211000000) {
        this.ys01010201020000000211000000 = ys01010201020000000211000000;
    }

    public Double getYs01010201020000000212000000() {
        return ys01010201020000000212000000;
    }

    public void setYs01010201020000000212000000(Double ys01010201020000000212000000) {
        this.ys01010201020000000212000000 = ys01010201020000000212000000;
    }

    public Double getYs01010201020000000213000000() {
        return ys01010201020000000213000000;
    }

    public void setYs01010201020000000213000000(Double ys01010201020000000213000000) {
        this.ys01010201020000000213000000 = ys01010201020000000213000000;
    }

    public Double getYs01010201020000000202000000() {
        return ys01010201020000000202000000;
    }

    public void setYs01010201020000000202000000(Double ys01010201020000000202000000) {
        this.ys01010201020000000202000000 = ys01010201020000000202000000;
    }

    public Double getYs01010201020000000221000000() {
        return ys01010201020000000221000000;
    }

    public void setYs01010201020000000221000000(Double ys01010201020000000221000000) {
        this.ys01010201020000000221000000 = ys01010201020000000221000000;
    }

    public Double getYs01010201020000000222000000() {
        return ys01010201020000000222000000;
    }

    public void setYs01010201020000000222000000(Double ys01010201020000000222000000) {
        this.ys01010201020000000222000000 = ys01010201020000000222000000;
    }

    public Double getYs01010201020000000223000000() {
        return ys01010201020000000223000000;
    }

    public void setYs01010201020000000223000000(Double ys01010201020000000223000000) {
        this.ys01010201020000000223000000 = ys01010201020000000223000000;
    }

    public Double getYs01010201020000000224000000() {
        return ys01010201020000000224000000;
    }

    public void setYs01010201020000000224000000(Double ys01010201020000000224000000) {
        this.ys01010201020000000224000000 = ys01010201020000000224000000;
    }

    public Double getYs01010201030000000100000000() {
        return ys01010201030000000100000000;
    }

    public void setYs01010201030000000100000000(Double ys01010201030000000100000000) {
        this.ys01010201030000000100000000 = ys01010201030000000100000000;
    }

    public Double getYs01010201030000000101000000() {
        return ys01010201030000000101000000;
    }

    public void setYs01010201030000000101000000(Double ys01010201030000000101000000) {
        this.ys01010201030000000101000000 = ys01010201030000000101000000;
    }

    public Double getYs01010201030000000111000000() {
        return ys01010201030000000111000000;
    }

    public void setYs01010201030000000111000000(Double ys01010201030000000111000000) {
        this.ys01010201030000000111000000 = ys01010201030000000111000000;
    }

    public Double getYs01010201030000000112000000() {
        return ys01010201030000000112000000;
    }

    public void setYs01010201030000000112000000(Double ys01010201030000000112000000) {
        this.ys01010201030000000112000000 = ys01010201030000000112000000;
    }

    public Double getYs01010201030000000113000000() {
        return ys01010201030000000113000000;
    }

    public void setYs01010201030000000113000000(Double ys01010201030000000113000000) {
        this.ys01010201030000000113000000 = ys01010201030000000113000000;
    }

    public Double getYs01010201030000000102000000() {
        return ys01010201030000000102000000;
    }

    public void setYs01010201030000000102000000(Double ys01010201030000000102000000) {
        this.ys01010201030000000102000000 = ys01010201030000000102000000;
    }

    public Double getYs01010201030000000121000000() {
        return ys01010201030000000121000000;
    }

    public void setYs01010201030000000121000000(Double ys01010201030000000121000000) {
        this.ys01010201030000000121000000 = ys01010201030000000121000000;
    }

    public Double getYs01010201030000000122000000() {
        return ys01010201030000000122000000;
    }

    public void setYs01010201030000000122000000(Double ys01010201030000000122000000) {
        this.ys01010201030000000122000000 = ys01010201030000000122000000;
    }

    public Double getYs01010201030000000123000000() {
        return ys01010201030000000123000000;
    }

    public void setYs01010201030000000123000000(Double ys01010201030000000123000000) {
        this.ys01010201030000000123000000 = ys01010201030000000123000000;
    }

    public Double getYs01010201030000000124000000() {
        return ys01010201030000000124000000;
    }

    public void setYs01010201030000000124000000(Double ys01010201030000000124000000) {
        this.ys01010201030000000124000000 = ys01010201030000000124000000;
    }

    public Double getYs01010201030000000200000000() {
        return ys01010201030000000200000000;
    }

    public void setYs01010201030000000200000000(Double ys01010201030000000200000000) {
        this.ys01010201030000000200000000 = ys01010201030000000200000000;
    }

    public Double getYs01010201030000000201000000() {
        return ys01010201030000000201000000;
    }

    public void setYs01010201030000000201000000(Double ys01010201030000000201000000) {
        this.ys01010201030000000201000000 = ys01010201030000000201000000;
    }

    public Double getYs01010201030000000211000000() {
        return ys01010201030000000211000000;
    }

    public void setYs01010201030000000211000000(Double ys01010201030000000211000000) {
        this.ys01010201030000000211000000 = ys01010201030000000211000000;
    }

    public Double getYs01010201030000000212000000() {
        return ys01010201030000000212000000;
    }

    public void setYs01010201030000000212000000(Double ys01010201030000000212000000) {
        this.ys01010201030000000212000000 = ys01010201030000000212000000;
    }

    public Double getYs01010201030000000213000000() {
        return ys01010201030000000213000000;
    }

    public void setYs01010201030000000213000000(Double ys01010201030000000213000000) {
        this.ys01010201030000000213000000 = ys01010201030000000213000000;
    }

    public Double getYs01010201030000000202000000() {
        return ys01010201030000000202000000;
    }

    public void setYs01010201030000000202000000(Double ys01010201030000000202000000) {
        this.ys01010201030000000202000000 = ys01010201030000000202000000;
    }

    public Double getYs01010201030000000221000000() {
        return ys01010201030000000221000000;
    }

    public void setYs01010201030000000221000000(Double ys01010201030000000221000000) {
        this.ys01010201030000000221000000 = ys01010201030000000221000000;
    }

    public Double getYs01010201030000000222000000() {
        return ys01010201030000000222000000;
    }

    public void setYs01010201030000000222000000(Double ys01010201030000000222000000) {
        this.ys01010201030000000222000000 = ys01010201030000000222000000;
    }

    public Double getYs01010201030000000223000000() {
        return ys01010201030000000223000000;
    }

    public void setYs01010201030000000223000000(Double ys01010201030000000223000000) {
        this.ys01010201030000000223000000 = ys01010201030000000223000000;
    }

    public Double getYs01010201030000000224000000() {
        return ys01010201030000000224000000;
    }

    public void setYs01010201030000000224000000(Double ys01010201030000000224000000) {
        this.ys01010201030000000224000000 = ys01010201030000000224000000;
    }

    public Double getYs01010201040000000100000000() {
        return ys01010201040000000100000000;
    }

    public void setYs01010201040000000100000000(Double ys01010201040000000100000000) {
        this.ys01010201040000000100000000 = ys01010201040000000100000000;
    }

    public Double getYs01010201040000000101000000() {
        return ys01010201040000000101000000;
    }

    public void setYs01010201040000000101000000(Double ys01010201040000000101000000) {
        this.ys01010201040000000101000000 = ys01010201040000000101000000;
    }

    public Double getYs01010201040000000111000000() {
        return ys01010201040000000111000000;
    }

    public void setYs01010201040000000111000000(Double ys01010201040000000111000000) {
        this.ys01010201040000000111000000 = ys01010201040000000111000000;
    }

    public Double getYs01010201040000000112000000() {
        return ys01010201040000000112000000;
    }

    public void setYs01010201040000000112000000(Double ys01010201040000000112000000) {
        this.ys01010201040000000112000000 = ys01010201040000000112000000;
    }

    public Double getYs01010201040000000113000000() {
        return ys01010201040000000113000000;
    }

    public void setYs01010201040000000113000000(Double ys01010201040000000113000000) {
        this.ys01010201040000000113000000 = ys01010201040000000113000000;
    }

    public Double getYs01010201040000000102000000() {
        return ys01010201040000000102000000;
    }

    public void setYs01010201040000000102000000(Double ys01010201040000000102000000) {
        this.ys01010201040000000102000000 = ys01010201040000000102000000;
    }

    public Double getYs01010201040000000121000000() {
        return ys01010201040000000121000000;
    }

    public void setYs01010201040000000121000000(Double ys01010201040000000121000000) {
        this.ys01010201040000000121000000 = ys01010201040000000121000000;
    }

    public Double getYs01010201040000000122000000() {
        return ys01010201040000000122000000;
    }

    public void setYs01010201040000000122000000(Double ys01010201040000000122000000) {
        this.ys01010201040000000122000000 = ys01010201040000000122000000;
    }

    public Double getYs01010201040000000123000000() {
        return ys01010201040000000123000000;
    }

    public void setYs01010201040000000123000000(Double ys01010201040000000123000000) {
        this.ys01010201040000000123000000 = ys01010201040000000123000000;
    }

    public Double getYs01010201040000000124000000() {
        return ys01010201040000000124000000;
    }

    public void setYs01010201040000000124000000(Double ys01010201040000000124000000) {
        this.ys01010201040000000124000000 = ys01010201040000000124000000;
    }

    public Double getYs01010201040000000200000000() {
        return ys01010201040000000200000000;
    }

    public void setYs01010201040000000200000000(Double ys01010201040000000200000000) {
        this.ys01010201040000000200000000 = ys01010201040000000200000000;
    }

    public Double getYs01010201040000000201000000() {
        return ys01010201040000000201000000;
    }

    public void setYs01010201040000000201000000(Double ys01010201040000000201000000) {
        this.ys01010201040000000201000000 = ys01010201040000000201000000;
    }

    public Double getYs01010201040000000211000000() {
        return ys01010201040000000211000000;
    }

    public void setYs01010201040000000211000000(Double ys01010201040000000211000000) {
        this.ys01010201040000000211000000 = ys01010201040000000211000000;
    }

    public Double getYs01010201040000000212000000() {
        return ys01010201040000000212000000;
    }

    public void setYs01010201040000000212000000(Double ys01010201040000000212000000) {
        this.ys01010201040000000212000000 = ys01010201040000000212000000;
    }

    public Double getYs01010201040000000213000000() {
        return ys01010201040000000213000000;
    }

    public void setYs01010201040000000213000000(Double ys01010201040000000213000000) {
        this.ys01010201040000000213000000 = ys01010201040000000213000000;
    }

    public Double getYs01010201040000000202000000() {
        return ys01010201040000000202000000;
    }

    public void setYs01010201040000000202000000(Double ys01010201040000000202000000) {
        this.ys01010201040000000202000000 = ys01010201040000000202000000;
    }

    public Double getYs01010201040000000221000000() {
        return ys01010201040000000221000000;
    }

    public void setYs01010201040000000221000000(Double ys01010201040000000221000000) {
        this.ys01010201040000000221000000 = ys01010201040000000221000000;
    }

    public Double getYs01010201040000000222000000() {
        return ys01010201040000000222000000;
    }

    public void setYs01010201040000000222000000(Double ys01010201040000000222000000) {
        this.ys01010201040000000222000000 = ys01010201040000000222000000;
    }

    public Double getYs01010201040000000223000000() {
        return ys01010201040000000223000000;
    }

    public void setYs01010201040000000223000000(Double ys01010201040000000223000000) {
        this.ys01010201040000000223000000 = ys01010201040000000223000000;
    }

    public Double getYs01010201040000000224000000() {
        return ys01010201040000000224000000;
    }

    public void setYs01010201040000000224000000(Double ys01010201040000000224000000) {
        this.ys01010201040000000224000000 = ys01010201040000000224000000;
    }

    public Double getYs01010201050000000100000000() {
        return ys01010201050000000100000000;
    }

    public void setYs01010201050000000100000000(Double ys01010201050000000100000000) {
        this.ys01010201050000000100000000 = ys01010201050000000100000000;
    }

    public Double getYs01010201050000000101000000() {
        return ys01010201050000000101000000;
    }

    public void setYs01010201050000000101000000(Double ys01010201050000000101000000) {
        this.ys01010201050000000101000000 = ys01010201050000000101000000;
    }

    public Double getYs01010201050000000111000000() {
        return ys01010201050000000111000000;
    }

    public void setYs01010201050000000111000000(Double ys01010201050000000111000000) {
        this.ys01010201050000000111000000 = ys01010201050000000111000000;
    }

    public Double getYs01010201050000000112000000() {
        return ys01010201050000000112000000;
    }

    public void setYs01010201050000000112000000(Double ys01010201050000000112000000) {
        this.ys01010201050000000112000000 = ys01010201050000000112000000;
    }

    public Double getYs01010201050000000113000000() {
        return ys01010201050000000113000000;
    }

    public void setYs01010201050000000113000000(Double ys01010201050000000113000000) {
        this.ys01010201050000000113000000 = ys01010201050000000113000000;
    }

    public Double getYs01010201050000000102000000() {
        return ys01010201050000000102000000;
    }

    public void setYs01010201050000000102000000(Double ys01010201050000000102000000) {
        this.ys01010201050000000102000000 = ys01010201050000000102000000;
    }

    public Double getYs01010201050000000121000000() {
        return ys01010201050000000121000000;
    }

    public void setYs01010201050000000121000000(Double ys01010201050000000121000000) {
        this.ys01010201050000000121000000 = ys01010201050000000121000000;
    }

    public Double getYs01010201050000000122000000() {
        return ys01010201050000000122000000;
    }

    public void setYs01010201050000000122000000(Double ys01010201050000000122000000) {
        this.ys01010201050000000122000000 = ys01010201050000000122000000;
    }

    public Double getYs01010201050000000123000000() {
        return ys01010201050000000123000000;
    }

    public void setYs01010201050000000123000000(Double ys01010201050000000123000000) {
        this.ys01010201050000000123000000 = ys01010201050000000123000000;
    }

    public Double getYs01010201050000000124000000() {
        return ys01010201050000000124000000;
    }

    public void setYs01010201050000000124000000(Double ys01010201050000000124000000) {
        this.ys01010201050000000124000000 = ys01010201050000000124000000;
    }

    public Double getYs01010201050000000200000000() {
        return ys01010201050000000200000000;
    }

    public void setYs01010201050000000200000000(Double ys01010201050000000200000000) {
        this.ys01010201050000000200000000 = ys01010201050000000200000000;
    }

    public Double getYs01010201050000000201000000() {
        return ys01010201050000000201000000;
    }

    public void setYs01010201050000000201000000(Double ys01010201050000000201000000) {
        this.ys01010201050000000201000000 = ys01010201050000000201000000;
    }

    public Double getYs01010201050000000211000000() {
        return ys01010201050000000211000000;
    }

    public void setYs01010201050000000211000000(Double ys01010201050000000211000000) {
        this.ys01010201050000000211000000 = ys01010201050000000211000000;
    }

    public Double getYs01010201050000000212000000() {
        return ys01010201050000000212000000;
    }

    public void setYs01010201050000000212000000(Double ys01010201050000000212000000) {
        this.ys01010201050000000212000000 = ys01010201050000000212000000;
    }

    public Double getYs01010201050000000213000000() {
        return ys01010201050000000213000000;
    }

    public void setYs01010201050000000213000000(Double ys01010201050000000213000000) {
        this.ys01010201050000000213000000 = ys01010201050000000213000000;
    }

    public Double getYs01010201050000000202000000() {
        return ys01010201050000000202000000;
    }

    public void setYs01010201050000000202000000(Double ys01010201050000000202000000) {
        this.ys01010201050000000202000000 = ys01010201050000000202000000;
    }

    public Double getYs01010201050000000221000000() {
        return ys01010201050000000221000000;
    }

    public void setYs01010201050000000221000000(Double ys01010201050000000221000000) {
        this.ys01010201050000000221000000 = ys01010201050000000221000000;
    }

    public Double getYs01010201050000000222000000() {
        return ys01010201050000000222000000;
    }

    public void setYs01010201050000000222000000(Double ys01010201050000000222000000) {
        this.ys01010201050000000222000000 = ys01010201050000000222000000;
    }

    public Double getYs01010201050000000223000000() {
        return ys01010201050000000223000000;
    }

    public void setYs01010201050000000223000000(Double ys01010201050000000223000000) {
        this.ys01010201050000000223000000 = ys01010201050000000223000000;
    }

    public Double getYs01010201050000000224000000() {
        return ys01010201050000000224000000;
    }

    public void setYs01010201050000000224000000(Double ys01010201050000000224000000) {
        this.ys01010201050000000224000000 = ys01010201050000000224000000;
    }

    public Double getYs01010201060000000100000000() {
        return ys01010201060000000100000000;
    }

    public void setYs01010201060000000100000000(Double ys01010201060000000100000000) {
        this.ys01010201060000000100000000 = ys01010201060000000100000000;
    }

    public Double getYs01010201060000000101000000() {
        return ys01010201060000000101000000;
    }

    public void setYs01010201060000000101000000(Double ys01010201060000000101000000) {
        this.ys01010201060000000101000000 = ys01010201060000000101000000;
    }

    public Double getYs01010201060000000111000000() {
        return ys01010201060000000111000000;
    }

    public void setYs01010201060000000111000000(Double ys01010201060000000111000000) {
        this.ys01010201060000000111000000 = ys01010201060000000111000000;
    }

    public Double getYs01010201060000000112000000() {
        return ys01010201060000000112000000;
    }

    public void setYs01010201060000000112000000(Double ys01010201060000000112000000) {
        this.ys01010201060000000112000000 = ys01010201060000000112000000;
    }

    public Double getYs01010201060000000113000000() {
        return ys01010201060000000113000000;
    }

    public void setYs01010201060000000113000000(Double ys01010201060000000113000000) {
        this.ys01010201060000000113000000 = ys01010201060000000113000000;
    }

    public Double getYs01010201060000000102000000() {
        return ys01010201060000000102000000;
    }

    public void setYs01010201060000000102000000(Double ys01010201060000000102000000) {
        this.ys01010201060000000102000000 = ys01010201060000000102000000;
    }

    public Double getYs01010201060000000121000000() {
        return ys01010201060000000121000000;
    }

    public void setYs01010201060000000121000000(Double ys01010201060000000121000000) {
        this.ys01010201060000000121000000 = ys01010201060000000121000000;
    }

    public Double getYs01010201060000000122000000() {
        return ys01010201060000000122000000;
    }

    public void setYs01010201060000000122000000(Double ys01010201060000000122000000) {
        this.ys01010201060000000122000000 = ys01010201060000000122000000;
    }

    public Double getYs01010201060000000123000000() {
        return ys01010201060000000123000000;
    }

    public void setYs01010201060000000123000000(Double ys01010201060000000123000000) {
        this.ys01010201060000000123000000 = ys01010201060000000123000000;
    }

    public Double getYs01010201060000000124000000() {
        return ys01010201060000000124000000;
    }

    public void setYs01010201060000000124000000(Double ys01010201060000000124000000) {
        this.ys01010201060000000124000000 = ys01010201060000000124000000;
    }

    public Double getYs01010201060000000200000000() {
        return ys01010201060000000200000000;
    }

    public void setYs01010201060000000200000000(Double ys01010201060000000200000000) {
        this.ys01010201060000000200000000 = ys01010201060000000200000000;
    }

    public Double getYs01010201060000000201000000() {
        return ys01010201060000000201000000;
    }

    public void setYs01010201060000000201000000(Double ys01010201060000000201000000) {
        this.ys01010201060000000201000000 = ys01010201060000000201000000;
    }

    public Double getYs01010201060000000211000000() {
        return ys01010201060000000211000000;
    }

    public void setYs01010201060000000211000000(Double ys01010201060000000211000000) {
        this.ys01010201060000000211000000 = ys01010201060000000211000000;
    }

    public Double getYs01010201060000000212000000() {
        return ys01010201060000000212000000;
    }

    public void setYs01010201060000000212000000(Double ys01010201060000000212000000) {
        this.ys01010201060000000212000000 = ys01010201060000000212000000;
    }

    public Double getYs01010201060000000213000000() {
        return ys01010201060000000213000000;
    }

    public void setYs01010201060000000213000000(Double ys01010201060000000213000000) {
        this.ys01010201060000000213000000 = ys01010201060000000213000000;
    }

    public Double getYs01010201060000000202000000() {
        return ys01010201060000000202000000;
    }

    public void setYs01010201060000000202000000(Double ys01010201060000000202000000) {
        this.ys01010201060000000202000000 = ys01010201060000000202000000;
    }

    public Double getYs01010201060000000221000000() {
        return ys01010201060000000221000000;
    }

    public void setYs01010201060000000221000000(Double ys01010201060000000221000000) {
        this.ys01010201060000000221000000 = ys01010201060000000221000000;
    }

    public Double getYs01010201060000000222000000() {
        return ys01010201060000000222000000;
    }

    public void setYs01010201060000000222000000(Double ys01010201060000000222000000) {
        this.ys01010201060000000222000000 = ys01010201060000000222000000;
    }

    public Double getYs01010201060000000223000000() {
        return ys01010201060000000223000000;
    }

    public void setYs01010201060000000223000000(Double ys01010201060000000223000000) {
        this.ys01010201060000000223000000 = ys01010201060000000223000000;
    }

    public Double getYs01010201060000000224000000() {
        return ys01010201060000000224000000;
    }

    public void setYs01010201060000000224000000(Double ys01010201060000000224000000) {
        this.ys01010201060000000224000000 = ys01010201060000000224000000;
    }

    public Double getYs01010202000000000100000000() {
        return ys01010202000000000100000000;
    }

    public void setYs01010202000000000100000000(Double ys01010202000000000100000000) {
        this.ys01010202000000000100000000 = ys01010202000000000100000000;
    }

    public Double getYs01010202000000000101000000() {
        return ys01010202000000000101000000;
    }

    public void setYs01010202000000000101000000(Double ys01010202000000000101000000) {
        this.ys01010202000000000101000000 = ys01010202000000000101000000;
    }

    public Double getYs01010202000000000111000000() {
        return ys01010202000000000111000000;
    }

    public void setYs01010202000000000111000000(Double ys01010202000000000111000000) {
        this.ys01010202000000000111000000 = ys01010202000000000111000000;
    }

    public Double getYs01010202000000000112000000() {
        return ys01010202000000000112000000;
    }

    public void setYs01010202000000000112000000(Double ys01010202000000000112000000) {
        this.ys01010202000000000112000000 = ys01010202000000000112000000;
    }

    public Double getYs01010202000000000113000000() {
        return ys01010202000000000113000000;
    }

    public void setYs01010202000000000113000000(Double ys01010202000000000113000000) {
        this.ys01010202000000000113000000 = ys01010202000000000113000000;
    }

    public Double getYs01010202000000000102000000() {
        return ys01010202000000000102000000;
    }

    public void setYs01010202000000000102000000(Double ys01010202000000000102000000) {
        this.ys01010202000000000102000000 = ys01010202000000000102000000;
    }

    public Double getYs01010202000000000121000000() {
        return ys01010202000000000121000000;
    }

    public void setYs01010202000000000121000000(Double ys01010202000000000121000000) {
        this.ys01010202000000000121000000 = ys01010202000000000121000000;
    }

    public Double getYs01010202000000000122000000() {
        return ys01010202000000000122000000;
    }

    public void setYs01010202000000000122000000(Double ys01010202000000000122000000) {
        this.ys01010202000000000122000000 = ys01010202000000000122000000;
    }

    public Double getYs01010202000000000123000000() {
        return ys01010202000000000123000000;
    }

    public void setYs01010202000000000123000000(Double ys01010202000000000123000000) {
        this.ys01010202000000000123000000 = ys01010202000000000123000000;
    }

    public Double getYs01010202000000000124000000() {
        return ys01010202000000000124000000;
    }

    public void setYs01010202000000000124000000(Double ys01010202000000000124000000) {
        this.ys01010202000000000124000000 = ys01010202000000000124000000;
    }

    public Double getYs01010202000000000200000000() {
        return ys01010202000000000200000000;
    }

    public void setYs01010202000000000200000000(Double ys01010202000000000200000000) {
        this.ys01010202000000000200000000 = ys01010202000000000200000000;
    }

    public Double getYs01010202000000000201000000() {
        return ys01010202000000000201000000;
    }

    public void setYs01010202000000000201000000(Double ys01010202000000000201000000) {
        this.ys01010202000000000201000000 = ys01010202000000000201000000;
    }

    public Double getYs01010202000000000211000000() {
        return ys01010202000000000211000000;
    }

    public void setYs01010202000000000211000000(Double ys01010202000000000211000000) {
        this.ys01010202000000000211000000 = ys01010202000000000211000000;
    }

    public Double getYs01010202000000000212000000() {
        return ys01010202000000000212000000;
    }

    public void setYs01010202000000000212000000(Double ys01010202000000000212000000) {
        this.ys01010202000000000212000000 = ys01010202000000000212000000;
    }

    public Double getYs01010202000000000213000000() {
        return ys01010202000000000213000000;
    }

    public void setYs01010202000000000213000000(Double ys01010202000000000213000000) {
        this.ys01010202000000000213000000 = ys01010202000000000213000000;
    }

    public Double getYs01010202000000000202000000() {
        return ys01010202000000000202000000;
    }

    public void setYs01010202000000000202000000(Double ys01010202000000000202000000) {
        this.ys01010202000000000202000000 = ys01010202000000000202000000;
    }

    public Double getYs01010202000000000221000000() {
        return ys01010202000000000221000000;
    }

    public void setYs01010202000000000221000000(Double ys01010202000000000221000000) {
        this.ys01010202000000000221000000 = ys01010202000000000221000000;
    }

    public Double getYs01010202000000000222000000() {
        return ys01010202000000000222000000;
    }

    public void setYs01010202000000000222000000(Double ys01010202000000000222000000) {
        this.ys01010202000000000222000000 = ys01010202000000000222000000;
    }

    public Double getYs01010202000000000223000000() {
        return ys01010202000000000223000000;
    }

    public void setYs01010202000000000223000000(Double ys01010202000000000223000000) {
        this.ys01010202000000000223000000 = ys01010202000000000223000000;
    }

    public Double getYs01010202000000000224000000() {
        return ys01010202000000000224000000;
    }

    public void setYs01010202000000000224000000(Double ys01010202000000000224000000) {
        this.ys01010202000000000224000000 = ys01010202000000000224000000;
    }

    public Double getYs01010202010000000100000000() {
        return ys01010202010000000100000000;
    }

    public void setYs01010202010000000100000000(Double ys01010202010000000100000000) {
        this.ys01010202010000000100000000 = ys01010202010000000100000000;
    }

    public Double getYs01010202010000000101000000() {
        return ys01010202010000000101000000;
    }

    public void setYs01010202010000000101000000(Double ys01010202010000000101000000) {
        this.ys01010202010000000101000000 = ys01010202010000000101000000;
    }

    public Double getYs01010202010000000111000000() {
        return ys01010202010000000111000000;
    }

    public void setYs01010202010000000111000000(Double ys01010202010000000111000000) {
        this.ys01010202010000000111000000 = ys01010202010000000111000000;
    }

    public Double getYs01010202010000000112000000() {
        return ys01010202010000000112000000;
    }

    public void setYs01010202010000000112000000(Double ys01010202010000000112000000) {
        this.ys01010202010000000112000000 = ys01010202010000000112000000;
    }

    public Double getYs01010202010000000113000000() {
        return ys01010202010000000113000000;
    }

    public void setYs01010202010000000113000000(Double ys01010202010000000113000000) {
        this.ys01010202010000000113000000 = ys01010202010000000113000000;
    }

    public Double getYs01010202010000000102000000() {
        return ys01010202010000000102000000;
    }

    public void setYs01010202010000000102000000(Double ys01010202010000000102000000) {
        this.ys01010202010000000102000000 = ys01010202010000000102000000;
    }

    public Double getYs01010202010000000121000000() {
        return ys01010202010000000121000000;
    }

    public void setYs01010202010000000121000000(Double ys01010202010000000121000000) {
        this.ys01010202010000000121000000 = ys01010202010000000121000000;
    }

    public Double getYs01010202010000000122000000() {
        return ys01010202010000000122000000;
    }

    public void setYs01010202010000000122000000(Double ys01010202010000000122000000) {
        this.ys01010202010000000122000000 = ys01010202010000000122000000;
    }

    public Double getYs01010202010000000123000000() {
        return ys01010202010000000123000000;
    }

    public void setYs01010202010000000123000000(Double ys01010202010000000123000000) {
        this.ys01010202010000000123000000 = ys01010202010000000123000000;
    }

    public Double getYs01010202010000000124000000() {
        return ys01010202010000000124000000;
    }

    public void setYs01010202010000000124000000(Double ys01010202010000000124000000) {
        this.ys01010202010000000124000000 = ys01010202010000000124000000;
    }

    public Double getYs01010202010000000200000000() {
        return ys01010202010000000200000000;
    }

    public void setYs01010202010000000200000000(Double ys01010202010000000200000000) {
        this.ys01010202010000000200000000 = ys01010202010000000200000000;
    }

    public Double getYs01010202010000000201000000() {
        return ys01010202010000000201000000;
    }

    public void setYs01010202010000000201000000(Double ys01010202010000000201000000) {
        this.ys01010202010000000201000000 = ys01010202010000000201000000;
    }

    public Double getYs01010202010000000211000000() {
        return ys01010202010000000211000000;
    }

    public void setYs01010202010000000211000000(Double ys01010202010000000211000000) {
        this.ys01010202010000000211000000 = ys01010202010000000211000000;
    }

    public Double getYs01010202010000000212000000() {
        return ys01010202010000000212000000;
    }

    public void setYs01010202010000000212000000(Double ys01010202010000000212000000) {
        this.ys01010202010000000212000000 = ys01010202010000000212000000;
    }

    public Double getYs01010202010000000213000000() {
        return ys01010202010000000213000000;
    }

    public void setYs01010202010000000213000000(Double ys01010202010000000213000000) {
        this.ys01010202010000000213000000 = ys01010202010000000213000000;
    }

    public Double getYs01010202010000000202000000() {
        return ys01010202010000000202000000;
    }

    public void setYs01010202010000000202000000(Double ys01010202010000000202000000) {
        this.ys01010202010000000202000000 = ys01010202010000000202000000;
    }

    public Double getYs01010202010000000221000000() {
        return ys01010202010000000221000000;
    }

    public void setYs01010202010000000221000000(Double ys01010202010000000221000000) {
        this.ys01010202010000000221000000 = ys01010202010000000221000000;
    }

    public Double getYs01010202010000000222000000() {
        return ys01010202010000000222000000;
    }

    public void setYs01010202010000000222000000(Double ys01010202010000000222000000) {
        this.ys01010202010000000222000000 = ys01010202010000000222000000;
    }

    public Double getYs01010202010000000223000000() {
        return ys01010202010000000223000000;
    }

    public void setYs01010202010000000223000000(Double ys01010202010000000223000000) {
        this.ys01010202010000000223000000 = ys01010202010000000223000000;
    }

    public Double getYs01010202010000000224000000() {
        return ys01010202010000000224000000;
    }

    public void setYs01010202010000000224000000(Double ys01010202010000000224000000) {
        this.ys01010202010000000224000000 = ys01010202010000000224000000;
    }

    public Double getYs01010202010100000100000000() {
        return ys01010202010100000100000000;
    }

    public void setYs01010202010100000100000000(Double ys01010202010100000100000000) {
        this.ys01010202010100000100000000 = ys01010202010100000100000000;
    }

    public Double getYs01010202010100000101000000() {
        return ys01010202010100000101000000;
    }

    public void setYs01010202010100000101000000(Double ys01010202010100000101000000) {
        this.ys01010202010100000101000000 = ys01010202010100000101000000;
    }

    public Double getYs01010202010100000111000000() {
        return ys01010202010100000111000000;
    }

    public void setYs01010202010100000111000000(Double ys01010202010100000111000000) {
        this.ys01010202010100000111000000 = ys01010202010100000111000000;
    }

    public Double getYs01010202010100000112000000() {
        return ys01010202010100000112000000;
    }

    public void setYs01010202010100000112000000(Double ys01010202010100000112000000) {
        this.ys01010202010100000112000000 = ys01010202010100000112000000;
    }

    public Double getYs01010202010100000113000000() {
        return ys01010202010100000113000000;
    }

    public void setYs01010202010100000113000000(Double ys01010202010100000113000000) {
        this.ys01010202010100000113000000 = ys01010202010100000113000000;
    }

    public Double getYs01010202010100000102000000() {
        return ys01010202010100000102000000;
    }

    public void setYs01010202010100000102000000(Double ys01010202010100000102000000) {
        this.ys01010202010100000102000000 = ys01010202010100000102000000;
    }

    public Double getYs01010202010100000121000000() {
        return ys01010202010100000121000000;
    }

    public void setYs01010202010100000121000000(Double ys01010202010100000121000000) {
        this.ys01010202010100000121000000 = ys01010202010100000121000000;
    }

    public Double getYs01010202010100000122000000() {
        return ys01010202010100000122000000;
    }

    public void setYs01010202010100000122000000(Double ys01010202010100000122000000) {
        this.ys01010202010100000122000000 = ys01010202010100000122000000;
    }

    public Double getYs01010202010100000123000000() {
        return ys01010202010100000123000000;
    }

    public void setYs01010202010100000123000000(Double ys01010202010100000123000000) {
        this.ys01010202010100000123000000 = ys01010202010100000123000000;
    }

    public Double getYs01010202010100000124000000() {
        return ys01010202010100000124000000;
    }

    public void setYs01010202010100000124000000(Double ys01010202010100000124000000) {
        this.ys01010202010100000124000000 = ys01010202010100000124000000;
    }

    public Double getYs01010202010100000200000000() {
        return ys01010202010100000200000000;
    }

    public void setYs01010202010100000200000000(Double ys01010202010100000200000000) {
        this.ys01010202010100000200000000 = ys01010202010100000200000000;
    }

    public Double getYs01010202010100000201000000() {
        return ys01010202010100000201000000;
    }

    public void setYs01010202010100000201000000(Double ys01010202010100000201000000) {
        this.ys01010202010100000201000000 = ys01010202010100000201000000;
    }

    public Double getYs01010202010100000211000000() {
        return ys01010202010100000211000000;
    }

    public void setYs01010202010100000211000000(Double ys01010202010100000211000000) {
        this.ys01010202010100000211000000 = ys01010202010100000211000000;
    }

    public Double getYs01010202010100000212000000() {
        return ys01010202010100000212000000;
    }

    public void setYs01010202010100000212000000(Double ys01010202010100000212000000) {
        this.ys01010202010100000212000000 = ys01010202010100000212000000;
    }

    public Double getYs01010202010100000213000000() {
        return ys01010202010100000213000000;
    }

    public void setYs01010202010100000213000000(Double ys01010202010100000213000000) {
        this.ys01010202010100000213000000 = ys01010202010100000213000000;
    }

    public Double getYs01010202010100000202000000() {
        return ys01010202010100000202000000;
    }

    public void setYs01010202010100000202000000(Double ys01010202010100000202000000) {
        this.ys01010202010100000202000000 = ys01010202010100000202000000;
    }

    public Double getYs01010202010100000221000000() {
        return ys01010202010100000221000000;
    }

    public void setYs01010202010100000221000000(Double ys01010202010100000221000000) {
        this.ys01010202010100000221000000 = ys01010202010100000221000000;
    }

    public Double getYs01010202010100000222000000() {
        return ys01010202010100000222000000;
    }

    public void setYs01010202010100000222000000(Double ys01010202010100000222000000) {
        this.ys01010202010100000222000000 = ys01010202010100000222000000;
    }

    public Double getYs01010202010100000223000000() {
        return ys01010202010100000223000000;
    }

    public void setYs01010202010100000223000000(Double ys01010202010100000223000000) {
        this.ys01010202010100000223000000 = ys01010202010100000223000000;
    }

    public Double getYs01010202010100000224000000() {
        return ys01010202010100000224000000;
    }

    public void setYs01010202010100000224000000(Double ys01010202010100000224000000) {
        this.ys01010202010100000224000000 = ys01010202010100000224000000;
    }

    public Double getYs01010202020000000100000000() {
        return ys01010202020000000100000000;
    }

    public void setYs01010202020000000100000000(Double ys01010202020000000100000000) {
        this.ys01010202020000000100000000 = ys01010202020000000100000000;
    }

    public Double getYs01010202020000000101000000() {
        return ys01010202020000000101000000;
    }

    public void setYs01010202020000000101000000(Double ys01010202020000000101000000) {
        this.ys01010202020000000101000000 = ys01010202020000000101000000;
    }

    public Double getYs01010202020000000111000000() {
        return ys01010202020000000111000000;
    }

    public void setYs01010202020000000111000000(Double ys01010202020000000111000000) {
        this.ys01010202020000000111000000 = ys01010202020000000111000000;
    }

    public Double getYs01010202020000000112000000() {
        return ys01010202020000000112000000;
    }

    public void setYs01010202020000000112000000(Double ys01010202020000000112000000) {
        this.ys01010202020000000112000000 = ys01010202020000000112000000;
    }

    public Double getYs01010202020000000113000000() {
        return ys01010202020000000113000000;
    }

    public void setYs01010202020000000113000000(Double ys01010202020000000113000000) {
        this.ys01010202020000000113000000 = ys01010202020000000113000000;
    }

    public Double getYs01010202020000000102000000() {
        return ys01010202020000000102000000;
    }

    public void setYs01010202020000000102000000(Double ys01010202020000000102000000) {
        this.ys01010202020000000102000000 = ys01010202020000000102000000;
    }

    public Double getYs01010202020000000121000000() {
        return ys01010202020000000121000000;
    }

    public void setYs01010202020000000121000000(Double ys01010202020000000121000000) {
        this.ys01010202020000000121000000 = ys01010202020000000121000000;
    }

    public Double getYs01010202020000000122000000() {
        return ys01010202020000000122000000;
    }

    public void setYs01010202020000000122000000(Double ys01010202020000000122000000) {
        this.ys01010202020000000122000000 = ys01010202020000000122000000;
    }

    public Double getYs01010202020000000123000000() {
        return ys01010202020000000123000000;
    }

    public void setYs01010202020000000123000000(Double ys01010202020000000123000000) {
        this.ys01010202020000000123000000 = ys01010202020000000123000000;
    }

    public Double getYs01010202020000000124000000() {
        return ys01010202020000000124000000;
    }

    public void setYs01010202020000000124000000(Double ys01010202020000000124000000) {
        this.ys01010202020000000124000000 = ys01010202020000000124000000;
    }

    public Double getYs01010202020000000200000000() {
        return ys01010202020000000200000000;
    }

    public void setYs01010202020000000200000000(Double ys01010202020000000200000000) {
        this.ys01010202020000000200000000 = ys01010202020000000200000000;
    }

    public Double getYs01010202020000000201000000() {
        return ys01010202020000000201000000;
    }

    public void setYs01010202020000000201000000(Double ys01010202020000000201000000) {
        this.ys01010202020000000201000000 = ys01010202020000000201000000;
    }

    public Double getYs01010202020000000211000000() {
        return ys01010202020000000211000000;
    }

    public void setYs01010202020000000211000000(Double ys01010202020000000211000000) {
        this.ys01010202020000000211000000 = ys01010202020000000211000000;
    }

    public Double getYs01010202020000000212000000() {
        return ys01010202020000000212000000;
    }

    public void setYs01010202020000000212000000(Double ys01010202020000000212000000) {
        this.ys01010202020000000212000000 = ys01010202020000000212000000;
    }

    public Double getYs01010202020000000213000000() {
        return ys01010202020000000213000000;
    }

    public void setYs01010202020000000213000000(Double ys01010202020000000213000000) {
        this.ys01010202020000000213000000 = ys01010202020000000213000000;
    }

    public Double getYs01010202020000000202000000() {
        return ys01010202020000000202000000;
    }

    public void setYs01010202020000000202000000(Double ys01010202020000000202000000) {
        this.ys01010202020000000202000000 = ys01010202020000000202000000;
    }

    public Double getYs01010202020000000221000000() {
        return ys01010202020000000221000000;
    }

    public void setYs01010202020000000221000000(Double ys01010202020000000221000000) {
        this.ys01010202020000000221000000 = ys01010202020000000221000000;
    }

    public Double getYs01010202020000000222000000() {
        return ys01010202020000000222000000;
    }

    public void setYs01010202020000000222000000(Double ys01010202020000000222000000) {
        this.ys01010202020000000222000000 = ys01010202020000000222000000;
    }

    public Double getYs01010202020000000223000000() {
        return ys01010202020000000223000000;
    }

    public void setYs01010202020000000223000000(Double ys01010202020000000223000000) {
        this.ys01010202020000000223000000 = ys01010202020000000223000000;
    }

    public Double getYs01010202020000000224000000() {
        return ys01010202020000000224000000;
    }

    public void setYs01010202020000000224000000(Double ys01010202020000000224000000) {
        this.ys01010202020000000224000000 = ys01010202020000000224000000;
    }

    public Double getYs01010202030000000100000000() {
        return ys01010202030000000100000000;
    }

    public void setYs01010202030000000100000000(Double ys01010202030000000100000000) {
        this.ys01010202030000000100000000 = ys01010202030000000100000000;
    }

    public Double getYs01010202030000000101000000() {
        return ys01010202030000000101000000;
    }

    public void setYs01010202030000000101000000(Double ys01010202030000000101000000) {
        this.ys01010202030000000101000000 = ys01010202030000000101000000;
    }

    public Double getYs01010202030000000111000000() {
        return ys01010202030000000111000000;
    }

    public void setYs01010202030000000111000000(Double ys01010202030000000111000000) {
        this.ys01010202030000000111000000 = ys01010202030000000111000000;
    }

    public Double getYs01010202030000000112000000() {
        return ys01010202030000000112000000;
    }

    public void setYs01010202030000000112000000(Double ys01010202030000000112000000) {
        this.ys01010202030000000112000000 = ys01010202030000000112000000;
    }

    public Double getYs01010202030000000113000000() {
        return ys01010202030000000113000000;
    }

    public void setYs01010202030000000113000000(Double ys01010202030000000113000000) {
        this.ys01010202030000000113000000 = ys01010202030000000113000000;
    }

    public Double getYs01010202030000000102000000() {
        return ys01010202030000000102000000;
    }

    public void setYs01010202030000000102000000(Double ys01010202030000000102000000) {
        this.ys01010202030000000102000000 = ys01010202030000000102000000;
    }

    public Double getYs01010202030000000121000000() {
        return ys01010202030000000121000000;
    }

    public void setYs01010202030000000121000000(Double ys01010202030000000121000000) {
        this.ys01010202030000000121000000 = ys01010202030000000121000000;
    }

}