package com.meixiang.beauty.webapp.traffic.dto.sjtystjfxjc;

import com.alibaba.fastjson.annotation.JSONField;
import java.util.Date;
import java.util.List;

public class Ttjjhjht8DTO {


    /**
     * 序列号
     **/
    @JSONField(name="serialNo")
    private Integer serialNo;

    /**
     *行标识
    **/
    @JSONField(name="recid")
    private String recid;

    /**
     *行版本
    **/
    @JSONField(name="recver")
    private Double recver;

    /**
     *单位
    **/
    @JSONField(name="unitid")
    private String unitid;

    /**
     *数据时期
    **/
    @JSONField(name="datatime")
    private String datatime;

    /**
     *浮动行顺序号
    **/
    @JSONField(name="floatorder")
    private Double floatorder;

    /**
     *机动船-艘数
    **/
    @JSONField(name="ys02020101000000000100000000")
    private Double ys02020101000000000100000000;

    /**
     *机动船-个体艘数
    **/
    @JSONField(name="ys02020101000000000101000000")
    private Double ys02020101000000000101000000;

    /**
     *机动船-内河艘数
    **/
    @JSONField(name="ys02020101000000000102000000")
    private Double ys02020101000000000102000000;

    /**
     *机动船-内河个体艘数
    **/
    @JSONField(name="ys02020101000000000102010000")
    private Double ys02020101000000000102010000;

    /**
     *机动船-沿海艘数
    **/
    @JSONField(name="ys02020101000000000103000000")
    private Double ys02020101000000000103000000;

    /**
     *机动船-沿海个体艘数
    **/
    @JSONField(name="ys02020101000000000103010000")
    private Double ys02020101000000000103010000;

    /**
     *机动船-远洋艘数
    **/
    @JSONField(name="ys02020101000000000104000000")
    private Double ys02020101000000000104000000;

    /**
     *机动船-总吨
    **/
    @JSONField(name="ys02020101000000000200000000")
    private Double ys02020101000000000200000000;

    /**
     *机动船-个体总吨
    **/
    @JSONField(name="ys02020101000000000201000000")
    private Double ys02020101000000000201000000;

    /**
     *机动船-内河总吨
    **/
    @JSONField(name="ys02020101000000000202000000")
    private Double ys02020101000000000202000000;

    /**
     *机动船-内河个体总吨
    **/
    @JSONField(name="ys02020101000000000202010000")
    private Double ys02020101000000000202010000;

    /**
     *机动船-沿海总吨
    **/
    @JSONField(name="ys02020101000000000203000000")
    private Double ys02020101000000000203000000;

    /**
     *机动船-沿海个体总吨
    **/
    @JSONField(name="ys02020101000000000203010000")
    private Double ys02020101000000000203010000;

    /**
     *机动船-远洋总吨
    **/
    @JSONField(name="ys02020101000000000204000000")
    private Double ys02020101000000000204000000;

    /**
     *机动船-总载重量
    **/
    @JSONField(name="ys02020101000000000300000000")
    private Double ys02020101000000000300000000;

    /**
     *机动船-个体总载重量
    **/
    @JSONField(name="ys02020101000000000301000000")
    private Double ys02020101000000000301000000;

    /**
     *机动船-内河总载重量
    **/
    @JSONField(name="ys02020101000000000302000000")
    private Double ys02020101000000000302000000;

    /**
     *机动船-内河个体总载重量
    **/
    @JSONField(name="ys02020101000000000302010000")
    private Double ys02020101000000000302010000;

    /**
     *机动船-沿海总载重量
    **/
    @JSONField(name="ys02020101000000000303000000")
    private Double ys02020101000000000303000000;

    /**
     *机动船-沿海个体总载重量
    **/
    @JSONField(name="ys02020101000000000303010000")
    private Double ys02020101000000000303010000;

    /**
     *机动船-远洋总载重量
    **/
    @JSONField(name="ys02020101000000000304000000")
    private Double ys02020101000000000304000000;

    /**
     *机动船-净载重量
    **/
    @JSONField(name="ys02020101000000000400000000")
    private Double ys02020101000000000400000000;

    /**
     *机动船-个体净载重量
    **/
    @JSONField(name="ys02020101000000000401000000")
    private Double ys02020101000000000401000000;

    /**
     *机动船-内河净载重量
    **/
    @JSONField(name="ys02020101000000000402000000")
    private Double ys02020101000000000402000000;

    /**
     *机动船-内河个体净载重量
    **/
    @JSONField(name="ys02020101000000000402010000")
    private Double ys02020101000000000402010000;

    /**
     *机动船-沿海净载重量
    **/
    @JSONField(name="ys02020101000000000403000000")
    private Double ys02020101000000000403000000;

    /**
     *机动船-沿海个体净载重量
    **/
    @JSONField(name="ys02020101000000000403010000")
    private Double ys02020101000000000403010000;

    /**
     *机动船-远洋净载重量
    **/
    @JSONField(name="ys02020101000000000404000000")
    private Double ys02020101000000000404000000;

    /**
     *机动船-载客量
    **/
    @JSONField(name="ys02020101000000000500000000")
    private Double ys02020101000000000500000000;

    /**
     *机动船-个体载客量
    **/
    @JSONField(name="ys02020101000000000501000000")
    private Double ys02020101000000000501000000;

    /**
     *机动船-内河载客量
    **/
    @JSONField(name="ys02020101000000000502000000")
    private Double ys02020101000000000502000000;

    /**
     *机动船-内河个体载客量
    **/
    @JSONField(name="ys02020101000000000502010000")
    private Double ys02020101000000000502010000;

    /**
     *机动船-沿海载客量
    **/
    @JSONField(name="ys02020101000000000503000000")
    private Double ys02020101000000000503000000;

    /**
     *机动船-沿海个体载客量
    **/
    @JSONField(name="ys02020101000000000503010000")
    private Double ys02020101000000000503010000;

    /**
     *机动船-远洋载客量
    **/
    @JSONField(name="ys02020101000000000504000000")
    private Double ys02020101000000000504000000;

    /**
     *机动船-标准箱位
    **/
    @JSONField(name="ys02020101000000000600000000")
    private Double ys02020101000000000600000000;

    /**
     *机动船-个体标准箱位
    **/
    @JSONField(name="ys02020101000000000601000000")
    private Double ys02020101000000000601000000;

    /**
     *机动船-内河标准箱位
    **/
    @JSONField(name="ys02020101000000000602000000")
    private Double ys02020101000000000602000000;

    /**
     *机动船-内河个体标准箱位
    **/
    @JSONField(name="ys02020101000000000602010000")
    private Double ys02020101000000000602010000;

    /**
     *机动船-沿海标准箱位
    **/
    @JSONField(name="ys02020101000000000603000000")
    private Double ys02020101000000000603000000;

    /**
     *机动船-沿海个体标准箱位
    **/
    @JSONField(name="ys02020101000000000603010000")
    private Double ys02020101000000000603010000;

    /**
     *机动船-远洋标准箱位
    **/
    @JSONField(name="ys02020101000000000604000000")
    private Double ys02020101000000000604000000;

    /**
     *机动船-功率
    **/
    @JSONField(name="ys02020101000000000700000000")
    private Double ys02020101000000000700000000;

    /**
     *机动船-个体功率
    **/
    @JSONField(name="ys02020101000000000701000000")
    private Double ys02020101000000000701000000;

    /**
     *机动船-内河功率
    **/
    @JSONField(name="ys02020101000000000702000000")
    private Double ys02020101000000000702000000;

    /**
     *机动船-内河个体功率
    **/
    @JSONField(name="ys02020101000000000702010000")
    private Double ys02020101000000000702010000;

    /**
     *机动船-沿海功率
    **/
    @JSONField(name="ys02020101000000000703000000")
    private Double ys02020101000000000703000000;

    /**
     *机动船-沿海个体功率
    **/
    @JSONField(name="ys02020101000000000703010000")
    private Double ys02020101000000000703010000;

    /**
     *机动船-远洋功率
    **/
    @JSONField(name="ys02020101000000000704000000")
    private Double ys02020101000000000704000000;

    /**
     *客船-艘数
    **/
    @JSONField(name="ys02020101010000000100000000")
    private Double ys02020101010000000100000000;

    /**
     *客船-个体艘数
    **/
    @JSONField(name="ys02020101010000000101000000")
    private Double ys02020101010000000101000000;

    /**
     *客船-内河艘数
    **/
    @JSONField(name="ys02020101010000000102000000")
    private Double ys02020101010000000102000000;

    /**
     *客船-内河个体艘数
    **/
    @JSONField(name="ys02020101010000000102010000")
    private Double ys02020101010000000102010000;

    /**
     *客船-沿海艘数
    **/
    @JSONField(name="ys02020101010000000103000000")
    private Double ys02020101010000000103000000;

    /**
     *客船-沿海个体艘数
    **/
    @JSONField(name="ys02020101010000000103010000")
    private Double ys02020101010000000103010000;

    /**
     *客船-远洋艘数
    **/
    @JSONField(name="ys02020101010000000104000000")
    private Double ys02020101010000000104000000;

    /**
     *客船-总吨
    **/
    @JSONField(name="ys02020101010000000200000000")
    private Double ys02020101010000000200000000;

    /**
     *客船-个体总吨
    **/
    @JSONField(name="ys02020101010000000201000000")
    private Double ys02020101010000000201000000;

    /**
     *客船-内河总吨
    **/
    @JSONField(name="ys02020101010000000202000000")
    private Double ys02020101010000000202000000;

    /**
     *客船-内河个体总吨
    **/
    @JSONField(name="ys02020101010000000202010000")
    private Double ys02020101010000000202010000;

    /**
     *客船-沿海总吨
    **/
    @JSONField(name="ys02020101010000000203000000")
    private Double ys02020101010000000203000000;

    /**
     *客船-沿海个体总吨
    **/
    @JSONField(name="ys02020101010000000203010000")
    private Double ys02020101010000000203010000;

    /**
     *客船-远洋总吨
    **/
    @JSONField(name="ys02020101010000000204000000")
    private Double ys02020101010000000204000000;

    /**
     *客船-总载重量
    **/
    @JSONField(name="ys02020101010000000300000000")
    private Double ys02020101010000000300000000;

    /**
     *客船-个体总载重量
    **/
    @JSONField(name="ys02020101010000000301000000")
    private Double ys02020101010000000301000000;

    /**
     *客船-内河总载重量
    **/
    @JSONField(name="ys02020101010000000302000000")
    private Double ys02020101010000000302000000;

    /**
     *客船-内河个体总载重量
    **/
    @JSONField(name="ys02020101010000000302010000")
    private Double ys02020101010000000302010000;

    /**
     *客船-沿海总载重量
    **/
    @JSONField(name="ys02020101010000000303000000")
    private Double ys02020101010000000303000000;

    /**
     *客船-沿海个体总载重量
    **/
    @JSONField(name="ys02020101010000000303010000")
    private Double ys02020101010000000303010000;

    /**
     *客船-远洋总载重量
    **/
    @JSONField(name="ys02020101010000000304000000")
    private Double ys02020101010000000304000000;

    /**
     *客船-净载重量
    **/
    @JSONField(name="ys02020101010000000400000000")
    private Double ys02020101010000000400000000;

    /**
     *客船-个体净载重量
    **/
    @JSONField(name="ys02020101010000000401000000")
    private Double ys02020101010000000401000000;

    /**
     *客船-内河净载重量
    **/
    @JSONField(name="ys02020101010000000402000000")
    private Double ys02020101010000000402000000;

    /**
     *客船-内河个体净载重量
    **/
    @JSONField(name="ys02020101010000000402010000")
    private Double ys02020101010000000402010000;

    /**
     *客船-沿海净载重量
    **/
    @JSONField(name="ys02020101010000000403000000")
    private Double ys02020101010000000403000000;

    /**
     *客船-沿海个体净载重量
    **/
    @JSONField(name="ys02020101010000000403010000")
    private Double ys02020101010000000403010000;

    /**
     *客船-远洋净载重量
    **/
    @JSONField(name="ys02020101010000000404000000")
    private Double ys02020101010000000404000000;

    /**
     *客船-载客量
    **/
    @JSONField(name="ys02020101010000000500000000")
    private Double ys02020101010000000500000000;

    /**
     *客船-个体载客量
    **/
    @JSONField(name="ys02020101010000000501000000")
    private Double ys02020101010000000501000000;

    /**
     *客船-内河载客量
    **/
    @JSONField(name="ys02020101010000000502000000")
    private Double ys02020101010000000502000000;

    /**
     *客船-内河个体载客量
    **/
    @JSONField(name="ys02020101010000000502010000")
    private Double ys02020101010000000502010000;

    /**
     *客船-沿海载客量
    **/
    @JSONField(name="ys02020101010000000503000000")
    private Double ys02020101010000000503000000;

    /**
     *客船-沿海个体载客量
    **/
    @JSONField(name="ys02020101010000000503010000")
    private Double ys02020101010000000503010000;

    /**
     *客船-远洋载客量
    **/
    @JSONField(name="ys02020101010000000504000000")
    private Double ys02020101010000000504000000;

    /**
     *客船-功率
    **/
    @JSONField(name="ys02020101010000000700000000")
    private Double ys02020101010000000700000000;

    /**
     *客船-个体功率
    **/
    @JSONField(name="ys02020101010000000701000000")
    private Double ys02020101010000000701000000;

    /**
     *客船-内河功率
    **/
    @JSONField(name="ys02020101010000000702000000")
    private Double ys02020101010000000702000000;

    /**
     *客船-内河个体功率
    **/
    @JSONField(name="ys02020101010000000702010000")
    private Double ys02020101010000000702010000;

    /**
     *客船-沿海功率
    **/
    @JSONField(name="ys02020101010000000703000000")
    private Double ys02020101010000000703000000;

    /**
     *客船-沿海个体功率
    **/
    @JSONField(name="ys02020101010000000703010000")
    private Double ys02020101010000000703010000;

    /**
     *客船-远洋功率
    **/
    @JSONField(name="ys02020101010000000704000000")
    private Double ys02020101010000000704000000;

    /**
     *客货船-艘数
    **/
    @JSONField(name="ys02020101020000000100000000")
    private Double ys02020101020000000100000000;

    /**
     *客货船-个体艘数
    **/
    @JSONField(name="ys02020101020000000101000000")
    private Double ys02020101020000000101000000;

    /**
     *客货船-内河艘数
    **/
    @JSONField(name="ys02020101020000000102000000")
    private Double ys02020101020000000102000000;

    /**
     *客货船-内河个体艘数
    **/
    @JSONField(name="ys02020101020000000102010000")
    private Double ys02020101020000000102010000;

    /**
     *客货船-沿海艘数
    **/
    @JSONField(name="ys02020101020000000103000000")
    private Double ys02020101020000000103000000;

    /**
     *客货船-沿海个体艘数
    **/
    @JSONField(name="ys02020101020000000103010000")
    private Double ys02020101020000000103010000;

    /**
     *客货船-远洋艘数
    **/
    @JSONField(name="ys02020101020000000104000000")
    private Double ys02020101020000000104000000;

    /**
     *客货船-总吨
    **/
    @JSONField(name="ys02020101020000000200000000")
    private Double ys02020101020000000200000000;

    /**
     *客货船-个体总吨
    **/
    @JSONField(name="ys02020101020000000201000000")
    private Double ys02020101020000000201000000;

    /**
     *客货船-内河总吨
    **/
    @JSONField(name="ys02020101020000000202000000")
    private Double ys02020101020000000202000000;

    /**
     *客货船-内河个体总吨
    **/
    @JSONField(name="ys02020101020000000202010000")
    private Double ys02020101020000000202010000;

    /**
     *客货船-沿海总吨
    **/
    @JSONField(name="ys02020101020000000203000000")
    private Double ys02020101020000000203000000;

    /**
     *客货船-沿海个体总吨
    **/
    @JSONField(name="ys02020101020000000203010000")
    private Double ys02020101020000000203010000;

    /**
     *客货船-远洋总吨
    **/
    @JSONField(name="ys02020101020000000204000000")
    private Double ys02020101020000000204000000;

    /**
     *客货船-总载重量
    **/
    @JSONField(name="ys02020101020000000300000000")
    private Double ys02020101020000000300000000;

    /**
     *客货船-个体总载重量
    **/
    @JSONField(name="ys02020101020000000301000000")
    private Double ys02020101020000000301000000;

    /**
     *客货船-内河总载重量
    **/
    @JSONField(name="ys02020101020000000302000000")
    private Double ys02020101020000000302000000;

    /**
     *客货船-内河个体总载重量
    **/
    @JSONField(name="ys02020101020000000302010000")
    private Double ys02020101020000000302010000;

    /**
     *客货船-沿海总载重量
    **/
    @JSONField(name="ys02020101020000000303000000")
    private Double ys02020101020000000303000000;

    /**
     *客货船-沿海个体总载重量
    **/
    @JSONField(name="ys02020101020000000303010000")
    private Double ys02020101020000000303010000;

    /**
     *客货船-远洋总载重量
    **/
    @JSONField(name="ys02020101020000000304000000")
    private Double ys02020101020000000304000000;

    /**
     *客货船-净载重量
    **/
    @JSONField(name="ys02020101020000000400000000")
    private Double ys02020101020000000400000000;

    /**
     *客货船-个体净载重量
    **/
    @JSONField(name="ys02020101020000000401000000")
    private Double ys02020101020000000401000000;

    /**
     *客货船-内河净载重量
    **/
    @JSONField(name="ys02020101020000000402000000")
    private Double ys02020101020000000402000000;

    /**
     *客货船-内河个体净载重量
    **/
    @JSONField(name="ys02020101020000000402010000")
    private Double ys02020101020000000402010000;

    /**
     *客货船-沿海净载重量
    **/
    @JSONField(name="ys02020101020000000403000000")
    private Double ys02020101020000000403000000;

    /**
     *客货船-沿海个体净载重量
    **/
    @JSONField(name="ys02020101020000000403010000")
    private Double ys02020101020000000403010000;

    /**
     *客货船-远洋净载重量
    **/
    @JSONField(name="ys02020101020000000404000000")
    private Double ys02020101020000000404000000;

    /**
     *客货船-载客量
    **/
    @JSONField(name="ys02020101020000000500000000")
    private Double ys02020101020000000500000000;

    /**
     *客货船-个体载客量
    **/
    @JSONField(name="ys02020101020000000501000000")
    private Double ys02020101020000000501000000;

    /**
     *客货船-内河载客量
    **/
    @JSONField(name="ys02020101020000000502000000")
    private Double ys02020101020000000502000000;

    /**
     *客货船-内河个体载客量
    **/
    @JSONField(name="ys02020101020000000502010000")
    private Double ys02020101020000000502010000;

    /**
     *客货船-沿海载客量
    **/
    @JSONField(name="ys02020101020000000503000000")
    private Double ys02020101020000000503000000;

    /**
     *客货船-沿海个体载客量
    **/
    @JSONField(name="ys02020101020000000503010000")
    private Double ys02020101020000000503010000;

    /**
     *客货船-远洋载客量
    **/
    @JSONField(name="ys02020101020000000504000000")
    private Double ys02020101020000000504000000;

    /**
     *客货船-标准箱位
    **/
    @JSONField(name="ys02020101020000000600000000")
    private Double ys02020101020000000600000000;

    /**
     *客货船-个体标准箱位
    **/
    @JSONField(name="ys02020101020000000601000000")
    private Double ys02020101020000000601000000;

    /**
     *客货船-内河标准箱位
    **/
    @JSONField(name="ys02020101020000000602000000")
    private Double ys02020101020000000602000000;

    /**
     *客货船-内河个体标准箱位
    **/
    @JSONField(name="ys02020101020000000602010000")
    private Double ys02020101020000000602010000;

    /**
     *客货船-沿海标准箱位
    **/
    @JSONField(name="ys02020101020000000603000000")
    private Double ys02020101020000000603000000;

    /**
     *客货船-沿海个体标准箱位
    **/
    @JSONField(name="ys02020101020000000603010000")
    private Double ys02020101020000000603010000;

    /**
     *客货船-远洋标准箱位
    **/
    @JSONField(name="ys02020101020000000604000000")
    private Double ys02020101020000000604000000;

    /**
     *客货船-功率
    **/
    @JSONField(name="ys02020101020000000700000000")
    private Double ys02020101020000000700000000;

    /**
     *客货船-个体功率
    **/
    @JSONField(name="ys02020101020000000701000000")
    private Double ys02020101020000000701000000;

    /**
     *客货船-内河功率
    **/
    @JSONField(name="ys02020101020000000702000000")
    private Double ys02020101020000000702000000;

    /**
     *客货船-内河个体功率
    **/
    @JSONField(name="ys02020101020000000702010000")
    private Double ys02020101020000000702010000;

    /**
     *客货船-沿海功率
    **/
    @JSONField(name="ys02020101020000000703000000")
    private Double ys02020101020000000703000000;

    /**
     *客货船-沿海个体功率
    **/
    @JSONField(name="ys02020101020000000703010000")
    private Double ys02020101020000000703010000;

    /**
     *客货船-远洋功率
    **/
    @JSONField(name="ys02020101020000000704000000")
    private Double ys02020101020000000704000000;

    /**
     *客货船中滚装船-艘数
    **/
    @JSONField(name="ys02020101020100000100000000")
    private Double ys02020101020100000100000000;

    /**
     *客货船中滚装船-个体艘数
    **/
    @JSONField(name="ys02020101020100000101000000")
    private Double ys02020101020100000101000000;

    /**
     *客货船中滚装船-内河艘数
    **/
    @JSONField(name="ys02020101020100000102000000")
    private Double ys02020101020100000102000000;

    /**
     *客货船中滚装船-内河个体艘数
    **/
    @JSONField(name="ys02020101020100000102010000")
    private Double ys02020101020100000102010000;

    /**
     *客货船中滚装船-沿海艘数
    **/
    @JSONField(name="ys02020101020100000103000000")
    private Double ys02020101020100000103000000;

    /**
     *客货船中滚装船-沿海个体艘数
    **/
    @JSONField(name="ys02020101020100000103010000")
    private Double ys02020101020100000103010000;

    /**
     *客货船中滚装船-远洋艘数
    **/
    @JSONField(name="ys02020101020100000104000000")
    private Double ys02020101020100000104000000;

    /**
     *客货船中滚装船-总吨
    **/
    @JSONField(name="ys02020101020100000200000000")
    private Double ys02020101020100000200000000;

    /**
     *客货船中滚装船-个体总吨
    **/
    @JSONField(name="ys02020101020100000201000000")
    private Double ys02020101020100000201000000;

    /**
     *客货船中滚装船-内河总吨
    **/
    @JSONField(name="ys02020101020100000202000000")
    private Double ys02020101020100000202000000;

    /**
     *客货船中滚装船-内河个体总吨
    **/
    @JSONField(name="ys02020101020100000202010000")
    private Double ys02020101020100000202010000;

    /**
     *客货船中滚装船-沿海总吨
    **/
    @JSONField(name="ys02020101020100000203000000")
    private Double ys02020101020100000203000000;

    /**
     *客货船中滚装船-沿海个体总吨
    **/
    @JSONField(name="ys02020101020100000203010000")
    private Double ys02020101020100000203010000;

    /**
     *客货船中滚装船-远洋总吨
    **/
    @JSONField(name="ys02020101020100000204000000")
    private Double ys02020101020100000204000000;

    /**
     *客货船中滚装船-总载重量
    **/
    @JSONField(name="ys02020101020100000300000000")
    private Double ys02020101020100000300000000;

    /**
     *客货船中滚装船-个体总载重量
    **/
    @JSONField(name="ys02020101020100000301000000")
    private Double ys02020101020100000301000000;

    /**
     *客货船中滚装船-内河总载重量
    **/
    @JSONField(name="ys02020101020100000302000000")
    private Double ys02020101020100000302000000;

    /**
     *客货船中滚装船-内河个体总载重量
    **/
    @JSONField(name="ys02020101020100000302010000")
    private Double ys02020101020100000302010000;

    /**
     *客货船中滚装船-沿海总载重量
    **/
    @JSONField(name="ys02020101020100000303000000")
    private Double ys02020101020100000303000000;

    /**
     *客货船中滚装船-沿海个体总载重量
    **/
    @JSONField(name="ys02020101020100000303010000")
    private Double ys02020101020100000303010000;

    /**
     *客货船中滚装船-远洋总载重量
    **/
    @JSONField(name="ys02020101020100000304000000")
    private Double ys02020101020100000304000000;

    /**
     *客货船中滚装船-净载重量
    **/
    @JSONField(name="ys02020101020100000400000000")
    private Double ys02020101020100000400000000;

    /**
     *客货船中滚装船-个体净载重量
    **/
    @JSONField(name="ys02020101020100000401000000")
    private Double ys02020101020100000401000000;

    /**
     *客货船中滚装船-内河净载重量
    **/
    @JSONField(name="ys02020101020100000402000000")
    private Double ys02020101020100000402000000;

    /**
     *客货船中滚装船-内河个体净载重量
    **/
    @JSONField(name="ys02020101020100000402010000")
    private Double ys02020101020100000402010000;

    /**
     *客货船中滚装船-沿海净载重量
    **/
    @JSONField(name="ys02020101020100000403000000")
    private Double ys02020101020100000403000000;

    /**
     *客货船中滚装船-沿海个体净载重量
    **/
    @JSONField(name="ys02020101020100000403010000")
    private Double ys02020101020100000403010000;

    /**
     *客货船中滚装船-远洋净载重量
    **/
    @JSONField(name="ys02020101020100000404000000")
    private Double ys02020101020100000404000000;

    /**
     *客货船中滚装船-载客量
    **/
    @JSONField(name="ys02020101020100000500000000")
    private Double ys02020101020100000500000000;

    /**
     *客货船中滚装船-个体载客量
    **/
    @JSONField(name="ys02020101020100000501000000")
    private Double ys02020101020100000501000000;

    /**
     *客货船中滚装船-内河载客量
    **/
    @JSONField(name="ys02020101020100000502000000")
    private Double ys02020101020100000502000000;

    /**
     *客货船中滚装船-内河个体载客量
    **/
    @JSONField(name="ys02020101020100000502010000")
    private Double ys02020101020100000502010000;

    /**
     *客货船中滚装船-沿海载客量
    **/
    @JSONField(name="ys02020101020100000503000000")
    private Double ys02020101020100000503000000;

    /**
     *客货船中滚装船-沿海个体载客量
    **/
    @JSONField(name="ys02020101020100000503010000")
    private Double ys02020101020100000503010000;

    /**
     *客货船中滚装船-远洋载客量
    **/
    @JSONField(name="ys02020101020100000504000000")
    private Double ys02020101020100000504000000;

    /**
     *客货船中滚装船-标准箱位
    **/
    @JSONField(name="ys02020101020100000600000000")
    private Double ys02020101020100000600000000;

    /**
     *客货船中滚装船-个体标准箱位
    **/
    @JSONField(name="ys02020101020100000601000000")
    private Double ys02020101020100000601000000;

    /**
     *客货船中滚装船-内河标准箱位
    **/
    @JSONField(name="ys02020101020100000602000000")
    private Double ys02020101020100000602000000;

    /**
     *客货船中滚装船-内河个体标准箱位
    **/
    @JSONField(name="ys02020101020100000602010000")
    private Double ys02020101020100000602010000;

    /**
     *客货船中滚装船-沿海标准箱位
    **/
    @JSONField(name="ys02020101020100000603000000")
    private Double ys02020101020100000603000000;

    /**
     *客货船中滚装船-沿海个体标准箱位
    **/
    @JSONField(name="ys02020101020100000603010000")
    private Double ys02020101020100000603010000;

    /**
     *客货船中滚装船-远洋标准箱位
    **/
    @JSONField(name="ys02020101020100000604000000")
    private Double ys02020101020100000604000000;

    /**
     *客货船中滚装船-功率
    **/
    @JSONField(name="ys02020101020100000700000000")
    private Double ys02020101020100000700000000;

    /**
     *客货船中滚装船-个体功率
    **/
    @JSONField(name="ys02020101020100000701000000")
    private Double ys02020101020100000701000000;

    /**
     *客货船中滚装船-内河功率
    **/
    @JSONField(name="ys02020101020100000702000000")
    private Double ys02020101020100000702000000;

    /**
     *客货船中滚装船-内河个体功率
    **/
    @JSONField(name="ys02020101020100000702010000")
    private Double ys02020101020100000702010000;

    /**
     *客货船中滚装船-沿海功率
    **/
    @JSONField(name="ys02020101020100000703000000")
    private Double ys02020101020100000703000000;

    /**
     *客货船中滚装船-沿海个体功率
    **/
    @JSONField(name="ys02020101020100000703010000")
    private Double ys02020101020100000703010000;

    /**
     *客货船中滚装船-远洋功率
    **/
    @JSONField(name="ys02020101020100000704000000")
    private Double ys02020101020100000704000000;

    /**
     *货船-艘数
    **/
    @JSONField(name="ys02020101030000000100000000")
    private Double ys02020101030000000100000000;

    /**
     *货船-个体艘数
    **/
    @JSONField(name="ys02020101030000000101000000")
    private Double ys02020101030000000101000000;

    /**
     *货船-内河艘数
    **/
    @JSONField(name="ys02020101030000000102000000")
    private Double ys02020101030000000102000000;

    /**
     *货船-内河个体艘数
    **/
    @JSONField(name="ys02020101030000000102010000")
    private Double ys02020101030000000102010000;

    /**
     *货船-沿海艘数
    **/
    @JSONField(name="ys02020101030000000103000000")
    private Double ys02020101030000000103000000;

    /**
     *货船-沿海个体艘数
    **/
    @JSONField(name="ys02020101030000000103010000")
    private Double ys02020101030000000103010000;

    /**
     *货船-远洋艘数
    **/
    @JSONField(name="ys02020101030000000104000000")
    private Double ys02020101030000000104000000;

    /**
     *货船-总吨
    **/
    @JSONField(name="ys02020101030000000200000000")
    private Double ys02020101030000000200000000;

    /**
     *货船-个体总吨
    **/
    @JSONField(name="ys02020101030000000201000000")
    private Double ys02020101030000000201000000;

    /**
     *货船-内河总吨
    **/
    @JSONField(name="ys02020101030000000202000000")
    private Double ys02020101030000000202000000;

    /**
     *货船-内河个体总吨
    **/
    @JSONField(name="ys02020101030000000202010000")
    private Double ys02020101030000000202010000;

    /**
     *货船-沿海总吨
    **/
    @JSONField(name="ys02020101030000000203000000")
    private Double ys02020101030000000203000000;

    /**
     *货船-沿海个体总吨
    **/
    @JSONField(name="ys02020101030000000203010000")
    private Double ys02020101030000000203010000;

    /**
     *货船-远洋总吨
    **/
    @JSONField(name="ys02020101030000000204000000")
    private Double ys02020101030000000204000000;

    /**
     *货船-总载重量
    **/
    @JSONField(name="ys02020101030000000300000000")
    private Double ys02020101030000000300000000;

    /**
     *货船-个体总载重量
    **/
    @JSONField(name="ys02020101030000000301000000")
    private Double ys02020101030000000301000000;

    /**
     *货船-内河总载重量
    **/
    @JSONField(name="ys02020101030000000302000000")
    private Double ys02020101030000000302000000;

    /**
     *货船-内河个体总载重量
    **/
    @JSONField(name="ys02020101030000000302010000")
    private Double ys02020101030000000302010000;

    /**
     *货船-沿海总载重量
    **/
    @JSONField(name="ys02020101030000000303000000")
    private Double ys02020101030000000303000000;

    /**
     *货船-沿海个体总载重量
    **/
    @JSONField(name="ys02020101030000000303010000")
    private Double ys02020101030000000303010000;

    /**
     *货船-远洋总载重量
    **/
    @JSONField(name="ys02020101030000000304000000")
    private Double ys02020101030000000304000000;

    /**
     *货船-净载重量
    **/
    @JSONField(name="ys02020101030000000400000000")
    private Double ys02020101030000000400000000;

    /**
     *货船-个体净载重量
    **/
    @JSONField(name="ys02020101030000000401000000")
    private Double ys02020101030000000401000000;

    /**
     *货船-内河净载重量
    **/
    @JSONField(name="ys02020101030000000402000000")
    private Double ys02020101030000000402000000;

    /**
     *货船-内河个体净载重量
    **/
    @JSONField(name="ys02020101030000000402010000")
    private Double ys02020101030000000402010000;

    /**
     *货船-沿海净载重量
    **/
    @JSONField(name="ys02020101030000000403000000")
    private Double ys02020101030000000403000000;

    /**
     *货船-沿海个体净载重量
    **/
    @JSONField(name="ys02020101030000000403010000")
    private Double ys02020101030000000403010000;

    /**
     *货船-远洋净载重量
    **/
    @JSONField(name="ys02020101030000000404000000")
    private Double ys02020101030000000404000000;

    /**
     *货船-标准箱位
    **/
    @JSONField(name="ys02020101030000000600000000")
    private Double ys02020101030000000600000000;

    /**
     *货船-个体标准箱位
    **/
    @JSONField(name="ys02020101030000000601000000")
    private Double ys02020101030000000601000000;

    /**
     *货船-内河标准箱位
    **/
    @JSONField(name="ys02020101030000000602000000")
    private Double ys02020101030000000602000000;

    /**
     *货船-内河个体标准箱位
    **/
    @JSONField(name="ys02020101030000000602010000")
    private Double ys02020101030000000602010000;

    /**
     *货船-沿海标准箱位
    **/
    @JSONField(name="ys02020101030000000603000000")
    private Double ys02020101030000000603000000;

    /**
     *货船-沿海个体标准箱位
    **/
    @JSONField(name="ys02020101030000000603010000")
    private Double ys02020101030000000603010000;

    /**
     *货船-远洋标准箱位
    **/
    @JSONField(name="ys02020101030000000604000000")
    private Double ys02020101030000000604000000;

    /**
     *货船-功率
    **/
    @JSONField(name="ys02020101030000000700000000")
    private Double ys02020101030000000700000000;

    /**
     *货船-个体功率
    **/
    @JSONField(name="ys02020101030000000701000000")
    private Double ys02020101030000000701000000;

    /**
     *货船-内河功率
    **/
    @JSONField(name="ys02020101030000000702000000")
    private Double ys02020101030000000702000000;

    /**
     *货船-内河个体功率
    **/
    @JSONField(name="ys02020101030000000702010000")
    private Double ys02020101030000000702010000;

    /**
     *货船-沿海功率
    **/
    @JSONField(name="ys02020101030000000703000000")
    private Double ys02020101030000000703000000;

    /**
     *货船-沿海个体功率
    **/
    @JSONField(name="ys02020101030000000703010000")
    private Double ys02020101030000000703010000;

    /**
     *货船-远洋功率
    **/
    @JSONField(name="ys02020101030000000704000000")
    private Double ys02020101030000000704000000;

    /**
     *货船中滚装船-艘数
    **/
    @JSONField(name="ys02020101030300000100000000")
    private Double ys02020101030300000100000000;

    /**
     *货船中滚装船-个体艘数
    **/
    @JSONField(name="ys02020101030300000101000000")
    private Double ys02020101030300000101000000;

    /**
     *货船中滚装船-内河艘数
    **/
    @JSONField(name="ys02020101030300000102000000")
    private Double ys02020101030300000102000000;

    /**
     *货船中滚装船-内河个体艘数
    **/
    @JSONField(name="ys02020101030300000102010000")
    private Double ys02020101030300000102010000;

    /**
     *货船中滚装船-沿海艘数
    **/
    @JSONField(name="ys02020101030300000103000000")
    private Double ys02020101030300000103000000;

    /**
     *货船中滚装船-沿海个体艘数
    **/
    @JSONField(name="ys02020101030300000103010000")
    private Double ys02020101030300000103010000;

    /**
     *货船中滚装船-远洋艘数
    **/
    @JSONField(name="ys02020101030300000104000000")
    private Double ys02020101030300000104000000;

    /**
     *货船中滚装船-总吨
    **/
    @JSONField(name="ys02020101030300000200000000")
    private Double ys02020101030300000200000000;

    /**
     *货船中滚装船-个体总吨
    **/
    @JSONField(name="ys02020101030300000201000000")
    private Double ys02020101030300000201000000;

    /**
     *货船中滚装船-内河总吨
    **/
    @JSONField(name="ys02020101030300000202000000")
    private Double ys02020101030300000202000000;

    /**
     *货船中滚装船-内河个体总吨
    **/
    @JSONField(name="ys02020101030300000202010000")
    private Double ys02020101030300000202010000;

    /**
     *货船中滚装船-沿海总吨
    **/
    @JSONField(name="ys02020101030300000203000000")
    private Double ys02020101030300000203000000;

    /**
     *货船中滚装船-沿海个体总吨
    **/
    @JSONField(name="ys02020101030300000203010000")
    private Double ys02020101030300000203010000;

    /**
     *货船中滚装船-远洋总吨
    **/
    @JSONField(name="ys02020101030300000204000000")
    private Double ys02020101030300000204000000;

    /**
     *货船中滚装船-总载重量
    **/
    @JSONField(name="ys02020101030300000300000000")
    private Double ys02020101030300000300000000;

    /**
     *货船中滚装船-个体总载重量
    **/
    @JSONField(name="ys02020101030300000301000000")
    private Double ys02020101030300000301000000;

    public String getRecid() {
        return recid;
    }

    public void setRecid(String recid) {
        this.recid = recid;
    }

    public Double getRecver() {
        return recver;
    }

    public void setRecver(Double recver) {
        this.recver = recver;
    }

    public String getUnitid() {
        return unitid;
    }

    public void setUnitid(String unitid) {
        this.unitid = unitid;
    }

    public String getDatatime() {
        return datatime;
    }

    public void setDatatime(String datatime) {
        this.datatime = datatime;
    }

    public Double getFloatorder() {
        return floatorder;
    }

    public void setFloatorder(Double floatorder) {
        this.floatorder = floatorder;
    }

    public Double getYs02020101000000000100000000() {
        return ys02020101000000000100000000;
    }

    public void setYs02020101000000000100000000(Double ys02020101000000000100000000) {
        this.ys02020101000000000100000000 = ys02020101000000000100000000;
    }

    public Double getYs02020101000000000101000000() {
        return ys02020101000000000101000000;
    }

    public void setYs02020101000000000101000000(Double ys02020101000000000101000000) {
        this.ys02020101000000000101000000 = ys02020101000000000101000000;
    }

    public Double getYs02020101000000000102000000() {
        return ys02020101000000000102000000;
    }

    public void setYs02020101000000000102000000(Double ys02020101000000000102000000) {
        this.ys02020101000000000102000000 = ys02020101000000000102000000;
    }

    public Double getYs02020101000000000102010000() {
        return ys02020101000000000102010000;
    }

    public void setYs02020101000000000102010000(Double ys02020101000000000102010000) {
        this.ys02020101000000000102010000 = ys02020101000000000102010000;
    }

    public Double getYs02020101000000000103000000() {
        return ys02020101000000000103000000;
    }

    public void setYs02020101000000000103000000(Double ys02020101000000000103000000) {
        this.ys02020101000000000103000000 = ys02020101000000000103000000;
    }

    public Double getYs02020101000000000103010000() {
        return ys02020101000000000103010000;
    }

    public void setYs02020101000000000103010000(Double ys02020101000000000103010000) {
        this.ys02020101000000000103010000 = ys02020101000000000103010000;
    }

    public Double getYs02020101000000000104000000() {
        return ys02020101000000000104000000;
    }

    public void setYs02020101000000000104000000(Double ys02020101000000000104000000) {
        this.ys02020101000000000104000000 = ys02020101000000000104000000;
    }

    public Double getYs02020101000000000200000000() {
        return ys02020101000000000200000000;
    }

    public void setYs02020101000000000200000000(Double ys02020101000000000200000000) {
        this.ys02020101000000000200000000 = ys02020101000000000200000000;
    }

    public Double getYs02020101000000000201000000() {
        return ys02020101000000000201000000;
    }

    public void setYs02020101000000000201000000(Double ys02020101000000000201000000) {
        this.ys02020101000000000201000000 = ys02020101000000000201000000;
    }

    public Double getYs02020101000000000202000000() {
        return ys02020101000000000202000000;
    }

    public void setYs02020101000000000202000000(Double ys02020101000000000202000000) {
        this.ys02020101000000000202000000 = ys02020101000000000202000000;
    }

    public Double getYs02020101000000000202010000() {
        return ys02020101000000000202010000;
    }

    public void setYs02020101000000000202010000(Double ys02020101000000000202010000) {
        this.ys02020101000000000202010000 = ys02020101000000000202010000;
    }

    public Double getYs02020101000000000203000000() {
        return ys02020101000000000203000000;
    }

    public void setYs02020101000000000203000000(Double ys02020101000000000203000000) {
        this.ys02020101000000000203000000 = ys02020101000000000203000000;
    }

    public Double getYs02020101000000000203010000() {
        return ys02020101000000000203010000;
    }

    public void setYs02020101000000000203010000(Double ys02020101000000000203010000) {
        this.ys02020101000000000203010000 = ys02020101000000000203010000;
    }

    public Double getYs02020101000000000204000000() {
        return ys02020101000000000204000000;
    }

    public void setYs02020101000000000204000000(Double ys02020101000000000204000000) {
        this.ys02020101000000000204000000 = ys02020101000000000204000000;
    }

    public Double getYs02020101000000000300000000() {
        return ys02020101000000000300000000;
    }

    public void setYs02020101000000000300000000(Double ys02020101000000000300000000) {
        this.ys02020101000000000300000000 = ys02020101000000000300000000;
    }

    public Double getYs02020101000000000301000000() {
        return ys02020101000000000301000000;
    }

    public void setYs02020101000000000301000000(Double ys02020101000000000301000000) {
        this.ys02020101000000000301000000 = ys02020101000000000301000000;
    }

    public Double getYs02020101000000000302000000() {
        return ys02020101000000000302000000;
    }

    public void setYs02020101000000000302000000(Double ys02020101000000000302000000) {
        this.ys02020101000000000302000000 = ys02020101000000000302000000;
    }

    public Double getYs02020101000000000302010000() {
        return ys02020101000000000302010000;
    }

    public void setYs02020101000000000302010000(Double ys02020101000000000302010000) {
        this.ys02020101000000000302010000 = ys02020101000000000302010000;
    }

    public Double getYs02020101000000000303000000() {
        return ys02020101000000000303000000;
    }

    public void setYs02020101000000000303000000(Double ys02020101000000000303000000) {
        this.ys02020101000000000303000000 = ys02020101000000000303000000;
    }

    public Double getYs02020101000000000303010000() {
        return ys02020101000000000303010000;
    }

    public void setYs02020101000000000303010000(Double ys02020101000000000303010000) {
        this.ys02020101000000000303010000 = ys02020101000000000303010000;
    }

    public Double getYs02020101000000000304000000() {
        return ys02020101000000000304000000;
    }

    public void setYs02020101000000000304000000(Double ys02020101000000000304000000) {
        this.ys02020101000000000304000000 = ys02020101000000000304000000;
    }

    public Double getYs02020101000000000400000000() {
        return ys02020101000000000400000000;
    }

    public void setYs02020101000000000400000000(Double ys02020101000000000400000000) {
        this.ys02020101000000000400000000 = ys02020101000000000400000000;
    }

    public Double getYs02020101000000000401000000() {
        return ys02020101000000000401000000;
    }

    public void setYs02020101000000000401000000(Double ys02020101000000000401000000) {
        this.ys02020101000000000401000000 = ys02020101000000000401000000;
    }

    public Double getYs02020101000000000402000000() {
        return ys02020101000000000402000000;
    }

    public void setYs02020101000000000402000000(Double ys02020101000000000402000000) {
        this.ys02020101000000000402000000 = ys02020101000000000402000000;
    }

    public Double getYs02020101000000000402010000() {
        return ys02020101000000000402010000;
    }

    public void setYs02020101000000000402010000(Double ys02020101000000000402010000) {
        this.ys02020101000000000402010000 = ys02020101000000000402010000;
    }

    public Double getYs02020101000000000403000000() {
        return ys02020101000000000403000000;
    }

    public void setYs02020101000000000403000000(Double ys02020101000000000403000000) {
        this.ys02020101000000000403000000 = ys02020101000000000403000000;
    }

    public Double getYs02020101000000000403010000() {
        return ys02020101000000000403010000;
    }

    public void setYs02020101000000000403010000(Double ys02020101000000000403010000) {
        this.ys02020101000000000403010000 = ys02020101000000000403010000;
    }

    public Double getYs02020101000000000404000000() {
        return ys02020101000000000404000000;
    }

    public void setYs02020101000000000404000000(Double ys02020101000000000404000000) {
        this.ys02020101000000000404000000 = ys02020101000000000404000000;
    }

    public Double getYs02020101000000000500000000() {
        return ys02020101000000000500000000;
    }

    public void setYs02020101000000000500000000(Double ys02020101000000000500000000) {
        this.ys02020101000000000500000000 = ys02020101000000000500000000;
    }

    public Double getYs02020101000000000501000000() {
        return ys02020101000000000501000000;
    }

    public void setYs02020101000000000501000000(Double ys02020101000000000501000000) {
        this.ys02020101000000000501000000 = ys02020101000000000501000000;
    }

    public Double getYs02020101000000000502000000() {
        return ys02020101000000000502000000;
    }

    public void setYs02020101000000000502000000(Double ys02020101000000000502000000) {
        this.ys02020101000000000502000000 = ys02020101000000000502000000;
    }

    public Double getYs02020101000000000502010000() {
        return ys02020101000000000502010000;
    }

    public void setYs02020101000000000502010000(Double ys02020101000000000502010000) {
        this.ys02020101000000000502010000 = ys02020101000000000502010000;
    }

    public Double getYs02020101000000000503000000() {
        return ys02020101000000000503000000;
    }

    public void setYs02020101000000000503000000(Double ys02020101000000000503000000) {
        this.ys02020101000000000503000000 = ys02020101000000000503000000;
    }

    public Double getYs02020101000000000503010000() {
        return ys02020101000000000503010000;
    }

    public void setYs02020101000000000503010000(Double ys02020101000000000503010000) {
        this.ys02020101000000000503010000 = ys02020101000000000503010000;
    }

    public Double getYs02020101000000000504000000() {
        return ys02020101000000000504000000;
    }

    public void setYs02020101000000000504000000(Double ys02020101000000000504000000) {
        this.ys02020101000000000504000000 = ys02020101000000000504000000;
    }

    public Double getYs02020101000000000600000000() {
        return ys02020101000000000600000000;
    }

    public void setYs02020101000000000600000000(Double ys02020101000000000600000000) {
        this.ys02020101000000000600000000 = ys02020101000000000600000000;
    }

    public Double getYs02020101000000000601000000() {
        return ys02020101000000000601000000;
    }

    public void setYs02020101000000000601000000(Double ys02020101000000000601000000) {
        this.ys02020101000000000601000000 = ys02020101000000000601000000;
    }

    public Double getYs02020101000000000602000000() {
        return ys02020101000000000602000000;
    }

    public void setYs02020101000000000602000000(Double ys02020101000000000602000000) {
        this.ys02020101000000000602000000 = ys02020101000000000602000000;
    }

    public Double getYs02020101000000000602010000() {
        return ys02020101000000000602010000;
    }

    public void setYs02020101000000000602010000(Double ys02020101000000000602010000) {
        this.ys02020101000000000602010000 = ys02020101000000000602010000;
    }

    public Double getYs02020101000000000603000000() {
        return ys02020101000000000603000000;
    }

    public void setYs02020101000000000603000000(Double ys02020101000000000603000000) {
        this.ys02020101000000000603000000 = ys02020101000000000603000000;
    }

    public Double getYs02020101000000000603010000() {
        return ys02020101000000000603010000;
    }

    public void setYs02020101000000000603010000(Double ys02020101000000000603010000) {
        this.ys02020101000000000603010000 = ys02020101000000000603010000;
    }

    public Double getYs02020101000000000604000000() {
        return ys02020101000000000604000000;
    }

    public void setYs02020101000000000604000000(Double ys02020101000000000604000000) {
        this.ys02020101000000000604000000 = ys02020101000000000604000000;
    }

    public Double getYs02020101000000000700000000() {
        return ys02020101000000000700000000;
    }

    public void setYs02020101000000000700000000(Double ys02020101000000000700000000) {
        this.ys02020101000000000700000000 = ys02020101000000000700000000;
    }

    public Double getYs02020101000000000701000000() {
        return ys02020101000000000701000000;
    }

    public void setYs02020101000000000701000000(Double ys02020101000000000701000000) {
        this.ys02020101000000000701000000 = ys02020101000000000701000000;
    }

    public Double getYs02020101000000000702000000() {
        return ys02020101000000000702000000;
    }

    public void setYs02020101000000000702000000(Double ys02020101000000000702000000) {
        this.ys02020101000000000702000000 = ys02020101000000000702000000;
    }

    public Double getYs02020101000000000702010000() {
        return ys02020101000000000702010000;
    }

    public void setYs02020101000000000702010000(Double ys02020101000000000702010000) {
        this.ys02020101000000000702010000 = ys02020101000000000702010000;
    }

    public Double getYs02020101000000000703000000() {
        return ys02020101000000000703000000;
    }

    public void setYs02020101000000000703000000(Double ys02020101000000000703000000) {
        this.ys02020101000000000703000000 = ys02020101000000000703000000;
    }

    public Double getYs02020101000000000703010000() {
        return ys02020101000000000703010000;
    }

    public void setYs02020101000000000703010000(Double ys02020101000000000703010000) {
        this.ys02020101000000000703010000 = ys02020101000000000703010000;
    }

    public Double getYs02020101000000000704000000() {
        return ys02020101000000000704000000;
    }

    public void setYs02020101000000000704000000(Double ys02020101000000000704000000) {
        this.ys02020101000000000704000000 = ys02020101000000000704000000;
    }

    public Double getYs02020101010000000100000000() {
        return ys02020101010000000100000000;
    }

    public void setYs02020101010000000100000000(Double ys02020101010000000100000000) {
        this.ys02020101010000000100000000 = ys02020101010000000100000000;
    }

    public Double getYs02020101010000000101000000() {
        return ys02020101010000000101000000;
    }

    public void setYs02020101010000000101000000(Double ys02020101010000000101000000) {
        this.ys02020101010000000101000000 = ys02020101010000000101000000;
    }

    public Double getYs02020101010000000102000000() {
        return ys02020101010000000102000000;
    }

    public void setYs02020101010000000102000000(Double ys02020101010000000102000000) {
        this.ys02020101010000000102000000 = ys02020101010000000102000000;
    }

    public Double getYs02020101010000000102010000() {
        return ys02020101010000000102010000;
    }

    public void setYs02020101010000000102010000(Double ys02020101010000000102010000) {
        this.ys02020101010000000102010000 = ys02020101010000000102010000;
    }

    public Double getYs02020101010000000103000000() {
        return ys02020101010000000103000000;
    }

    public void setYs02020101010000000103000000(Double ys02020101010000000103000000) {
        this.ys02020101010000000103000000 = ys02020101010000000103000000;
    }

    public Double getYs02020101010000000103010000() {
        return ys02020101010000000103010000;
    }

    public void setYs02020101010000000103010000(Double ys02020101010000000103010000) {
        this.ys02020101010000000103010000 = ys02020101010000000103010000;
    }

    public Double getYs02020101010000000104000000() {
        return ys02020101010000000104000000;
    }

    public void setYs02020101010000000104000000(Double ys02020101010000000104000000) {
        this.ys02020101010000000104000000 = ys02020101010000000104000000;
    }

    public Double getYs02020101010000000200000000() {
        return ys02020101010000000200000000;
    }

    public void setYs02020101010000000200000000(Double ys02020101010000000200000000) {
        this.ys02020101010000000200000000 = ys02020101010000000200000000;
    }

    public Double getYs02020101010000000201000000() {
        return ys02020101010000000201000000;
    }

    public void setYs02020101010000000201000000(Double ys02020101010000000201000000) {
        this.ys02020101010000000201000000 = ys02020101010000000201000000;
    }

    public Double getYs02020101010000000202000000() {
        return ys02020101010000000202000000;
    }

    public void setYs02020101010000000202000000(Double ys02020101010000000202000000) {
        this.ys02020101010000000202000000 = ys02020101010000000202000000;
    }

    public Double getYs02020101010000000202010000() {
        return ys02020101010000000202010000;
    }

    public void setYs02020101010000000202010000(Double ys02020101010000000202010000) {
        this.ys02020101010000000202010000 = ys02020101010000000202010000;
    }

    public Double getYs02020101010000000203000000() {
        return ys02020101010000000203000000;
    }

    public void setYs02020101010000000203000000(Double ys02020101010000000203000000) {
        this.ys02020101010000000203000000 = ys02020101010000000203000000;
    }

    public Double getYs02020101010000000203010000() {
        return ys02020101010000000203010000;
    }

    public void setYs02020101010000000203010000(Double ys02020101010000000203010000) {
        this.ys02020101010000000203010000 = ys02020101010000000203010000;
    }

    public Double getYs02020101010000000204000000() {
        return ys02020101010000000204000000;
    }

    public void setYs02020101010000000204000000(Double ys02020101010000000204000000) {
        this.ys02020101010000000204000000 = ys02020101010000000204000000;
    }

    public Double getYs02020101010000000300000000() {
        return ys02020101010000000300000000;
    }

    public void setYs02020101010000000300000000(Double ys02020101010000000300000000) {
        this.ys02020101010000000300000000 = ys02020101010000000300000000;
    }

    public Double getYs02020101010000000301000000() {
        return ys02020101010000000301000000;
    }

    public void setYs02020101010000000301000000(Double ys02020101010000000301000000) {
        this.ys02020101010000000301000000 = ys02020101010000000301000000;
    }

    public Double getYs02020101010000000302000000() {
        return ys02020101010000000302000000;
    }

    public void setYs02020101010000000302000000(Double ys02020101010000000302000000) {
        this.ys02020101010000000302000000 = ys02020101010000000302000000;
    }

    public Double getYs02020101010000000302010000() {
        return ys02020101010000000302010000;
    }

    public void setYs02020101010000000302010000(Double ys02020101010000000302010000) {
        this.ys02020101010000000302010000 = ys02020101010000000302010000;
    }

    public Double getYs02020101010000000303000000() {
        return ys02020101010000000303000000;
    }

    public void setYs02020101010000000303000000(Double ys02020101010000000303000000) {
        this.ys02020101010000000303000000 = ys02020101010000000303000000;
    }

    public Double getYs02020101010000000303010000() {
        return ys02020101010000000303010000;
    }

    public void setYs02020101010000000303010000(Double ys02020101010000000303010000) {
        this.ys02020101010000000303010000 = ys02020101010000000303010000;
    }

    public Double getYs02020101010000000304000000() {
        return ys02020101010000000304000000;
    }

    public void setYs02020101010000000304000000(Double ys02020101010000000304000000) {
        this.ys02020101010000000304000000 = ys02020101010000000304000000;
    }

    public Double getYs02020101010000000400000000() {
        return ys02020101010000000400000000;
    }

    public void setYs02020101010000000400000000(Double ys02020101010000000400000000) {
        this.ys02020101010000000400000000 = ys02020101010000000400000000;
    }

    public Double getYs02020101010000000401000000() {
        return ys02020101010000000401000000;
    }

    public void setYs02020101010000000401000000(Double ys02020101010000000401000000) {
        this.ys02020101010000000401000000 = ys02020101010000000401000000;
    }

    public Double getYs02020101010000000402000000() {
        return ys02020101010000000402000000;
    }

    public void setYs02020101010000000402000000(Double ys02020101010000000402000000) {
        this.ys02020101010000000402000000 = ys02020101010000000402000000;
    }

    public Double getYs02020101010000000402010000() {
        return ys02020101010000000402010000;
    }

    public void setYs02020101010000000402010000(Double ys02020101010000000402010000) {
        this.ys02020101010000000402010000 = ys02020101010000000402010000;
    }

    public Double getYs02020101010000000403000000() {
        return ys02020101010000000403000000;
    }

    public void setYs02020101010000000403000000(Double ys02020101010000000403000000) {
        this.ys02020101010000000403000000 = ys02020101010000000403000000;
    }

    public Double getYs02020101010000000403010000() {
        return ys02020101010000000403010000;
    }

    public void setYs02020101010000000403010000(Double ys02020101010000000403010000) {
        this.ys02020101010000000403010000 = ys02020101010000000403010000;
    }

    public Double getYs02020101010000000404000000() {
        return ys02020101010000000404000000;
    }

    public void setYs02020101010000000404000000(Double ys02020101010000000404000000) {
        this.ys02020101010000000404000000 = ys02020101010000000404000000;
    }

    public Double getYs02020101010000000500000000() {
        return ys02020101010000000500000000;
    }

    public void setYs02020101010000000500000000(Double ys02020101010000000500000000) {
        this.ys02020101010000000500000000 = ys02020101010000000500000000;
    }

    public Double getYs02020101010000000501000000() {
        return ys02020101010000000501000000;
    }

    public void setYs02020101010000000501000000(Double ys02020101010000000501000000) {
        this.ys02020101010000000501000000 = ys02020101010000000501000000;
    }

    public Double getYs02020101010000000502000000() {
        return ys02020101010000000502000000;
    }

    public void setYs02020101010000000502000000(Double ys02020101010000000502000000) {
        this.ys02020101010000000502000000 = ys02020101010000000502000000;
    }

    public Double getYs02020101010000000502010000() {
        return ys02020101010000000502010000;
    }

    public void setYs02020101010000000502010000(Double ys02020101010000000502010000) {
        this.ys02020101010000000502010000 = ys02020101010000000502010000;
    }

    public Double getYs02020101010000000503000000() {
        return ys02020101010000000503000000;
    }

    public void setYs02020101010000000503000000(Double ys02020101010000000503000000) {
        this.ys02020101010000000503000000 = ys02020101010000000503000000;
    }

    public Double getYs02020101010000000503010000() {
        return ys02020101010000000503010000;
    }

    public void setYs02020101010000000503010000(Double ys02020101010000000503010000) {
        this.ys02020101010000000503010000 = ys02020101010000000503010000;
    }

    public Double getYs02020101010000000504000000() {
        return ys02020101010000000504000000;
    }

    public void setYs02020101010000000504000000(Double ys02020101010000000504000000) {
        this.ys02020101010000000504000000 = ys02020101010000000504000000;
    }

    public Double getYs02020101010000000700000000() {
        return ys02020101010000000700000000;
    }

    public void setYs02020101010000000700000000(Double ys02020101010000000700000000) {
        this.ys02020101010000000700000000 = ys02020101010000000700000000;
    }

    public Double getYs02020101010000000701000000() {
        return ys02020101010000000701000000;
    }

    public void setYs02020101010000000701000000(Double ys02020101010000000701000000) {
        this.ys02020101010000000701000000 = ys02020101010000000701000000;
    }

    public Double getYs02020101010000000702000000() {
        return ys02020101010000000702000000;
    }

    public void setYs02020101010000000702000000(Double ys02020101010000000702000000) {
        this.ys02020101010000000702000000 = ys02020101010000000702000000;
    }

    public Double getYs02020101010000000702010000() {
        return ys02020101010000000702010000;
    }

    public void setYs02020101010000000702010000(Double ys02020101010000000702010000) {
        this.ys02020101010000000702010000 = ys02020101010000000702010000;
    }

    public Double getYs02020101010000000703000000() {
        return ys02020101010000000703000000;
    }

    public void setYs02020101010000000703000000(Double ys02020101010000000703000000) {
        this.ys02020101010000000703000000 = ys02020101010000000703000000;
    }

    public Double getYs02020101010000000703010000() {
        return ys02020101010000000703010000;
    }

    public void setYs02020101010000000703010000(Double ys02020101010000000703010000) {
        this.ys02020101010000000703010000 = ys02020101010000000703010000;
    }

    public Double getYs02020101010000000704000000() {
        return ys02020101010000000704000000;
    }

    public void setYs02020101010000000704000000(Double ys02020101010000000704000000) {
        this.ys02020101010000000704000000 = ys02020101010000000704000000;
    }

    public Double getYs02020101020000000100000000() {
        return ys02020101020000000100000000;
    }

    public void setYs02020101020000000100000000(Double ys02020101020000000100000000) {
        this.ys02020101020000000100000000 = ys02020101020000000100000000;
    }

    public Double getYs02020101020000000101000000() {
        return ys02020101020000000101000000;
    }

    public void setYs02020101020000000101000000(Double ys02020101020000000101000000) {
        this.ys02020101020000000101000000 = ys02020101020000000101000000;
    }

    public Double getYs02020101020000000102000000() {
        return ys02020101020000000102000000;
    }

    public void setYs02020101020000000102000000(Double ys02020101020000000102000000) {
        this.ys02020101020000000102000000 = ys02020101020000000102000000;
    }

    public Double getYs02020101020000000102010000() {
        return ys02020101020000000102010000;
    }

    public void setYs02020101020000000102010000(Double ys02020101020000000102010000) {
        this.ys02020101020000000102010000 = ys02020101020000000102010000;
    }

    public Double getYs02020101020000000103000000() {
        return ys02020101020000000103000000;
    }

    public void setYs02020101020000000103000000(Double ys02020101020000000103000000) {
        this.ys02020101020000000103000000 = ys02020101020000000103000000;
    }

    public Double getYs02020101020000000103010000() {
        return ys02020101020000000103010000;
    }

    public void setYs02020101020000000103010000(Double ys02020101020000000103010000) {
        this.ys02020101020000000103010000 = ys02020101020000000103010000;
    }

    public Double getYs02020101020000000104000000() {
        return ys02020101020000000104000000;
    }

    public void setYs02020101020000000104000000(Double ys02020101020000000104000000) {
        this.ys02020101020000000104000000 = ys02020101020000000104000000;
    }

    public Double getYs02020101020000000200000000() {
        return ys02020101020000000200000000;
    }

    public void setYs02020101020000000200000000(Double ys02020101020000000200000000) {
        this.ys02020101020000000200000000 = ys02020101020000000200000000;
    }

    public Double getYs02020101020000000201000000() {
        return ys02020101020000000201000000;
    }

    public void setYs02020101020000000201000000(Double ys02020101020000000201000000) {
        this.ys02020101020000000201000000 = ys02020101020000000201000000;
    }

    public Double getYs02020101020000000202000000() {
        return ys02020101020000000202000000;
    }

    public void setYs02020101020000000202000000(Double ys02020101020000000202000000) {
        this.ys02020101020000000202000000 = ys02020101020000000202000000;
    }

    public Double getYs02020101020000000202010000() {
        return ys02020101020000000202010000;
    }

    public void setYs02020101020000000202010000(Double ys02020101020000000202010000) {
        this.ys02020101020000000202010000 = ys02020101020000000202010000;
    }

    public Double getYs02020101020000000203000000() {
        return ys02020101020000000203000000;
    }

    public void setYs02020101020000000203000000(Double ys02020101020000000203000000) {
        this.ys02020101020000000203000000 = ys02020101020000000203000000;
    }

    public Double getYs02020101020000000203010000() {
        return ys02020101020000000203010000;
    }

    public void setYs02020101020000000203010000(Double ys02020101020000000203010000) {
        this.ys02020101020000000203010000 = ys02020101020000000203010000;
    }

    public Double getYs02020101020000000204000000() {
        return ys02020101020000000204000000;
    }

    public void setYs02020101020000000204000000(Double ys02020101020000000204000000) {
        this.ys02020101020000000204000000 = ys02020101020000000204000000;
    }

    public Double getYs02020101020000000300000000() {
        return ys02020101020000000300000000;
    }

    public void setYs02020101020000000300000000(Double ys02020101020000000300000000) {
        this.ys02020101020000000300000000 = ys02020101020000000300000000;
    }

    public Double getYs02020101020000000301000000() {
        return ys02020101020000000301000000;
    }

    public void setYs02020101020000000301000000(Double ys02020101020000000301000000) {
        this.ys02020101020000000301000000 = ys02020101020000000301000000;
    }

    public Double getYs02020101020000000302000000() {
        return ys02020101020000000302000000;
    }

    public void setYs02020101020000000302000000(Double ys02020101020000000302000000) {
        this.ys02020101020000000302000000 = ys02020101020000000302000000;
    }

    public Double getYs02020101020000000302010000() {
        return ys02020101020000000302010000;
    }

    public void setYs02020101020000000302010000(Double ys02020101020000000302010000) {
        this.ys02020101020000000302010000 = ys02020101020000000302010000;
    }

    public Double getYs02020101020000000303000000() {
        return ys02020101020000000303000000;
    }

    public void setYs02020101020000000303000000(Double ys02020101020000000303000000) {
        this.ys02020101020000000303000000 = ys02020101020000000303000000;
    }

    public Double getYs02020101020000000303010000() {
        return ys02020101020000000303010000;
    }

    public void setYs02020101020000000303010000(Double ys02020101020000000303010000) {
        this.ys02020101020000000303010000 = ys02020101020000000303010000;
    }

    public Double getYs02020101020000000304000000() {
        return ys02020101020000000304000000;
    }

    public void setYs02020101020000000304000000(Double ys02020101020000000304000000) {
        this.ys02020101020000000304000000 = ys02020101020000000304000000;
    }

    public Double getYs02020101020000000400000000() {
        return ys02020101020000000400000000;
    }

    public void setYs02020101020000000400000000(Double ys02020101020000000400000000) {
        this.ys02020101020000000400000000 = ys02020101020000000400000000;
    }

    public Double getYs02020101020000000401000000() {
        return ys02020101020000000401000000;
    }

    public void setYs02020101020000000401000000(Double ys02020101020000000401000000) {
        this.ys02020101020000000401000000 = ys02020101020000000401000000;
    }

    public Double getYs02020101020000000402000000() {
        return ys02020101020000000402000000;
    }

    public void setYs02020101020000000402000000(Double ys02020101020000000402000000) {
        this.ys02020101020000000402000000 = ys02020101020000000402000000;
    }

    public Double getYs02020101020000000402010000() {
        return ys02020101020000000402010000;
    }

    public void setYs02020101020000000402010000(Double ys02020101020000000402010000) {
        this.ys02020101020000000402010000 = ys02020101020000000402010000;
    }

    public Double getYs02020101020000000403000000() {
        return ys02020101020000000403000000;
    }

    public void setYs02020101020000000403000000(Double ys02020101020000000403000000) {
        this.ys02020101020000000403000000 = ys02020101020000000403000000;
    }

    public Double getYs02020101020000000403010000() {
        return ys02020101020000000403010000;
    }

    public void setYs02020101020000000403010000(Double ys02020101020000000403010000) {
        this.ys02020101020000000403010000 = ys02020101020000000403010000;
    }

    public Double getYs02020101020000000404000000() {
        return ys02020101020000000404000000;
    }

    public void setYs02020101020000000404000000(Double ys02020101020000000404000000) {
        this.ys02020101020000000404000000 = ys02020101020000000404000000;
    }

    public Double getYs02020101020000000500000000() {
        return ys02020101020000000500000000;
    }

    public void setYs02020101020000000500000000(Double ys02020101020000000500000000) {
        this.ys02020101020000000500000000 = ys02020101020000000500000000;
    }

    public Double getYs02020101020000000501000000() {
        return ys02020101020000000501000000;
    }

    public void setYs02020101020000000501000000(Double ys02020101020000000501000000) {
        this.ys02020101020000000501000000 = ys02020101020000000501000000;
    }

    public Double getYs02020101020000000502000000() {
        return ys02020101020000000502000000;
    }

    public void setYs02020101020000000502000000(Double ys02020101020000000502000000) {
        this.ys02020101020000000502000000 = ys02020101020000000502000000;
    }

    public Double getYs02020101020000000502010000() {
        return ys02020101020000000502010000;
    }

    public void setYs02020101020000000502010000(Double ys02020101020000000502010000) {
        this.ys02020101020000000502010000 = ys02020101020000000502010000;
    }

    public Double getYs02020101020000000503000000() {
        return ys02020101020000000503000000;
    }

    public void setYs02020101020000000503000000(Double ys02020101020000000503000000) {
        this.ys02020101020000000503000000 = ys02020101020000000503000000;
    }

    public Double getYs02020101020000000503010000() {
        return ys02020101020000000503010000;
    }

    public void setYs02020101020000000503010000(Double ys02020101020000000503010000) {
        this.ys02020101020000000503010000 = ys02020101020000000503010000;
    }

    public Double getYs02020101020000000504000000() {
        return ys02020101020000000504000000;
    }

    public void setYs02020101020000000504000000(Double ys02020101020000000504000000) {
        this.ys02020101020000000504000000 = ys02020101020000000504000000;
    }

    public Double getYs02020101020000000600000000() {
        return ys02020101020000000600000000;
    }

    public void setYs02020101020000000600000000(Double ys02020101020000000600000000) {
        this.ys02020101020000000600000000 = ys02020101020000000600000000;
    }

    public Double getYs02020101020000000601000000() {
        return ys02020101020000000601000000;
    }

    public void setYs02020101020000000601000000(Double ys02020101020000000601000000) {
        this.ys02020101020000000601000000 = ys02020101020000000601000000;
    }

    public Double getYs02020101020000000602000000() {
        return ys02020101020000000602000000;
    }

    public void setYs02020101020000000602000000(Double ys02020101020000000602000000) {
        this.ys02020101020000000602000000 = ys02020101020000000602000000;
    }

    public Double getYs02020101020000000602010000() {
        return ys02020101020000000602010000;
    }

    public void setYs02020101020000000602010000(Double ys02020101020000000602010000) {
        this.ys02020101020000000602010000 = ys02020101020000000602010000;
    }

    public Double getYs02020101020000000603000000() {
        return ys02020101020000000603000000;
    }

    public void setYs02020101020000000603000000(Double ys02020101020000000603000000) {
        this.ys02020101020000000603000000 = ys02020101020000000603000000;
    }

    public Double getYs02020101020000000603010000() {
        return ys02020101020000000603010000;
    }

    public void setYs02020101020000000603010000(Double ys02020101020000000603010000) {
        this.ys02020101020000000603010000 = ys02020101020000000603010000;
    }

    public Double getYs02020101020000000604000000() {
        return ys02020101020000000604000000;
    }

    public void setYs02020101020000000604000000(Double ys02020101020000000604000000) {
        this.ys02020101020000000604000000 = ys02020101020000000604000000;
    }

    public Double getYs02020101020000000700000000() {
        return ys02020101020000000700000000;
    }

    public void setYs02020101020000000700000000(Double ys02020101020000000700000000) {
        this.ys02020101020000000700000000 = ys02020101020000000700000000;
    }

    public Double getYs02020101020000000701000000() {
        return ys02020101020000000701000000;
    }

    public void setYs02020101020000000701000000(Double ys02020101020000000701000000) {
        this.ys02020101020000000701000000 = ys02020101020000000701000000;
    }

    public Double getYs02020101020000000702000000() {
        return ys02020101020000000702000000;
    }

    public void setYs02020101020000000702000000(Double ys02020101020000000702000000) {
        this.ys02020101020000000702000000 = ys02020101020000000702000000;
    }

    public Double getYs02020101020000000702010000() {
        return ys02020101020000000702010000;
    }

    public void setYs02020101020000000702010000(Double ys02020101020000000702010000) {
        this.ys02020101020000000702010000 = ys02020101020000000702010000;
    }

    public Double getYs02020101020000000703000000() {
        return ys02020101020000000703000000;
    }

    public void setYs02020101020000000703000000(Double ys02020101020000000703000000) {
        this.ys02020101020000000703000000 = ys02020101020000000703000000;
    }

    public Double getYs02020101020000000703010000() {
        return ys02020101020000000703010000;
    }

    public void setYs02020101020000000703010000(Double ys02020101020000000703010000) {
        this.ys02020101020000000703010000 = ys02020101020000000703010000;
    }

    public Double getYs02020101020000000704000000() {
        return ys02020101020000000704000000;
    }

    public void setYs02020101020000000704000000(Double ys02020101020000000704000000) {
        this.ys02020101020000000704000000 = ys02020101020000000704000000;
    }

    public Double getYs02020101020100000100000000() {
        return ys02020101020100000100000000;
    }

    public void setYs02020101020100000100000000(Double ys02020101020100000100000000) {
        this.ys02020101020100000100000000 = ys02020101020100000100000000;
    }

    public Double getYs02020101020100000101000000() {
        return ys02020101020100000101000000;
    }

    public void setYs02020101020100000101000000(Double ys02020101020100000101000000) {
        this.ys02020101020100000101000000 = ys02020101020100000101000000;
    }

    public Double getYs02020101020100000102000000() {
        return ys02020101020100000102000000;
    }

    public void setYs02020101020100000102000000(Double ys02020101020100000102000000) {
        this.ys02020101020100000102000000 = ys02020101020100000102000000;
    }

    public Double getYs02020101020100000102010000() {
        return ys02020101020100000102010000;
    }

    public void setYs02020101020100000102010000(Double ys02020101020100000102010000) {
        this.ys02020101020100000102010000 = ys02020101020100000102010000;
    }

    public Double getYs02020101020100000103000000() {
        return ys02020101020100000103000000;
    }

    public void setYs02020101020100000103000000(Double ys02020101020100000103000000) {
        this.ys02020101020100000103000000 = ys02020101020100000103000000;
    }

    public Double getYs02020101020100000103010000() {
        return ys02020101020100000103010000;
    }

    public void setYs02020101020100000103010000(Double ys02020101020100000103010000) {
        this.ys02020101020100000103010000 = ys02020101020100000103010000;
    }

    public Double getYs02020101020100000104000000() {
        return ys02020101020100000104000000;
    }

    public void setYs02020101020100000104000000(Double ys02020101020100000104000000) {
        this.ys02020101020100000104000000 = ys02020101020100000104000000;
    }

    public Double getYs02020101020100000200000000() {
        return ys02020101020100000200000000;
    }

    public void setYs02020101020100000200000000(Double ys02020101020100000200000000) {
        this.ys02020101020100000200000000 = ys02020101020100000200000000;
    }

    public Double getYs02020101020100000201000000() {
        return ys02020101020100000201000000;
    }

    public void setYs02020101020100000201000000(Double ys02020101020100000201000000) {
        this.ys02020101020100000201000000 = ys02020101020100000201000000;
    }

    public Double getYs02020101020100000202000000() {
        return ys02020101020100000202000000;
    }

    public void setYs02020101020100000202000000(Double ys02020101020100000202000000) {
        this.ys02020101020100000202000000 = ys02020101020100000202000000;
    }

    public Double getYs02020101020100000202010000() {
        return ys02020101020100000202010000;
    }

    public void setYs02020101020100000202010000(Double ys02020101020100000202010000) {
        this.ys02020101020100000202010000 = ys02020101020100000202010000;
    }

    public Double getYs02020101020100000203000000() {
        return ys02020101020100000203000000;
    }

    public void setYs02020101020100000203000000(Double ys02020101020100000203000000) {
        this.ys02020101020100000203000000 = ys02020101020100000203000000;
    }

    public Double getYs02020101020100000203010000() {
        return ys02020101020100000203010000;
    }

    public void setYs02020101020100000203010000(Double ys02020101020100000203010000) {
        this.ys02020101020100000203010000 = ys02020101020100000203010000;
    }

    public Double getYs02020101020100000204000000() {
        return ys02020101020100000204000000;
    }

    public void setYs02020101020100000204000000(Double ys02020101020100000204000000) {
        this.ys02020101020100000204000000 = ys02020101020100000204000000;
    }

    public Double getYs02020101020100000300000000() {
        return ys02020101020100000300000000;
    }

    public void setYs02020101020100000300000000(Double ys02020101020100000300000000) {
        this.ys02020101020100000300000000 = ys02020101020100000300000000;
    }

    public Double getYs02020101020100000301000000() {
        return ys02020101020100000301000000;
    }

    public void setYs02020101020100000301000000(Double ys02020101020100000301000000) {
        this.ys02020101020100000301000000 = ys02020101020100000301000000;
    }

    public Double getYs02020101020100000302000000() {
        return ys02020101020100000302000000;
    }

    public void setYs02020101020100000302000000(Double ys02020101020100000302000000) {
        this.ys02020101020100000302000000 = ys02020101020100000302000000;
    }

    public Double getYs02020101020100000302010000() {
        return ys02020101020100000302010000;
    }

    public void setYs02020101020100000302010000(Double ys02020101020100000302010000) {
        this.ys02020101020100000302010000 = ys02020101020100000302010000;
    }

    public Double getYs02020101020100000303000000() {
        return ys02020101020100000303000000;
    }

    public void setYs02020101020100000303000000(Double ys02020101020100000303000000) {
        this.ys02020101020100000303000000 = ys02020101020100000303000000;
    }

    public Double getYs02020101020100000303010000() {
        return ys02020101020100000303010000;
    }

    public void setYs02020101020100000303010000(Double ys02020101020100000303010000) {
        this.ys02020101020100000303010000 = ys02020101020100000303010000;
    }

    public Double getYs02020101020100000304000000() {
        return ys02020101020100000304000000;
    }

    public void setYs02020101020100000304000000(Double ys02020101020100000304000000) {
        this.ys02020101020100000304000000 = ys02020101020100000304000000;
    }

    public Double getYs02020101020100000400000000() {
        return ys02020101020100000400000000;
    }

    public void setYs02020101020100000400000000(Double ys02020101020100000400000000) {
        this.ys02020101020100000400000000 = ys02020101020100000400000000;
    }

    public Double getYs02020101020100000401000000() {
        return ys02020101020100000401000000;
    }

    public void setYs02020101020100000401000000(Double ys02020101020100000401000000) {
        this.ys02020101020100000401000000 = ys02020101020100000401000000;
    }

    public Double getYs02020101020100000402000000() {
        return ys02020101020100000402000000;
    }

    public void setYs02020101020100000402000000(Double ys02020101020100000402000000) {
        this.ys02020101020100000402000000 = ys02020101020100000402000000;
    }

    public Double getYs02020101020100000402010000() {
        return ys02020101020100000402010000;
    }

    public void setYs02020101020100000402010000(Double ys02020101020100000402010000) {
        this.ys02020101020100000402010000 = ys02020101020100000402010000;
    }

    public Double getYs02020101020100000403000000() {
        return ys02020101020100000403000000;
    }

    public void setYs02020101020100000403000000(Double ys02020101020100000403000000) {
        this.ys02020101020100000403000000 = ys02020101020100000403000000;
    }

    public Double getYs02020101020100000403010000() {
        return ys02020101020100000403010000;
    }

    public void setYs02020101020100000403010000(Double ys02020101020100000403010000) {
        this.ys02020101020100000403010000 = ys02020101020100000403010000;
    }

    public Double getYs02020101020100000404000000() {
        return ys02020101020100000404000000;
    }

    public void setYs02020101020100000404000000(Double ys02020101020100000404000000) {
        this.ys02020101020100000404000000 = ys02020101020100000404000000;
    }

    public Double getYs02020101020100000500000000() {
        return ys02020101020100000500000000;
    }

    public void setYs02020101020100000500000000(Double ys02020101020100000500000000) {
        this.ys02020101020100000500000000 = ys02020101020100000500000000;
    }

    public Double getYs02020101020100000501000000() {
        return ys02020101020100000501000000;
    }

    public void setYs02020101020100000501000000(Double ys02020101020100000501000000) {
        this.ys02020101020100000501000000 = ys02020101020100000501000000;
    }

    public Double getYs02020101020100000502000000() {
        return ys02020101020100000502000000;
    }

    public void setYs02020101020100000502000000(Double ys02020101020100000502000000) {
        this.ys02020101020100000502000000 = ys02020101020100000502000000;
    }

    public Double getYs02020101020100000502010000() {
        return ys02020101020100000502010000;
    }

    public void setYs02020101020100000502010000(Double ys02020101020100000502010000) {
        this.ys02020101020100000502010000 = ys02020101020100000502010000;
    }

    public Double getYs02020101020100000503000000() {
        return ys02020101020100000503000000;
    }

    public void setYs02020101020100000503000000(Double ys02020101020100000503000000) {
        this.ys02020101020100000503000000 = ys02020101020100000503000000;
    }

    public Double getYs02020101020100000503010000() {
        return ys02020101020100000503010000;
    }

    public void setYs02020101020100000503010000(Double ys02020101020100000503010000) {
        this.ys02020101020100000503010000 = ys02020101020100000503010000;
    }

    public Double getYs02020101020100000504000000() {
        return ys02020101020100000504000000;
    }

    public void setYs02020101020100000504000000(Double ys02020101020100000504000000) {
        this.ys02020101020100000504000000 = ys02020101020100000504000000;
    }

    public Double getYs02020101020100000600000000() {
        return ys02020101020100000600000000;
    }

    public void setYs02020101020100000600000000(Double ys02020101020100000600000000) {
        this.ys02020101020100000600000000 = ys02020101020100000600000000;
    }

    public Double getYs02020101020100000601000000() {
        return ys02020101020100000601000000;
    }

    public void setYs02020101020100000601000000(Double ys02020101020100000601000000) {
        this.ys02020101020100000601000000 = ys02020101020100000601000000;
    }

    public Double getYs02020101020100000602000000() {
        return ys02020101020100000602000000;
    }

    public void setYs02020101020100000602000000(Double ys02020101020100000602000000) {
        this.ys02020101020100000602000000 = ys02020101020100000602000000;
    }

    public Double getYs02020101020100000602010000() {
        return ys02020101020100000602010000;
    }

    public void setYs02020101020100000602010000(Double ys02020101020100000602010000) {
        this.ys02020101020100000602010000 = ys02020101020100000602010000;
    }

    public Double getYs02020101020100000603000000() {
        return ys02020101020100000603000000;
    }

    public void setYs02020101020100000603000000(Double ys02020101020100000603000000) {
        this.ys02020101020100000603000000 = ys02020101020100000603000000;
    }

    public Double getYs02020101020100000603010000() {
        return ys02020101020100000603010000;
    }

    public void setYs02020101020100000603010000(Double ys02020101020100000603010000) {
        this.ys02020101020100000603010000 = ys02020101020100000603010000;
    }

    public Double getYs02020101020100000604000000() {
        return ys02020101020100000604000000;
    }

    public void setYs02020101020100000604000000(Double ys02020101020100000604000000) {
        this.ys02020101020100000604000000 = ys02020101020100000604000000;
    }

    public Double getYs02020101020100000700000000() {
        return ys02020101020100000700000000;
    }

    public void setYs02020101020100000700000000(Double ys02020101020100000700000000) {
        this.ys02020101020100000700000000 = ys02020101020100000700000000;
    }

    public Double getYs02020101020100000701000000() {
        return ys02020101020100000701000000;
    }

    public void setYs02020101020100000701000000(Double ys02020101020100000701000000) {
        this.ys02020101020100000701000000 = ys02020101020100000701000000;
    }

    public Double getYs02020101020100000702000000() {
        return ys02020101020100000702000000;
    }

    public void setYs02020101020100000702000000(Double ys02020101020100000702000000) {
        this.ys02020101020100000702000000 = ys02020101020100000702000000;
    }

    public Double getYs02020101020100000702010000() {
        return ys02020101020100000702010000;
    }

    public void setYs02020101020100000702010000(Double ys02020101020100000702010000) {
        this.ys02020101020100000702010000 = ys02020101020100000702010000;
    }

    public Double getYs02020101020100000703000000() {
        return ys02020101020100000703000000;
    }

    public void setYs02020101020100000703000000(Double ys02020101020100000703000000) {
        this.ys02020101020100000703000000 = ys02020101020100000703000000;
    }

    public Double getYs02020101020100000703010000() {
        return ys02020101020100000703010000;
    }

    public void setYs02020101020100000703010000(Double ys02020101020100000703010000) {
        this.ys02020101020100000703010000 = ys02020101020100000703010000;
    }

    public Double getYs02020101020100000704000000() {
        return ys02020101020100000704000000;
    }

    public void setYs02020101020100000704000000(Double ys02020101020100000704000000) {
        this.ys02020101020100000704000000 = ys02020101020100000704000000;
    }

    public Double getYs02020101030000000100000000() {
        return ys02020101030000000100000000;
    }

    public void setYs02020101030000000100000000(Double ys02020101030000000100000000) {
        this.ys02020101030000000100000000 = ys02020101030000000100000000;
    }

    public Double getYs02020101030000000101000000() {
        return ys02020101030000000101000000;
    }

    public void setYs02020101030000000101000000(Double ys02020101030000000101000000) {
        this.ys02020101030000000101000000 = ys02020101030000000101000000;
    }

    public Double getYs02020101030000000102000000() {
        return ys02020101030000000102000000;
    }

    public void setYs02020101030000000102000000(Double ys02020101030000000102000000) {
        this.ys02020101030000000102000000 = ys02020101030000000102000000;
    }

    public Double getYs02020101030000000102010000() {
        return ys02020101030000000102010000;
    }

    public void setYs02020101030000000102010000(Double ys02020101030000000102010000) {
        this.ys02020101030000000102010000 = ys02020101030000000102010000;
    }

    public Double getYs02020101030000000103000000() {
        return ys02020101030000000103000000;
    }

    public void setYs02020101030000000103000000(Double ys02020101030000000103000000) {
        this.ys02020101030000000103000000 = ys02020101030000000103000000;
    }

    public Double getYs02020101030000000103010000() {
        return ys02020101030000000103010000;
    }

    public void setYs02020101030000000103010000(Double ys02020101030000000103010000) {
        this.ys02020101030000000103010000 = ys02020101030000000103010000;
    }

    public Double getYs02020101030000000104000000() {
        return ys02020101030000000104000000;
    }

    public void setYs02020101030000000104000000(Double ys02020101030000000104000000) {
        this.ys02020101030000000104000000 = ys02020101030000000104000000;
    }

    public Double getYs02020101030000000200000000() {
        return ys02020101030000000200000000;
    }

    public void setYs02020101030000000200000000(Double ys02020101030000000200000000) {
        this.ys02020101030000000200000000 = ys02020101030000000200000000;
    }

    public Double getYs02020101030000000201000000() {
        return ys02020101030000000201000000;
    }

    public void setYs02020101030000000201000000(Double ys02020101030000000201000000) {
        this.ys02020101030000000201000000 = ys02020101030000000201000000;
    }

    public Double getYs02020101030000000202000000() {
        return ys02020101030000000202000000;
    }

    public void setYs02020101030000000202000000(Double ys02020101030000000202000000) {
        this.ys02020101030000000202000000 = ys02020101030000000202000000;
    }

    public Double getYs02020101030000000202010000() {
        return ys02020101030000000202010000;
    }

    public void setYs02020101030000000202010000(Double ys02020101030000000202010000) {
        this.ys02020101030000000202010000 = ys02020101030000000202010000;
    }

    public Double getYs02020101030000000203000000() {
        return ys02020101030000000203000000;
    }

    public void setYs02020101030000000203000000(Double ys02020101030000000203000000) {
        this.ys02020101030000000203000000 = ys02020101030000000203000000;
    }

    public Double getYs02020101030000000203010000() {
        return ys02020101030000000203010000;
    }

    public void setYs02020101030000000203010000(Double ys02020101030000000203010000) {
        this.ys02020101030000000203010000 = ys02020101030000000203010000;
    }

    public Double getYs02020101030000000204000000() {
        return ys02020101030000000204000000;
    }

    public void setYs02020101030000000204000000(Double ys02020101030000000204000000) {
        this.ys02020101030000000204000000 = ys02020101030000000204000000;
    }

    public Double getYs02020101030000000300000000() {
        return ys02020101030000000300000000;
    }

    public void setYs02020101030000000300000000(Double ys02020101030000000300000000) {
        this.ys02020101030000000300000000 = ys02020101030000000300000000;
    }

    public Double getYs02020101030000000301000000() {
        return ys02020101030000000301000000;
    }

    public void setYs02020101030000000301000000(Double ys02020101030000000301000000) {
        this.ys02020101030000000301000000 = ys02020101030000000301000000;
    }

    public Double getYs02020101030000000302000000() {
        return ys02020101030000000302000000;
    }

    public void setYs02020101030000000302000000(Double ys02020101030000000302000000) {
        this.ys02020101030000000302000000 = ys02020101030000000302000000;
    }

    public Double getYs02020101030000000302010000() {
        return ys02020101030000000302010000;
    }

    public void setYs02020101030000000302010000(Double ys02020101030000000302010000) {
        this.ys02020101030000000302010000 = ys02020101030000000302010000;
    }

    public Double getYs02020101030000000303000000() {
        return ys02020101030000000303000000;
    }

    public void setYs02020101030000000303000000(Double ys02020101030000000303000000) {
        this.ys02020101030000000303000000 = ys02020101030000000303000000;
    }

    public Double getYs02020101030000000303010000() {
        return ys02020101030000000303010000;
    }

    public void setYs02020101030000000303010000(Double ys02020101030000000303010000) {
        this.ys02020101030000000303010000 = ys02020101030000000303010000;
    }

    public Double getYs02020101030000000304000000() {
        return ys02020101030000000304000000;
    }

    public void setYs02020101030000000304000000(Double ys02020101030000000304000000) {
        this.ys02020101030000000304000000 = ys02020101030000000304000000;
    }

    public Double getYs02020101030000000400000000() {
        return ys02020101030000000400000000;
    }

    public void setYs02020101030000000400000000(Double ys02020101030000000400000000) {
        this.ys02020101030000000400000000 = ys02020101030000000400000000;
    }

    public Double getYs02020101030000000401000000() {
        return ys02020101030000000401000000;
    }

    public void setYs02020101030000000401000000(Double ys02020101030000000401000000) {
        this.ys02020101030000000401000000 = ys02020101030000000401000000;
    }

    public Double getYs02020101030000000402000000() {
        return ys02020101030000000402000000;
    }

    public void setYs02020101030000000402000000(Double ys02020101030000000402000000) {
        this.ys02020101030000000402000000 = ys02020101030000000402000000;
    }

    public Double getYs02020101030000000402010000() {
        return ys02020101030000000402010000;
    }

    public void setYs02020101030000000402010000(Double ys02020101030000000402010000) {
        this.ys02020101030000000402010000 = ys02020101030000000402010000;
    }

    public Double getYs02020101030000000403000000() {
        return ys02020101030000000403000000;
    }

    public void setYs02020101030000000403000000(Double ys02020101030000000403000000) {
        this.ys02020101030000000403000000 = ys02020101030000000403000000;
    }

    public Double getYs02020101030000000403010000() {
        return ys02020101030000000403010000;
    }

    public void setYs02020101030000000403010000(Double ys02020101030000000403010000) {
        this.ys02020101030000000403010000 = ys02020101030000000403010000;
    }

    public Double getYs02020101030000000404000000() {
        return ys02020101030000000404000000;
    }

    public void setYs02020101030000000404000000(Double ys02020101030000000404000000) {
        this.ys02020101030000000404000000 = ys02020101030000000404000000;
    }

    public Double getYs02020101030000000600000000() {
        return ys02020101030000000600000000;
    }

    public void setYs02020101030000000600000000(Double ys02020101030000000600000000) {
        this.ys02020101030000000600000000 = ys02020101030000000600000000;
    }

    public Double getYs02020101030000000601000000() {
        return ys02020101030000000601000000;
    }

    public void setYs02020101030000000601000000(Double ys02020101030000000601000000) {
        this.ys02020101030000000601000000 = ys02020101030000000601000000;
    }

    public Double getYs02020101030000000602000000() {
        return ys02020101030000000602000000;
    }

    public void setYs02020101030000000602000000(Double ys02020101030000000602000000) {
        this.ys02020101030000000602000000 = ys02020101030000000602000000;
    }

    public Double getYs02020101030000000602010000() {
        return ys02020101030000000602010000;
    }

    public void setYs02020101030000000602010000(Double ys02020101030000000602010000) {
        this.ys02020101030000000602010000 = ys02020101030000000602010000;
    }

    public Double getYs02020101030000000603000000() {
        return ys02020101030000000603000000;
    }

    public void setYs02020101030000000603000000(Double ys02020101030000000603000000) {
        this.ys02020101030000000603000000 = ys02020101030000000603000000;
    }

    public Double getYs02020101030000000603010000() {
        return ys02020101030000000603010000;
    }

    public void setYs02020101030000000603010000(Double ys02020101030000000603010000) {
        this.ys02020101030000000603010000 = ys02020101030000000603010000;
    }

    public Double getYs02020101030000000604000000() {
        return ys02020101030000000604000000;
    }

    public void setYs02020101030000000604000000(Double ys02020101030000000604000000) {
        this.ys02020101030000000604000000 = ys02020101030000000604000000;
    }

    public Double getYs02020101030000000700000000() {
        return ys02020101030000000700000000;
    }

    public void setYs02020101030000000700000000(Double ys02020101030000000700000000) {
        this.ys02020101030000000700000000 = ys02020101030000000700000000;
    }

    public Double getYs02020101030000000701000000() {
        return ys02020101030000000701000000;
    }

    public void setYs02020101030000000701000000(Double ys02020101030000000701000000) {
        this.ys02020101030000000701000000 = ys02020101030000000701000000;
    }

    public Double getYs02020101030000000702000000() {
        return ys02020101030000000702000000;
    }

    public void setYs02020101030000000702000000(Double ys02020101030000000702000000) {
        this.ys02020101030000000702000000 = ys02020101030000000702000000;
    }

    public Double getYs02020101030000000702010000() {
        return ys02020101030000000702010000;
    }

    public void setYs02020101030000000702010000(Double ys02020101030000000702010000) {
        this.ys02020101030000000702010000 = ys02020101030000000702010000;
    }

    public Double getYs02020101030000000703000000() {
        return ys02020101030000000703000000;
    }

    public void setYs02020101030000000703000000(Double ys02020101030000000703000000) {
        this.ys02020101030000000703000000 = ys02020101030000000703000000;
    }

    public Double getYs02020101030000000703010000() {
        return ys02020101030000000703010000;
    }

    public void setYs02020101030000000703010000(Double ys02020101030000000703010000) {
        this.ys02020101030000000703010000 = ys02020101030000000703010000;
    }

    public Double getYs02020101030000000704000000() {
        return ys02020101030000000704000000;
    }

    public void setYs02020101030000000704000000(Double ys02020101030000000704000000) {
        this.ys02020101030000000704000000 = ys02020101030000000704000000;
    }

    public Double getYs02020101030300000100000000() {
        return ys02020101030300000100000000;
    }

    public void setYs02020101030300000100000000(Double ys02020101030300000100000000) {
        this.ys02020101030300000100000000 = ys02020101030300000100000000;
    }

    public Double getYs02020101030300000101000000() {
        return ys02020101030300000101000000;
    }

    public void setYs02020101030300000101000000(Double ys02020101030300000101000000) {
        this.ys02020101030300000101000000 = ys02020101030300000101000000;
    }

    public Double getYs02020101030300000102000000() {
        return ys02020101030300000102000000;
    }

    public void setYs02020101030300000102000000(Double ys02020101030300000102000000) {
        this.ys02020101030300000102000000 = ys02020101030300000102000000;
    }

    public Double getYs02020101030300000102010000() {
        return ys02020101030300000102010000;
    }

    public void setYs02020101030300000102010000(Double ys02020101030300000102010000) {
        this.ys02020101030300000102010000 = ys02020101030300000102010000;
    }

    public Double getYs02020101030300000103000000() {
        return ys02020101030300000103000000;
    }

    public void setYs02020101030300000103000000(Double ys02020101030300000103000000) {
        this.ys02020101030300000103000000 = ys02020101030300000103000000;
    }

    public Double getYs02020101030300000103010000() {
        return ys02020101030300000103010000;
    }

    public void setYs02020101030300000103010000(Double ys02020101030300000103010000) {
        this.ys02020101030300000103010000 = ys02020101030300000103010000;
    }

    public Double getYs02020101030300000104000000() {
        return ys02020101030300000104000000;
    }

    public void setYs02020101030300000104000000(Double ys02020101030300000104000000) {
        this.ys02020101030300000104000000 = ys02020101030300000104000000;
    }

    public Double getYs02020101030300000200000000() {
        return ys02020101030300000200000000;
    }

    public void setYs02020101030300000200000000(Double ys02020101030300000200000000) {
        this.ys02020101030300000200000000 = ys02020101030300000200000000;
    }

    public Double getYs02020101030300000201000000() {
        return ys02020101030300000201000000;
    }

    public void setYs02020101030300000201000000(Double ys02020101030300000201000000) {
        this.ys02020101030300000201000000 = ys02020101030300000201000000;
    }

    public Double getYs02020101030300000202000000() {
        return ys02020101030300000202000000;
    }

    public void setYs02020101030300000202000000(Double ys02020101030300000202000000) {
        this.ys02020101030300000202000000 = ys02020101030300000202000000;
    }

    public Double getYs02020101030300000202010000() {
        return ys02020101030300000202010000;
    }

    public void setYs02020101030300000202010000(Double ys02020101030300000202010000) {
        this.ys02020101030300000202010000 = ys02020101030300000202010000;
    }

    public Double getYs02020101030300000203000000() {
        return ys02020101030300000203000000;
    }

    public void setYs02020101030300000203000000(Double ys02020101030300000203000000) {
        this.ys02020101030300000203000000 = ys02020101030300000203000000;
    }

    public Double getYs02020101030300000203010000() {
        return ys02020101030300000203010000;
    }

    public void setYs02020101030300000203010000(Double ys02020101030300000203010000) {
        this.ys02020101030300000203010000 = ys02020101030300000203010000;
    }

    public Double getYs02020101030300000204000000() {
        return ys02020101030300000204000000;
    }

    public void setYs02020101030300000204000000(Double ys02020101030300000204000000) {
        this.ys02020101030300000204000000 = ys02020101030300000204000000;
    }

    public Double getYs02020101030300000300000000() {
        return ys02020101030300000300000000;
    }

    public void setYs02020101030300000300000000(Double ys02020101030300000300000000) {
        this.ys02020101030300000300000000 = ys02020101030300000300000000;
    }

    public Double getYs02020101030300000301000000() {
        return ys02020101030300000301000000;
    }

    public void setYs02020101030300000301000000(Double ys02020101030300000301000000) {
        this.ys02020101030300000301000000 = ys02020101030300000301000000;
    }

}