package com.meixiang.beauty.webapp.traffic.dto.sjtystjfxjc;

import com.alibaba.fastjson.annotation.JSONField;
import java.util.Date;
import java.util.List;

public class Ttjjhjht7DTO {


    /**
     * 序列号
     **/
    @JSONField(name="serialNo")
    private Integer serialNo;

    /**
     * 年
     **/
    @JSONField(name="year")
    private Integer year;

    /**
     * 月
     **/
    @JSONField(name="month")
    private Integer month;

    public Integer getSerialNo() {
        return serialNo;
    }

    public void setSerialNo(Integer serialNo) {
        this.serialNo = serialNo;
    }

    public Integer getYear() {
        return year;
    }

    public void setYear(Integer year) {
        this.year = year;
    }

    public Integer getMonth() {
        return month;
    }

    public void setMonth(Integer month) {
        this.month = month;
    }


    /**
     *行标识
    **/
    @JSONField(name="recid")
    private String recid;

    /**
     *行版本
    **/
    @JSONField(name="recver")
    private Double recver;

    /**
     *单位
    **/
    @JSONField(name="unitid")
    private String unitid;

    /**
     *数据时期
    **/
    @JSONField(name="datatime")
    private String datatime;

    /**
     *浮动行顺序号
    **/
    @JSONField(name="floatorder")
    private Double floatorder;

    /**
     *客运车辆数
    **/
    @JSONField(name="ys02010100000000000100000000")
    private Double ys02010100000000000100000000;

    /**
     *个体客运车辆数
    **/
    @JSONField(name="ys02010100000000000101000000")
    private Double ys02010100000000000101000000;

    @JSONField(name="ys02010100000000000102000000")
    private Double ys02010100000000000102000000;

    @JSONField(name="ys02010100000000000103000000")
    private Double ys02010100000000000103000000;

    @JSONField(name="ys02010100000000000111000000")
    private Double ys02010100000000000111000000;

    @JSONField(name="ys02010100000000000111010000")
    private Double ys02010100000000000111010000;

    @JSONField(name="ys02010100000000000112000000")
    private Double ys02010100000000000112000000;

    @JSONField(name="ys02010100000000000112010000")
    private Double ys02010100000000000112010000;

    @JSONField(name="ys02010100000000000113000000")
    private Double ys02010100000000000113000000;

    @JSONField(name="ys02010100000000000113010000")
    private Double ys02010100000000000113010000;

    @JSONField(name="ys02010100000000000121000000")
    private Double ys02010100000000000121000000;

    @JSONField(name="ys02010100000000000122000000")
    private Double ys02010100000000000122000000;

    @JSONField(name="ys02010100000000000123000000")
    private Double ys02010100000000000123000000;

    @JSONField(name="ys02010100000000000124000000")
    private Double ys02010100000000000124000000;

    @JSONField(name="ys02010100000000000131000000")
    private Double ys02010100000000000131000000;

    @JSONField(name="ys02010100000000000132000000")
    private Double ys02010100000000000132000000;

    @JSONField(name="ys02010100000000000133000000")
    private Double ys02010100000000000133000000;

    /**
     *客运车辆客位数
    **/
    @JSONField(name="ys02010100000000000200000000")
    private Double ys02010100000000000200000000;

    /**
     *个体客运车辆客位数
    **/
    @JSONField(name="ys02010100000000000201000000")
    private Double ys02010100000000000201000000;

    @JSONField(name="ys02010100000000000202000000")
    private Double ys02010100000000000202000000;

    @JSONField(name="ys02010100000000000203000000")
    private Double ys02010100000000000203000000;

    @JSONField(name="ys02010100000000000211000000")
    private Double ys02010100000000000211000000;

    @JSONField(name="ys02010100000000000211010000")
    private Double ys02010100000000000211010000;

    @JSONField(name="ys02010100000000000212000000")
    private Double ys02010100000000000212000000;

    @JSONField(name="ys02010100000000000212010000")
    private Double ys02010100000000000212010000;

    @JSONField(name="ys02010100000000000213000000")
    private Double ys02010100000000000213000000;

    @JSONField(name="ys02010100000000000213010000")
    private Double ys02010100000000000213010000;

    @JSONField(name="ys02010100000000000221000000")
    private Double ys02010100000000000221000000;

    @JSONField(name="ys02010100000000000222000000")
    private Double ys02010100000000000222000000;

    @JSONField(name="ys02010100000000000223000000")
    private Double ys02010100000000000223000000;

    @JSONField(name="ys02010100000000000224000000")
    private Double ys02010100000000000224000000;

    @JSONField(name="ys02010100000000000231000000")
    private Double ys02010100000000000231000000;

    @JSONField(name="ys02010100000000000232000000")
    private Double ys02010100000000000232000000;

    @JSONField(name="ys02010100000000000233000000")
    private Double ys02010100000000000233000000;

    /**
     *载客汽车-客运车辆数
    **/
    @JSONField(name="ys02010101000000000100000000")
    private Double ys02010101000000000100000000;

    /**
     *载客汽车-个体客运车辆数
    **/
    @JSONField(name="ys02010101000000000101000000")
    private Double ys02010101000000000101000000;

    @JSONField(name="ys02010101000000000102000000")
    private Double ys02010101000000000102000000;

    @JSONField(name="ys02010101000000000103000000")
    private Double ys02010101000000000103000000;

    /**
     *载客汽车-大型客运车辆数（按标记客位分）
    **/
    @JSONField(name="ys02010101000000000111000000")
    private Double ys02010101000000000111000000;

    /**
     *载客汽车-个体大型客运车辆数（按标记客位分）
    **/
    @JSONField(name="ys02010101000000000111010000")
    private Double ys02010101000000000111010000;

    /**
     *载客汽车-中型客运车辆数（按标记客位分）
    **/
    @JSONField(name="ys02010101000000000112000000")
    private Double ys02010101000000000112000000;

    /**
     *载客汽车-个体中型客运车辆数（按标记客位分）
    **/
    @JSONField(name="ys02010101000000000112010000")
    private Double ys02010101000000000112010000;

    /**
     *载客汽车-小型客运车辆数（按标记客位分）
    **/
    @JSONField(name="ys02010101000000000113000000")
    private Double ys02010101000000000113000000;

    /**
     *载客汽车-个体小型客运车辆数（按标记客位分）
    **/
    @JSONField(name="ys02010101000000000113010000")
    private Double ys02010101000000000113010000;

    /**
     *载客汽车-特大型客运车辆数（按车长分）
    **/
    @JSONField(name="ys02010101000000000121000000")
    private Double ys02010101000000000121000000;

    /**
     *载客汽车-大型客运车辆数（按车长分）
    **/
    @JSONField(name="ys02010101000000000122000000")
    private Double ys02010101000000000122000000;

    /**
     *载客汽车-中型客运车辆数（按车长分）
    **/
    @JSONField(name="ys02010101000000000123000000")
    private Double ys02010101000000000123000000;

    /**
     *载客汽车-小型客运车辆数（按车长分）
    **/
    @JSONField(name="ys02010101000000000124000000")
    private Double ys02010101000000000124000000;

    /**
     *载客汽车-高级客运车辆数（按等级分）
    **/
    @JSONField(name="ys02010101000000000131000000")
    private Double ys02010101000000000131000000;

    /**
     *载客汽车-中级客运车辆数（按等级分）
    **/
    @JSONField(name="ys02010101000000000132000000")
    private Double ys02010101000000000132000000;

    /**
     *载客汽车-普通客运车辆数（按等级分）
    **/
    @JSONField(name="ys02010101000000000133000000")
    private Double ys02010101000000000133000000;

    /**
     *载客汽车-客运车辆客位数
    **/
    @JSONField(name="ys02010101000000000200000000")
    private Double ys02010101000000000200000000;

    /**
     *载客汽车-个体客运车辆客位数
    **/
    @JSONField(name="ys02010101000000000201000000")
    private Double ys02010101000000000201000000;

    @JSONField(name="ys02010101000000000202000000")
    private Double ys02010101000000000202000000;

    @JSONField(name="ys02010101000000000203000000")
    private Double ys02010101000000000203000000;

    /**
     *载客汽车-大型客运车辆客位数（按标记客位分）
    **/
    @JSONField(name="ys02010101000000000211000000")
    private Double ys02010101000000000211000000;

    /**
     *载客汽车-个体大型客运车辆客位数（按标记客位分）
    **/
    @JSONField(name="ys02010101000000000211010000")
    private Double ys02010101000000000211010000;

    /**
     *载客汽车-中型客运车辆客位数（按标记客位分）
    **/
    @JSONField(name="ys02010101000000000212000000")
    private Double ys02010101000000000212000000;

    /**
     *载客汽车-个体中型客运车辆客位数（按标记客位分）
    **/
    @JSONField(name="ys02010101000000000212010000")
    private Double ys02010101000000000212010000;

    /**
     *载客汽车-小型客运车辆客位数（按标记客位分）
    **/
    @JSONField(name="ys02010101000000000213000000")
    private Double ys02010101000000000213000000;

    /**
     *载客汽车-个体小型客运车辆客位数（按标记客位分）
    **/
    @JSONField(name="ys02010101000000000213010000")
    private Double ys02010101000000000213010000;

    /**
     *载客汽车-特大型客运车辆客位数（按车长分）
    **/
    @JSONField(name="ys02010101000000000221000000")
    private Double ys02010101000000000221000000;

    /**
     *载客汽车-大型客运车辆客位数（按车长分）
    **/
    @JSONField(name="ys02010101000000000222000000")
    private Double ys02010101000000000222000000;

    /**
     *载客汽车-中型客运车辆客位数（按车长分）
    **/
    @JSONField(name="ys02010101000000000223000000")
    private Double ys02010101000000000223000000;

    /**
     *载客汽车-小型客运车辆客位数（按车长分）
    **/
    @JSONField(name="ys02010101000000000224000000")
    private Double ys02010101000000000224000000;

    /**
     *载客汽车-高级客运车辆客位数（按等级分）
    **/
    @JSONField(name="ys02010101000000000231000000")
    private Double ys02010101000000000231000000;

    /**
     *载客汽车-中级客运车辆客位数（按等级分）
    **/
    @JSONField(name="ys02010101000000000232000000")
    private Double ys02010101000000000232000000;

    /**
     *载客汽车-普通客运车辆客位数（按等级分）
    **/
    @JSONField(name="ys02010101000000000233000000")
    private Double ys02010101000000000233000000;

    /**
     *卧铺客车-客运车辆数
    **/
    @JSONField(name="ys02010101010000000100000000")
    private Double ys02010101010000000100000000;

    /**
     *卧铺客车-个体客运车辆数
    **/
    @JSONField(name="ys02010101010000000101000000")
    private Double ys02010101010000000101000000;

    @JSONField(name="ys02010101010000000102000000")
    private Double ys02010101010000000102000000;

    @JSONField(name="ys02010101010000000103000000")
    private Double ys02010101010000000103000000;

    /**
     *卧铺客车-大型客运车辆数（按标记客位分）
    **/
    @JSONField(name="ys02010101010000000111000000")
    private Double ys02010101010000000111000000;

    /**
     *卧铺客车-个体大型客运车辆数（按标记客位分）
    **/
    @JSONField(name="ys02010101010000000111010000")
    private Double ys02010101010000000111010000;

    /**
     *卧铺客车-中型客运车辆数（按标记客位分）
    **/
    @JSONField(name="ys02010101010000000112000000")
    private Double ys02010101010000000112000000;

    /**
     *卧铺客车-个体中型客运车辆数（按标记客位分）
    **/
    @JSONField(name="ys02010101010000000112010000")
    private Double ys02010101010000000112010000;

    /**
     *卧铺客车-小型客运车辆数（按标记客位分）
    **/
    @JSONField(name="ys02010101010000000113000000")
    private Double ys02010101010000000113000000;

    /**
     *卧铺客车-个体小型客运车辆数（按标记客位分）
    **/
    @JSONField(name="ys02010101010000000113010000")
    private Double ys02010101010000000113010000;

    /**
     *卧铺客车-特大型客运车辆数（按车长分）
    **/
    @JSONField(name="ys02010101010000000121000000")
    private Double ys02010101010000000121000000;

    /**
     *卧铺客车-大型客运车辆数（按车长分）
    **/
    @JSONField(name="ys02010101010000000122000000")
    private Double ys02010101010000000122000000;

    /**
     *卧铺客车-中型客运车辆数（按车长分）
    **/
    @JSONField(name="ys02010101010000000123000000")
    private Double ys02010101010000000123000000;

    /**
     *卧铺客车-小型客运车辆数（按车长分）
    **/
    @JSONField(name="ys02010101010000000124000000")
    private Double ys02010101010000000124000000;

    /**
     *卧铺客车-高级客运车辆数（按等级分）
    **/
    @JSONField(name="ys02010101010000000131000000")
    private Double ys02010101010000000131000000;

    /**
     *卧铺客车-中级客运车辆数（按等级分）
    **/
    @JSONField(name="ys02010101010000000132000000")
    private Double ys02010101010000000132000000;

    /**
     *卧铺客车-普通客运车辆数（按等级分）
    **/
    @JSONField(name="ys02010101010000000133000000")
    private Double ys02010101010000000133000000;

    /**
     *卧铺客车-客运车辆客位数
    **/
    @JSONField(name="ys02010101010000000200000000")
    private Double ys02010101010000000200000000;

    /**
     *卧铺客车-个体客运车辆客位数
    **/
    @JSONField(name="ys02010101010000000201000000")
    private Double ys02010101010000000201000000;

    @JSONField(name="ys02010101010000000202000000")
    private Double ys02010101010000000202000000;

    @JSONField(name="ys02010101010000000203000000")
    private Double ys02010101010000000203000000;

    /**
     *卧铺客车-大型客运车辆客位数（按标记客位分）
    **/
    @JSONField(name="ys02010101010000000211000000")
    private Double ys02010101010000000211000000;

    /**
     *卧铺客车-个体大型客运车辆客位数（按标记客位分）
    **/
    @JSONField(name="ys02010101010000000211010000")
    private Double ys02010101010000000211010000;

    /**
     *卧铺客车-中型客运车辆客位数（按标记客位分）
    **/
    @JSONField(name="ys02010101010000000212000000")
    private Double ys02010101010000000212000000;

    /**
     *卧铺客车-个体中型客运车辆客位数（按标记客位分）
    **/
    @JSONField(name="ys02010101010000000212010000")
    private Double ys02010101010000000212010000;

    /**
     *卧铺客车-小型客运车辆客位数（按标记客位分）
    **/
    @JSONField(name="ys02010101010000000213000000")
    private Double ys02010101010000000213000000;

    /**
     *卧铺客车-个体小型客运车辆客位数（按标记客位分）
    **/
    @JSONField(name="ys02010101010000000213010000")
    private Double ys02010101010000000213010000;

    /**
     *卧铺客车-特大型客运车辆客位数（按车长分）
    **/
    @JSONField(name="ys02010101010000000221000000")
    private Double ys02010101010000000221000000;

    /**
     *卧铺客车-大型客运车辆客位数（按车长分）
    **/
    @JSONField(name="ys02010101010000000222000000")
    private Double ys02010101010000000222000000;

    /**
     *卧铺客车-中型客运车辆客位数（按车长分）
    **/
    @JSONField(name="ys02010101010000000223000000")
    private Double ys02010101010000000223000000;

    /**
     *卧铺客车-小型客运车辆客位数（按车长分）
    **/
    @JSONField(name="ys02010101010000000224000000")
    private Double ys02010101010000000224000000;

    /**
     *卧铺客车-高级客运车辆客位数（按等级分）
    **/
    @JSONField(name="ys02010101010000000231000000")
    private Double ys02010101010000000231000000;

    /**
     *卧铺客车-中级客运车辆客位数（按等级分）
    **/
    @JSONField(name="ys02010101010000000232000000")
    private Double ys02010101010000000232000000;

    /**
     *卧铺客车-普通客运车辆客位数（按等级分）
    **/
    @JSONField(name="ys02010101010000000233000000")
    private Double ys02010101010000000233000000;

    /**
     *班车客运客车-客运车辆数
    **/
    @JSONField(name="ys02010101110000000100000000")
    private Double ys02010101110000000100000000;

    /**
     *班车客运客车-个体客运车辆数
    **/
    @JSONField(name="ys02010101110000000101000000")
    private Double ys02010101110000000101000000;

    @JSONField(name="ys02010101110000000102000000")
    private Double ys02010101110000000102000000;

    @JSONField(name="ys02010101110000000103000000")
    private Double ys02010101110000000103000000;

    /**
     *班车客运客车-大型客运车辆数（按标记客位分）
    **/
    @JSONField(name="ys02010101110000000111000000")
    private Double ys02010101110000000111000000;

    /**
     *班车客运客车-个体大型客运车辆数（按标记客位分）
    **/
    @JSONField(name="ys02010101110000000111010000")
    private Double ys02010101110000000111010000;

    /**
     *班车客运客车-中型客运车辆数（按标记客位分）
    **/
    @JSONField(name="ys02010101110000000112000000")
    private Double ys02010101110000000112000000;

    /**
     *班车客运客车-个体中型客运车辆数（按标记客位分）
    **/
    @JSONField(name="ys02010101110000000112010000")
    private Double ys02010101110000000112010000;

    /**
     *班车客运客车-小型客运车辆数（按标记客位分）
    **/
    @JSONField(name="ys02010101110000000113000000")
    private Double ys02010101110000000113000000;

    /**
     *班车客运客车-个体小型客运车辆数（按标记客位分）
    **/
    @JSONField(name="ys02010101110000000113010000")
    private Double ys02010101110000000113010000;

    /**
     *班车客运客车-特大型客运车辆数（按车长分）
    **/
    @JSONField(name="ys02010101110000000121000000")
    private Double ys02010101110000000121000000;

    /**
     *班车客运客车-大型客运车辆数（按车长分）
    **/
    @JSONField(name="ys02010101110000000122000000")
    private Double ys02010101110000000122000000;

    /**
     *班车客运客车-中型客运车辆数（按车长分）
    **/
    @JSONField(name="ys02010101110000000123000000")
    private Double ys02010101110000000123000000;

    /**
     *班车客运客车-小型客运车辆数（按车长分）
    **/
    @JSONField(name="ys02010101110000000124000000")
    private Double ys02010101110000000124000000;

    /**
     *班车客运客车-高级客运车辆数（按等级分）
    **/
    @JSONField(name="ys02010101110000000131000000")
    private Double ys02010101110000000131000000;

    /**
     *班车客运客车-中级客运车辆数（按等级分）
    **/
    @JSONField(name="ys02010101110000000132000000")
    private Double ys02010101110000000132000000;

    /**
     *班车客运客车-普通客运车辆数（按等级分）
    **/
    @JSONField(name="ys02010101110000000133000000")
    private Double ys02010101110000000133000000;

    /**
     *班车客运客车-客运车辆客位数
    **/
    @JSONField(name="ys02010101110000000200000000")
    private Double ys02010101110000000200000000;

    /**
     *班车客运客车-个体客运车辆客位数
    **/
    @JSONField(name="ys02010101110000000201000000")
    private Double ys02010101110000000201000000;

    @JSONField(name="ys02010101110000000202000000")
    private Double ys02010101110000000202000000;

    @JSONField(name="ys02010101110000000203000000")
    private Double ys02010101110000000203000000;

    /**
     *班车客运客车-大型客运车辆客位数（按标记客位分）
    **/
    @JSONField(name="ys02010101110000000211000000")
    private Double ys02010101110000000211000000;

    /**
     *班车客运客车-个体大型客运车辆客位数（按标记客位分?
    **/
    @JSONField(name="ys02010101110000000211010000")
    private Double ys02010101110000000211010000;

    /**
     *班车客运客车-中型客运车辆客位数（按标记客位分）
    **/
    @JSONField(name="ys02010101110000000212000000")
    private Double ys02010101110000000212000000;

    /**
     *班车客运客车-个体中型客运车辆客位数（按标记客位分）
    **/
    @JSONField(name="ys02010101110000000212010000")
    private Double ys02010101110000000212010000;

    /**
     *班车客运客车-小型客运车辆客位数（按标记客位分）
    **/
    @JSONField(name="ys02010101110000000213000000")
    private Double ys02010101110000000213000000;

    /**
     *班车客运客车-个体小型客运车辆客位数（按标记客位分）
    **/
    @JSONField(name="ys02010101110000000213010000")
    private Double ys02010101110000000213010000;

    /**
     *班车客运客车-特大型客运车辆客位数（按车长分）
    **/
    @JSONField(name="ys02010101110000000221000000")
    private Double ys02010101110000000221000000;

    /**
     *班车客运客车-大型客运车辆客位数（按车长分）
    **/
    @JSONField(name="ys02010101110000000222000000")
    private Double ys02010101110000000222000000;

    /**
     *班车客运客车-中型客运车辆客位数（按车长分）
    **/
    @JSONField(name="ys02010101110000000223000000")
    private Double ys02010101110000000223000000;

    /**
     *班车客运客车-小型客运车辆客位数（按车长分）
    **/
    @JSONField(name="ys02010101110000000224000000")
    private Double ys02010101110000000224000000;

    /**
     *班车客运客车-高级客运车辆客位数（按等级分）
    **/
    @JSONField(name="ys02010101110000000231000000")
    private Double ys02010101110000000231000000;

    /**
     *班车客运客车-中级客运车辆客位数（按等级分）
    **/
    @JSONField(name="ys02010101110000000232000000")
    private Double ys02010101110000000232000000;

    /**
     *班车客运客车-普通客运车辆客位数（按等级分）
    **/
    @JSONField(name="ys02010101110000000233000000")
    private Double ys02010101110000000233000000;

    /**
     *旅游客车-客运车辆数
    **/
    @JSONField(name="ys02010101120000000100000000")
    private Double ys02010101120000000100000000;

    /**
     *旅游客车-个体客运车辆数
    **/
    @JSONField(name="ys02010101120000000101000000")
    private Double ys02010101120000000101000000;

    @JSONField(name="ys02010101120000000102000000")
    private Double ys02010101120000000102000000;

    @JSONField(name="ys02010101120000000103000000")
    private Double ys02010101120000000103000000;

    /**
     *旅游客车-大型客运车辆数（按标记客位分）
    **/
    @JSONField(name="ys02010101120000000111000000")
    private Double ys02010101120000000111000000;

    /**
     *旅游客车-个体大型客运车辆数（按标记客位分）
    **/
    @JSONField(name="ys02010101120000000111010000")
    private Double ys02010101120000000111010000;

    /**
     *旅游客车-中型客运车辆数（按标记客位分）
    **/
    @JSONField(name="ys02010101120000000112000000")
    private Double ys02010101120000000112000000;

    /**
     *旅游客车-个体中型客运车辆数（按标记客位分）
    **/
    @JSONField(name="ys02010101120000000112010000")
    private Double ys02010101120000000112010000;

    /**
     *旅游客车-小型客运车辆数（按标记客位分）
    **/
    @JSONField(name="ys02010101120000000113000000")
    private Double ys02010101120000000113000000;

    /**
     *旅游客车-个体小型客运车辆数（按标记客位分）
    **/
    @JSONField(name="ys02010101120000000113010000")
    private Double ys02010101120000000113010000;

    /**
     *旅游客车-特大型客运车辆数（按车长分）
    **/
    @JSONField(name="ys02010101120000000121000000")
    private Double ys02010101120000000121000000;

    /**
     *旅游客车-大型客运车辆数（按车长分）
    **/
    @JSONField(name="ys02010101120000000122000000")
    private Double ys02010101120000000122000000;

    /**
     *旅游客车-中型客运车辆数（按车长分）
    **/
    @JSONField(name="ys02010101120000000123000000")
    private Double ys02010101120000000123000000;

    /**
     *旅游客车-小型客运车辆数（按车长分）
    **/
    @JSONField(name="ys02010101120000000124000000")
    private Double ys02010101120000000124000000;

    /**
     *旅游客车-高级客运车辆数（按等级分）
    **/
    @JSONField(name="ys02010101120000000131000000")
    private Double ys02010101120000000131000000;

    /**
     *旅游客车-中级客运车辆数（按等级分）
    **/
    @JSONField(name="ys02010101120000000132000000")
    private Double ys02010101120000000132000000;

    /**
     *旅游客车-普通客运车辆数（按等级分）
    **/
    @JSONField(name="ys02010101120000000133000000")
    private Double ys02010101120000000133000000;

    /**
     *旅游客车-客运车辆客位数
    **/
    @JSONField(name="ys02010101120000000200000000")
    private Double ys02010101120000000200000000;

    /**
     *旅游客车-个体客运车辆客位数
    **/
    @JSONField(name="ys02010101120000000201000000")
    private Double ys02010101120000000201000000;

    @JSONField(name="ys02010101120000000202000000")
    private Double ys02010101120000000202000000;

    @JSONField(name="ys02010101120000000203000000")
    private Double ys02010101120000000203000000;

    /**
     *旅游客车-大型客运车辆客位数（按标记客位分）
    **/
    @JSONField(name="ys02010101120000000211000000")
    private Double ys02010101120000000211000000;

    /**
     *旅游客车-个体大型客运车辆客位数（按标记客位分）
    **/
    @JSONField(name="ys02010101120000000211010000")
    private Double ys02010101120000000211010000;

    /**
     *旅游客车-中型客运车辆客位数（按标记客位分）
    **/
    @JSONField(name="ys02010101120000000212000000")
    private Double ys02010101120000000212000000;

    /**
     *旅游客车-个体中型客运车辆客位数（按标记客位分）
    **/
    @JSONField(name="ys02010101120000000212010000")
    private Double ys02010101120000000212010000;

    /**
     *旅游客车-小型客运车辆客位数（按标记客位分）
    **/
    @JSONField(name="ys02010101120000000213000000")
    private Double ys02010101120000000213000000;

    /**
     *旅游客车-个体小型客运车辆客位数（按标记客位分）
    **/
    @JSONField(name="ys02010101120000000213010000")
    private Double ys02010101120000000213010000;

    /**
     *旅游客车-特大型客运车辆客位数（按车长分）
    **/
    @JSONField(name="ys02010101120000000221000000")
    private Double ys02010101120000000221000000;

    /**
     *旅游客车-大型客运车辆客位数（按车长分）
    **/
    @JSONField(name="ys02010101120000000222000000")
    private Double ys02010101120000000222000000;

    /**
     *旅游客车-中型客运车辆客位数（按车长分）
    **/
    @JSONField(name="ys02010101120000000223000000")
    private Double ys02010101120000000223000000;

    /**
     *旅游客车-小型客运车辆客位数（按车长分）
    **/
    @JSONField(name="ys02010101120000000224000000")
    private Double ys02010101120000000224000000;

    /**
     *旅游客车-高级客运车辆客位数（按等级分）
    **/
    @JSONField(name="ys02010101120000000231000000")
    private Double ys02010101120000000231000000;

    /**
     *旅游客车-中级客运车辆客位数（按等级分）
    **/
    @JSONField(name="ys02010101120000000232000000")
    private Double ys02010101120000000232000000;

    /**
     *旅游客车-普通客运车辆客位数（按等级分）
    **/
    @JSONField(name="ys02010101120000000233000000")
    private Double ys02010101120000000233000000;

    /**
     *包车客车-客运车辆数
    **/
    @JSONField(name="ys02010101130000000100000000")
    private Double ys02010101130000000100000000;

    /**
     *包车客车-个体客运车辆数
    **/
    @JSONField(name="ys02010101130000000101000000")
    private Double ys02010101130000000101000000;

    @JSONField(name="ys02010101130000000102000000")
    private Double ys02010101130000000102000000;

    @JSONField(name="ys02010101130000000103000000")
    private Double ys02010101130000000103000000;

    /**
     *包车客车-大型客运车辆数（按标记客位分）
    **/
    @JSONField(name="ys02010101130000000111000000")
    private Double ys02010101130000000111000000;

    /**
     *包车客车-个体大型客运车辆数（按标记客位分）
    **/
    @JSONField(name="ys02010101130000000111010000")
    private Double ys02010101130000000111010000;

    /**
     *包车客车-中型客运车辆数（按标记客位分）
    **/
    @JSONField(name="ys02010101130000000112000000")
    private Double ys02010101130000000112000000;

    /**
     *包车客车-个体中型客运车辆数（按标记客位分）
    **/
    @JSONField(name="ys02010101130000000112010000")
    private Double ys02010101130000000112010000;

    /**
     *包车客车-小型客运车辆数（按标记客位分）
    **/
    @JSONField(name="ys02010101130000000113000000")
    private Double ys02010101130000000113000000;

    /**
     *包车客车-个体小型客运车辆数（按标记客位分）
    **/
    @JSONField(name="ys02010101130000000113010000")
    private Double ys02010101130000000113010000;

    /**
     *包车客车-特大型客运车辆数（按车长分）
    **/
    @JSONField(name="ys02010101130000000121000000")
    private Double ys02010101130000000121000000;

    /**
     *包车客车-大型客运车辆数（按车长分）
    **/
    @JSONField(name="ys02010101130000000122000000")
    private Double ys02010101130000000122000000;

    /**
     *包车客车-中型客运车辆数（按车长分）
    **/
    @JSONField(name="ys02010101130000000123000000")
    private Double ys02010101130000000123000000;

    /**
     *包车客车-小型客运车辆数（按车长分）
    **/
    @JSONField(name="ys02010101130000000124000000")
    private Double ys02010101130000000124000000;

    /**
     *包车客车-高级客运车辆数（按等级分）
    **/
    @JSONField(name="ys02010101130000000131000000")
    private Double ys02010101130000000131000000;

    /**
     *包车客车-中级客运车辆数（按等级分）
    **/
    @JSONField(name="ys02010101130000000132000000")
    private Double ys02010101130000000132000000;

    /**
     *包车客车-普通客运车辆数（按等级分）
    **/
    @JSONField(name="ys02010101130000000133000000")
    private Double ys02010101130000000133000000;

    /**
     *包车客车-客运车辆客位数
    **/
    @JSONField(name="ys02010101130000000200000000")
    private Double ys02010101130000000200000000;

    /**
     *包车客车-个体客运车辆客位数
    **/
    @JSONField(name="ys02010101130000000201000000")
    private Double ys02010101130000000201000000;

    @JSONField(name="ys02010101130000000202000000")
    private Double ys02010101130000000202000000;

    @JSONField(name="ys02010101130000000203000000")
    private Double ys02010101130000000203000000;

    /**
     *包车客车-大型客运车辆客位数（按标记客位分）
    **/
    @JSONField(name="ys02010101130000000211000000")
    private Double ys02010101130000000211000000;

    /**
     *包车客车-个体大型客运车辆客位数（按标记客位分）
    **/
    @JSONField(name="ys02010101130000000211010000")
    private Double ys02010101130000000211010000;

    /**
     *包车客车-中型客运车辆客位数（按标记客位分）
    **/
    @JSONField(name="ys02010101130000000212000000")
    private Double ys02010101130000000212000000;

    /**
     *包车客车-个体中型客运车辆客位数（按标记客位分）
    **/
    @JSONField(name="ys02010101130000000212010000")
    private Double ys02010101130000000212010000;

    /**
     *包车客车-小型客运车辆客位数（按标记客位分）
    **/
    @JSONField(name="ys02010101130000000213000000")
    private Double ys02010101130000000213000000;

    /**
     *包车客车-个体小型客运车辆客位数（按标记客位分）
    **/
    @JSONField(name="ys02010101130000000213010000")
    private Double ys02010101130000000213010000;

    /**
     *包车客车-特大型客运车辆客位数（按车长分）
    **/
    @JSONField(name="ys02010101130000000221000000")
    private Double ys02010101130000000221000000;

    /**
     *包车客车-大型客运车辆客位数（按车长分）
    **/
    @JSONField(name="ys02010101130000000222000000")
    private Double ys02010101130000000222000000;

    /**
     *包车客车-中型客运车辆客位数（按车长分）
    **/
    @JSONField(name="ys02010101130000000223000000")
    private Double ys02010101130000000223000000;

    /**
     *包车客车-小型客运车辆客位数（按车长分）
    **/
    @JSONField(name="ys02010101130000000224000000")
    private Double ys02010101130000000224000000;

    /**
     *包车客车-高级客运车辆客位数（按等级分）
    **/
    @JSONField(name="ys02010101130000000231000000")
    private Double ys02010101130000000231000000;

    /**
     *包车客车-中级客运车辆客位数（按等级分）
    **/
    @JSONField(name="ys02010101130000000232000000")
    private Double ys02010101130000000232000000;

    /**
     *包车客车-普通客运车辆客位数（按等级分）
    **/
    @JSONField(name="ys02010101130000000233000000")
    private Double ys02010101130000000233000000;

    /**
     *其他客车-客运车辆数
    **/
    @JSONField(name="ys02010101140000000100000000")
    private Double ys02010101140000000100000000;

    /**
     *其他客车-个体客运车辆数
    **/
    @JSONField(name="ys02010101140000000101000000")
    private Double ys02010101140000000101000000;

    @JSONField(name="ys02010101140000000102000000")
    private Double ys02010101140000000102000000;

    @JSONField(name="ys02010101140000000103000000")
    private Double ys02010101140000000103000000;

    /**
     *其他客车-大型客运车辆数（按标记客位分）
    **/
    @JSONField(name="ys02010101140000000111000000")
    private Double ys02010101140000000111000000;

    /**
     *其他客车-个体大型客运车辆数（按标记客位分）
    **/
    @JSONField(name="ys02010101140000000111010000")
    private Double ys02010101140000000111010000;

    /**
     *其他客车-中型客运车辆数（按标记客位分）
    **/
    @JSONField(name="ys02010101140000000112000000")
    private Double ys02010101140000000112000000;

    /**
     *其他客车-个体中型客运车辆数（按标记客位分）
    **/
    @JSONField(name="ys02010101140000000112010000")
    private Double ys02010101140000000112010000;

    /**
     *其他客车-小型客运车辆数（按标记客位分）
    **/
    @JSONField(name="ys02010101140000000113000000")
    private Double ys02010101140000000113000000;

    /**
     *其他客车-个体小型客运车辆数（按标记客位分）
    **/
    @JSONField(name="ys02010101140000000113010000")
    private Double ys02010101140000000113010000;

    /**
     *其他客车-特大型客运车辆数（按车长分）
    **/
    @JSONField(name="ys02010101140000000121000000")
    private Double ys02010101140000000121000000;

    /**
     *其他客车-大型客运车辆数（按车长分）
    **/
    @JSONField(name="ys02010101140000000122000000")
    private Double ys02010101140000000122000000;

    /**
     *其他客车-中型客运车辆数（按车长分）
    **/
    @JSONField(name="ys02010101140000000123000000")
    private Double ys02010101140000000123000000;

    /**
     *其他客车-小型客运车辆数（按车长分）
    **/
    @JSONField(name="ys02010101140000000124000000")
    private Double ys02010101140000000124000000;

    /**
     *其他客车-高级客运车辆数（按等级分）
    **/
    @JSONField(name="ys02010101140000000131000000")
    private Double ys02010101140000000131000000;

    /**
     *其他客车-中级客运车辆数（按等级分）
    **/
    @JSONField(name="ys02010101140000000132000000")
    private Double ys02010101140000000132000000;

    /**
     *其他客车-普通客运车辆数（按等级分）
    **/
    @JSONField(name="ys02010101140000000133000000")
    private Double ys02010101140000000133000000;

    /**
     *其他客车-客运车辆客位数
    **/
    @JSONField(name="ys02010101140000000200000000")
    private Double ys02010101140000000200000000;

    /**
     *其他客车-个体客运车辆客位数
    **/
    @JSONField(name="ys02010101140000000201000000")
    private Double ys02010101140000000201000000;

    @JSONField(name="ys02010101140000000202000000")
    private Double ys02010101140000000202000000;

    @JSONField(name="ys02010101140000000203000000")
    private Double ys02010101140000000203000000;

    /**
     *其他客车-大型客运车辆客位数（按标记客位分）
    **/
    @JSONField(name="ys02010101140000000211000000")
    private Double ys02010101140000000211000000;

    /**
     *其他客车-个体大型客运车辆客位数（按标记客位分）
    **/
    @JSONField(name="ys02010101140000000211010000")
    private Double ys02010101140000000211010000;

    /**
     *其他客车-中型客运车辆客位数（按标记客位分）
    **/
    @JSONField(name="ys02010101140000000212000000")
    private Double ys02010101140000000212000000;

    /**
     *其他客车-个体中型客运车辆客位数（按标记客位分）
    **/
    @JSONField(name="ys02010101140000000212010000")
    private Double ys02010101140000000212010000;

    /**
     *其他客车-小型客运车辆客位数（按标记客位分）
    **/
    @JSONField(name="ys02010101140000000213000000")
    private Double ys02010101140000000213000000;

    /**
     *其他客车-个体小型客运车辆客位数（按标记客位分）
    **/
    @JSONField(name="ys02010101140000000213010000")
    private Double ys02010101140000000213010000;

    /**
     *其他客车-特大型客运车辆客位数（按车长分）
    **/
    @JSONField(name="ys02010101140000000221000000")
    private Double ys02010101140000000221000000;

    /**
     *其他客车-大型客运车辆客位数（按车长分）
    **/
    @JSONField(name="ys02010101140000000222000000")
    private Double ys02010101140000000222000000;

    /**
     *其他客车-中型客运车辆客位数（按车长分）
    **/
    @JSONField(name="ys02010101140000000223000000")
    private Double ys02010101140000000223000000;

    /**
     *其他客车-小型客运车辆客位数（按车长分）
    **/
    @JSONField(name="ys02010101140000000224000000")
    private Double ys02010101140000000224000000;

    /**
     *其他客车-高级客运车辆客位数（按等级分）
    **/
    @JSONField(name="ys02010101140000000231000000")
    private Double ys02010101140000000231000000;

    /**
     *其他客车-中级客运车辆客位数（按等级分）
    **/
    @JSONField(name="ys02010101140000000232000000")
    private Double ys02010101140000000232000000;

    /**
     *其他客车-普通客运车辆客位数（按等级分）
    **/
    @JSONField(name="ys02010101140000000233000000")
    private Double ys02010101140000000233000000;

    @JSONField(name="ys02010101140100000100000000")
    private Double ys02010101140100000100000000;

    @JSONField(name="ys02010101140100000101000000")
    private Double ys02010101140100000101000000;

    @JSONField(name="ys02010101140100000102000000")
    private Double ys02010101140100000102000000;

    @JSONField(name="ys02010101140100000103000000")
    private Double ys02010101140100000103000000;

    @JSONField(name="ys02010101140100000111000000")
    private Double ys02010101140100000111000000;

    @JSONField(name="ys02010101140100000111010000")
    private Double ys02010101140100000111010000;

    @JSONField(name="ys02010101140100000112000000")
    private Double ys02010101140100000112000000;

    @JSONField(name="ys02010101140100000112010000")
    private Double ys02010101140100000112010000;

    @JSONField(name="ys02010101140100000113000000")
    private Double ys02010101140100000113000000;

    public String getRecid() {
        return recid;
    }

    public void setRecid(String recid) {
        this.recid = recid;
    }

    public Double getRecver() {
        return recver;
    }

    public void setRecver(Double recver) {
        this.recver = recver;
    }

    public String getUnitid() {
        return unitid;
    }

    public void setUnitid(String unitid) {
        this.unitid = unitid;
    }

    public String getDatatime() {
        return datatime;
    }

    public void setDatatime(String datatime) {
        this.datatime = datatime;
    }

    public Double getFloatorder() {
        return floatorder;
    }

    public void setFloatorder(Double floatorder) {
        this.floatorder = floatorder;
    }

    public Double getYs02010100000000000100000000() {
        return ys02010100000000000100000000;
    }

    public void setYs02010100000000000100000000(Double ys02010100000000000100000000) {
        this.ys02010100000000000100000000 = ys02010100000000000100000000;
    }

    public Double getYs02010100000000000101000000() {
        return ys02010100000000000101000000;
    }

    public void setYs02010100000000000101000000(Double ys02010100000000000101000000) {
        this.ys02010100000000000101000000 = ys02010100000000000101000000;
    }

    public Double getYs02010100000000000102000000() {
        return ys02010100000000000102000000;
    }

    public void setYs02010100000000000102000000(Double ys02010100000000000102000000) {
        this.ys02010100000000000102000000 = ys02010100000000000102000000;
    }

    public Double getYs02010100000000000103000000() {
        return ys02010100000000000103000000;
    }

    public void setYs02010100000000000103000000(Double ys02010100000000000103000000) {
        this.ys02010100000000000103000000 = ys02010100000000000103000000;
    }

    public Double getYs02010100000000000111000000() {
        return ys02010100000000000111000000;
    }

    public void setYs02010100000000000111000000(Double ys02010100000000000111000000) {
        this.ys02010100000000000111000000 = ys02010100000000000111000000;
    }

    public Double getYs02010100000000000111010000() {
        return ys02010100000000000111010000;
    }

    public void setYs02010100000000000111010000(Double ys02010100000000000111010000) {
        this.ys02010100000000000111010000 = ys02010100000000000111010000;
    }

    public Double getYs02010100000000000112000000() {
        return ys02010100000000000112000000;
    }

    public void setYs02010100000000000112000000(Double ys02010100000000000112000000) {
        this.ys02010100000000000112000000 = ys02010100000000000112000000;
    }

    public Double getYs02010100000000000112010000() {
        return ys02010100000000000112010000;
    }

    public void setYs02010100000000000112010000(Double ys02010100000000000112010000) {
        this.ys02010100000000000112010000 = ys02010100000000000112010000;
    }

    public Double getYs02010100000000000113000000() {
        return ys02010100000000000113000000;
    }

    public void setYs02010100000000000113000000(Double ys02010100000000000113000000) {
        this.ys02010100000000000113000000 = ys02010100000000000113000000;
    }

    public Double getYs02010100000000000113010000() {
        return ys02010100000000000113010000;
    }

    public void setYs02010100000000000113010000(Double ys02010100000000000113010000) {
        this.ys02010100000000000113010000 = ys02010100000000000113010000;
    }

    public Double getYs02010100000000000121000000() {
        return ys02010100000000000121000000;
    }

    public void setYs02010100000000000121000000(Double ys02010100000000000121000000) {
        this.ys02010100000000000121000000 = ys02010100000000000121000000;
    }

    public Double getYs02010100000000000122000000() {
        return ys02010100000000000122000000;
    }

    public void setYs02010100000000000122000000(Double ys02010100000000000122000000) {
        this.ys02010100000000000122000000 = ys02010100000000000122000000;
    }

    public Double getYs02010100000000000123000000() {
        return ys02010100000000000123000000;
    }

    public void setYs02010100000000000123000000(Double ys02010100000000000123000000) {
        this.ys02010100000000000123000000 = ys02010100000000000123000000;
    }

    public Double getYs02010100000000000124000000() {
        return ys02010100000000000124000000;
    }

    public void setYs02010100000000000124000000(Double ys02010100000000000124000000) {
        this.ys02010100000000000124000000 = ys02010100000000000124000000;
    }

    public Double getYs02010100000000000131000000() {
        return ys02010100000000000131000000;
    }

    public void setYs02010100000000000131000000(Double ys02010100000000000131000000) {
        this.ys02010100000000000131000000 = ys02010100000000000131000000;
    }

    public Double getYs02010100000000000132000000() {
        return ys02010100000000000132000000;
    }

    public void setYs02010100000000000132000000(Double ys02010100000000000132000000) {
        this.ys02010100000000000132000000 = ys02010100000000000132000000;
    }

    public Double getYs02010100000000000133000000() {
        return ys02010100000000000133000000;
    }

    public void setYs02010100000000000133000000(Double ys02010100000000000133000000) {
        this.ys02010100000000000133000000 = ys02010100000000000133000000;
    }

    public Double getYs02010100000000000200000000() {
        return ys02010100000000000200000000;
    }

    public void setYs02010100000000000200000000(Double ys02010100000000000200000000) {
        this.ys02010100000000000200000000 = ys02010100000000000200000000;
    }

    public Double getYs02010100000000000201000000() {
        return ys02010100000000000201000000;
    }

    public void setYs02010100000000000201000000(Double ys02010100000000000201000000) {
        this.ys02010100000000000201000000 = ys02010100000000000201000000;
    }

    public Double getYs02010100000000000202000000() {
        return ys02010100000000000202000000;
    }

    public void setYs02010100000000000202000000(Double ys02010100000000000202000000) {
        this.ys02010100000000000202000000 = ys02010100000000000202000000;
    }

    public Double getYs02010100000000000203000000() {
        return ys02010100000000000203000000;
    }

    public void setYs02010100000000000203000000(Double ys02010100000000000203000000) {
        this.ys02010100000000000203000000 = ys02010100000000000203000000;
    }

    public Double getYs02010100000000000211000000() {
        return ys02010100000000000211000000;
    }

    public void setYs02010100000000000211000000(Double ys02010100000000000211000000) {
        this.ys02010100000000000211000000 = ys02010100000000000211000000;
    }

    public Double getYs02010100000000000211010000() {
        return ys02010100000000000211010000;
    }

    public void setYs02010100000000000211010000(Double ys02010100000000000211010000) {
        this.ys02010100000000000211010000 = ys02010100000000000211010000;
    }

    public Double getYs02010100000000000212000000() {
        return ys02010100000000000212000000;
    }

    public void setYs02010100000000000212000000(Double ys02010100000000000212000000) {
        this.ys02010100000000000212000000 = ys02010100000000000212000000;
    }

    public Double getYs02010100000000000212010000() {
        return ys02010100000000000212010000;
    }

    public void setYs02010100000000000212010000(Double ys02010100000000000212010000) {
        this.ys02010100000000000212010000 = ys02010100000000000212010000;
    }

    public Double getYs02010100000000000213000000() {
        return ys02010100000000000213000000;
    }

    public void setYs02010100000000000213000000(Double ys02010100000000000213000000) {
        this.ys02010100000000000213000000 = ys02010100000000000213000000;
    }

    public Double getYs02010100000000000213010000() {
        return ys02010100000000000213010000;
    }

    public void setYs02010100000000000213010000(Double ys02010100000000000213010000) {
        this.ys02010100000000000213010000 = ys02010100000000000213010000;
    }

    public Double getYs02010100000000000221000000() {
        return ys02010100000000000221000000;
    }

    public void setYs02010100000000000221000000(Double ys02010100000000000221000000) {
        this.ys02010100000000000221000000 = ys02010100000000000221000000;
    }

    public Double getYs02010100000000000222000000() {
        return ys02010100000000000222000000;
    }

    public void setYs02010100000000000222000000(Double ys02010100000000000222000000) {
        this.ys02010100000000000222000000 = ys02010100000000000222000000;
    }

    public Double getYs02010100000000000223000000() {
        return ys02010100000000000223000000;
    }

    public void setYs02010100000000000223000000(Double ys02010100000000000223000000) {
        this.ys02010100000000000223000000 = ys02010100000000000223000000;
    }

    public Double getYs02010100000000000224000000() {
        return ys02010100000000000224000000;
    }

    public void setYs02010100000000000224000000(Double ys02010100000000000224000000) {
        this.ys02010100000000000224000000 = ys02010100000000000224000000;
    }

    public Double getYs02010100000000000231000000() {
        return ys02010100000000000231000000;
    }

    public void setYs02010100000000000231000000(Double ys02010100000000000231000000) {
        this.ys02010100000000000231000000 = ys02010100000000000231000000;
    }

    public Double getYs02010100000000000232000000() {
        return ys02010100000000000232000000;
    }

    public void setYs02010100000000000232000000(Double ys02010100000000000232000000) {
        this.ys02010100000000000232000000 = ys02010100000000000232000000;
    }

    public Double getYs02010100000000000233000000() {
        return ys02010100000000000233000000;
    }

    public void setYs02010100000000000233000000(Double ys02010100000000000233000000) {
        this.ys02010100000000000233000000 = ys02010100000000000233000000;
    }

    public Double getYs02010101000000000100000000() {
        return ys02010101000000000100000000;
    }

    public void setYs02010101000000000100000000(Double ys02010101000000000100000000) {
        this.ys02010101000000000100000000 = ys02010101000000000100000000;
    }

    public Double getYs02010101000000000101000000() {
        return ys02010101000000000101000000;
    }

    public void setYs02010101000000000101000000(Double ys02010101000000000101000000) {
        this.ys02010101000000000101000000 = ys02010101000000000101000000;
    }

    public Double getYs02010101000000000102000000() {
        return ys02010101000000000102000000;
    }

    public void setYs02010101000000000102000000(Double ys02010101000000000102000000) {
        this.ys02010101000000000102000000 = ys02010101000000000102000000;
    }

    public Double getYs02010101000000000103000000() {
        return ys02010101000000000103000000;
    }

    public void setYs02010101000000000103000000(Double ys02010101000000000103000000) {
        this.ys02010101000000000103000000 = ys02010101000000000103000000;
    }

    public Double getYs02010101000000000111000000() {
        return ys02010101000000000111000000;
    }

    public void setYs02010101000000000111000000(Double ys02010101000000000111000000) {
        this.ys02010101000000000111000000 = ys02010101000000000111000000;
    }

    public Double getYs02010101000000000111010000() {
        return ys02010101000000000111010000;
    }

    public void setYs02010101000000000111010000(Double ys02010101000000000111010000) {
        this.ys02010101000000000111010000 = ys02010101000000000111010000;
    }

    public Double getYs02010101000000000112000000() {
        return ys02010101000000000112000000;
    }

    public void setYs02010101000000000112000000(Double ys02010101000000000112000000) {
        this.ys02010101000000000112000000 = ys02010101000000000112000000;
    }

    public Double getYs02010101000000000112010000() {
        return ys02010101000000000112010000;
    }

    public void setYs02010101000000000112010000(Double ys02010101000000000112010000) {
        this.ys02010101000000000112010000 = ys02010101000000000112010000;
    }

    public Double getYs02010101000000000113000000() {
        return ys02010101000000000113000000;
    }

    public void setYs02010101000000000113000000(Double ys02010101000000000113000000) {
        this.ys02010101000000000113000000 = ys02010101000000000113000000;
    }

    public Double getYs02010101000000000113010000() {
        return ys02010101000000000113010000;
    }

    public void setYs02010101000000000113010000(Double ys02010101000000000113010000) {
        this.ys02010101000000000113010000 = ys02010101000000000113010000;
    }

    public Double getYs02010101000000000121000000() {
        return ys02010101000000000121000000;
    }

    public void setYs02010101000000000121000000(Double ys02010101000000000121000000) {
        this.ys02010101000000000121000000 = ys02010101000000000121000000;
    }

    public Double getYs02010101000000000122000000() {
        return ys02010101000000000122000000;
    }

    public void setYs02010101000000000122000000(Double ys02010101000000000122000000) {
        this.ys02010101000000000122000000 = ys02010101000000000122000000;
    }

    public Double getYs02010101000000000123000000() {
        return ys02010101000000000123000000;
    }

    public void setYs02010101000000000123000000(Double ys02010101000000000123000000) {
        this.ys02010101000000000123000000 = ys02010101000000000123000000;
    }

    public Double getYs02010101000000000124000000() {
        return ys02010101000000000124000000;
    }

    public void setYs02010101000000000124000000(Double ys02010101000000000124000000) {
        this.ys02010101000000000124000000 = ys02010101000000000124000000;
    }

    public Double getYs02010101000000000131000000() {
        return ys02010101000000000131000000;
    }

    public void setYs02010101000000000131000000(Double ys02010101000000000131000000) {
        this.ys02010101000000000131000000 = ys02010101000000000131000000;
    }

    public Double getYs02010101000000000132000000() {
        return ys02010101000000000132000000;
    }

    public void setYs02010101000000000132000000(Double ys02010101000000000132000000) {
        this.ys02010101000000000132000000 = ys02010101000000000132000000;
    }

    public Double getYs02010101000000000133000000() {
        return ys02010101000000000133000000;
    }

    public void setYs02010101000000000133000000(Double ys02010101000000000133000000) {
        this.ys02010101000000000133000000 = ys02010101000000000133000000;
    }

    public Double getYs02010101000000000200000000() {
        return ys02010101000000000200000000;
    }

    public void setYs02010101000000000200000000(Double ys02010101000000000200000000) {
        this.ys02010101000000000200000000 = ys02010101000000000200000000;
    }

    public Double getYs02010101000000000201000000() {
        return ys02010101000000000201000000;
    }

    public void setYs02010101000000000201000000(Double ys02010101000000000201000000) {
        this.ys02010101000000000201000000 = ys02010101000000000201000000;
    }

    public Double getYs02010101000000000202000000() {
        return ys02010101000000000202000000;
    }

    public void setYs02010101000000000202000000(Double ys02010101000000000202000000) {
        this.ys02010101000000000202000000 = ys02010101000000000202000000;
    }

    public Double getYs02010101000000000203000000() {
        return ys02010101000000000203000000;
    }

    public void setYs02010101000000000203000000(Double ys02010101000000000203000000) {
        this.ys02010101000000000203000000 = ys02010101000000000203000000;
    }

    public Double getYs02010101000000000211000000() {
        return ys02010101000000000211000000;
    }

    public void setYs02010101000000000211000000(Double ys02010101000000000211000000) {
        this.ys02010101000000000211000000 = ys02010101000000000211000000;
    }

    public Double getYs02010101000000000211010000() {
        return ys02010101000000000211010000;
    }

    public void setYs02010101000000000211010000(Double ys02010101000000000211010000) {
        this.ys02010101000000000211010000 = ys02010101000000000211010000;
    }

    public Double getYs02010101000000000212000000() {
        return ys02010101000000000212000000;
    }

    public void setYs02010101000000000212000000(Double ys02010101000000000212000000) {
        this.ys02010101000000000212000000 = ys02010101000000000212000000;
    }

    public Double getYs02010101000000000212010000() {
        return ys02010101000000000212010000;
    }

    public void setYs02010101000000000212010000(Double ys02010101000000000212010000) {
        this.ys02010101000000000212010000 = ys02010101000000000212010000;
    }

    public Double getYs02010101000000000213000000() {
        return ys02010101000000000213000000;
    }

    public void setYs02010101000000000213000000(Double ys02010101000000000213000000) {
        this.ys02010101000000000213000000 = ys02010101000000000213000000;
    }

    public Double getYs02010101000000000213010000() {
        return ys02010101000000000213010000;
    }

    public void setYs02010101000000000213010000(Double ys02010101000000000213010000) {
        this.ys02010101000000000213010000 = ys02010101000000000213010000;
    }

    public Double getYs02010101000000000221000000() {
        return ys02010101000000000221000000;
    }

    public void setYs02010101000000000221000000(Double ys02010101000000000221000000) {
        this.ys02010101000000000221000000 = ys02010101000000000221000000;
    }

    public Double getYs02010101000000000222000000() {
        return ys02010101000000000222000000;
    }

    public void setYs02010101000000000222000000(Double ys02010101000000000222000000) {
        this.ys02010101000000000222000000 = ys02010101000000000222000000;
    }

    public Double getYs02010101000000000223000000() {
        return ys02010101000000000223000000;
    }

    public void setYs02010101000000000223000000(Double ys02010101000000000223000000) {
        this.ys02010101000000000223000000 = ys02010101000000000223000000;
    }

    public Double getYs02010101000000000224000000() {
        return ys02010101000000000224000000;
    }

    public void setYs02010101000000000224000000(Double ys02010101000000000224000000) {
        this.ys02010101000000000224000000 = ys02010101000000000224000000;
    }

    public Double getYs02010101000000000231000000() {
        return ys02010101000000000231000000;
    }

    public void setYs02010101000000000231000000(Double ys02010101000000000231000000) {
        this.ys02010101000000000231000000 = ys02010101000000000231000000;
    }

    public Double getYs02010101000000000232000000() {
        return ys02010101000000000232000000;
    }

    public void setYs02010101000000000232000000(Double ys02010101000000000232000000) {
        this.ys02010101000000000232000000 = ys02010101000000000232000000;
    }

    public Double getYs02010101000000000233000000() {
        return ys02010101000000000233000000;
    }

    public void setYs02010101000000000233000000(Double ys02010101000000000233000000) {
        this.ys02010101000000000233000000 = ys02010101000000000233000000;
    }

    public Double getYs02010101010000000100000000() {
        return ys02010101010000000100000000;
    }

    public void setYs02010101010000000100000000(Double ys02010101010000000100000000) {
        this.ys02010101010000000100000000 = ys02010101010000000100000000;
    }

    public Double getYs02010101010000000101000000() {
        return ys02010101010000000101000000;
    }

    public void setYs02010101010000000101000000(Double ys02010101010000000101000000) {
        this.ys02010101010000000101000000 = ys02010101010000000101000000;
    }

    public Double getYs02010101010000000102000000() {
        return ys02010101010000000102000000;
    }

    public void setYs02010101010000000102000000(Double ys02010101010000000102000000) {
        this.ys02010101010000000102000000 = ys02010101010000000102000000;
    }

    public Double getYs02010101010000000103000000() {
        return ys02010101010000000103000000;
    }

    public void setYs02010101010000000103000000(Double ys02010101010000000103000000) {
        this.ys02010101010000000103000000 = ys02010101010000000103000000;
    }

    public Double getYs02010101010000000111000000() {
        return ys02010101010000000111000000;
    }

    public void setYs02010101010000000111000000(Double ys02010101010000000111000000) {
        this.ys02010101010000000111000000 = ys02010101010000000111000000;
    }

    public Double getYs02010101010000000111010000() {
        return ys02010101010000000111010000;
    }

    public void setYs02010101010000000111010000(Double ys02010101010000000111010000) {
        this.ys02010101010000000111010000 = ys02010101010000000111010000;
    }

    public Double getYs02010101010000000112000000() {
        return ys02010101010000000112000000;
    }

    public void setYs02010101010000000112000000(Double ys02010101010000000112000000) {
        this.ys02010101010000000112000000 = ys02010101010000000112000000;
    }

    public Double getYs02010101010000000112010000() {
        return ys02010101010000000112010000;
    }

    public void setYs02010101010000000112010000(Double ys02010101010000000112010000) {
        this.ys02010101010000000112010000 = ys02010101010000000112010000;
    }

    public Double getYs02010101010000000113000000() {
        return ys02010101010000000113000000;
    }

    public void setYs02010101010000000113000000(Double ys02010101010000000113000000) {
        this.ys02010101010000000113000000 = ys02010101010000000113000000;
    }

    public Double getYs02010101010000000113010000() {
        return ys02010101010000000113010000;
    }

    public void setYs02010101010000000113010000(Double ys02010101010000000113010000) {
        this.ys02010101010000000113010000 = ys02010101010000000113010000;
    }

    public Double getYs02010101010000000121000000() {
        return ys02010101010000000121000000;
    }

    public void setYs02010101010000000121000000(Double ys02010101010000000121000000) {
        this.ys02010101010000000121000000 = ys02010101010000000121000000;
    }

    public Double getYs02010101010000000122000000() {
        return ys02010101010000000122000000;
    }

    public void setYs02010101010000000122000000(Double ys02010101010000000122000000) {
        this.ys02010101010000000122000000 = ys02010101010000000122000000;
    }

    public Double getYs02010101010000000123000000() {
        return ys02010101010000000123000000;
    }

    public void setYs02010101010000000123000000(Double ys02010101010000000123000000) {
        this.ys02010101010000000123000000 = ys02010101010000000123000000;
    }

    public Double getYs02010101010000000124000000() {
        return ys02010101010000000124000000;
    }

    public void setYs02010101010000000124000000(Double ys02010101010000000124000000) {
        this.ys02010101010000000124000000 = ys02010101010000000124000000;
    }

    public Double getYs02010101010000000131000000() {
        return ys02010101010000000131000000;
    }

    public void setYs02010101010000000131000000(Double ys02010101010000000131000000) {
        this.ys02010101010000000131000000 = ys02010101010000000131000000;
    }

    public Double getYs02010101010000000132000000() {
        return ys02010101010000000132000000;
    }

    public void setYs02010101010000000132000000(Double ys02010101010000000132000000) {
        this.ys02010101010000000132000000 = ys02010101010000000132000000;
    }

    public Double getYs02010101010000000133000000() {
        return ys02010101010000000133000000;
    }

    public void setYs02010101010000000133000000(Double ys02010101010000000133000000) {
        this.ys02010101010000000133000000 = ys02010101010000000133000000;
    }

    public Double getYs02010101010000000200000000() {
        return ys02010101010000000200000000;
    }

    public void setYs02010101010000000200000000(Double ys02010101010000000200000000) {
        this.ys02010101010000000200000000 = ys02010101010000000200000000;
    }

    public Double getYs02010101010000000201000000() {
        return ys02010101010000000201000000;
    }

    public void setYs02010101010000000201000000(Double ys02010101010000000201000000) {
        this.ys02010101010000000201000000 = ys02010101010000000201000000;
    }

    public Double getYs02010101010000000202000000() {
        return ys02010101010000000202000000;
    }

    public void setYs02010101010000000202000000(Double ys02010101010000000202000000) {
        this.ys02010101010000000202000000 = ys02010101010000000202000000;
    }

    public Double getYs02010101010000000203000000() {
        return ys02010101010000000203000000;
    }

    public void setYs02010101010000000203000000(Double ys02010101010000000203000000) {
        this.ys02010101010000000203000000 = ys02010101010000000203000000;
    }

    public Double getYs02010101010000000211000000() {
        return ys02010101010000000211000000;
    }

    public void setYs02010101010000000211000000(Double ys02010101010000000211000000) {
        this.ys02010101010000000211000000 = ys02010101010000000211000000;
    }

    public Double getYs02010101010000000211010000() {
        return ys02010101010000000211010000;
    }

    public void setYs02010101010000000211010000(Double ys02010101010000000211010000) {
        this.ys02010101010000000211010000 = ys02010101010000000211010000;
    }

    public Double getYs02010101010000000212000000() {
        return ys02010101010000000212000000;
    }

    public void setYs02010101010000000212000000(Double ys02010101010000000212000000) {
        this.ys02010101010000000212000000 = ys02010101010000000212000000;
    }

    public Double getYs02010101010000000212010000() {
        return ys02010101010000000212010000;
    }

    public void setYs02010101010000000212010000(Double ys02010101010000000212010000) {
        this.ys02010101010000000212010000 = ys02010101010000000212010000;
    }

    public Double getYs02010101010000000213000000() {
        return ys02010101010000000213000000;
    }

    public void setYs02010101010000000213000000(Double ys02010101010000000213000000) {
        this.ys02010101010000000213000000 = ys02010101010000000213000000;
    }

    public Double getYs02010101010000000213010000() {
        return ys02010101010000000213010000;
    }

    public void setYs02010101010000000213010000(Double ys02010101010000000213010000) {
        this.ys02010101010000000213010000 = ys02010101010000000213010000;
    }

    public Double getYs02010101010000000221000000() {
        return ys02010101010000000221000000;
    }

    public void setYs02010101010000000221000000(Double ys02010101010000000221000000) {
        this.ys02010101010000000221000000 = ys02010101010000000221000000;
    }

    public Double getYs02010101010000000222000000() {
        return ys02010101010000000222000000;
    }

    public void setYs02010101010000000222000000(Double ys02010101010000000222000000) {
        this.ys02010101010000000222000000 = ys02010101010000000222000000;
    }

    public Double getYs02010101010000000223000000() {
        return ys02010101010000000223000000;
    }

    public void setYs02010101010000000223000000(Double ys02010101010000000223000000) {
        this.ys02010101010000000223000000 = ys02010101010000000223000000;
    }

    public Double getYs02010101010000000224000000() {
        return ys02010101010000000224000000;
    }

    public void setYs02010101010000000224000000(Double ys02010101010000000224000000) {
        this.ys02010101010000000224000000 = ys02010101010000000224000000;
    }

    public Double getYs02010101010000000231000000() {
        return ys02010101010000000231000000;
    }

    public void setYs02010101010000000231000000(Double ys02010101010000000231000000) {
        this.ys02010101010000000231000000 = ys02010101010000000231000000;
    }

    public Double getYs02010101010000000232000000() {
        return ys02010101010000000232000000;
    }

    public void setYs02010101010000000232000000(Double ys02010101010000000232000000) {
        this.ys02010101010000000232000000 = ys02010101010000000232000000;
    }

    public Double getYs02010101010000000233000000() {
        return ys02010101010000000233000000;
    }

    public void setYs02010101010000000233000000(Double ys02010101010000000233000000) {
        this.ys02010101010000000233000000 = ys02010101010000000233000000;
    }

    public Double getYs02010101110000000100000000() {
        return ys02010101110000000100000000;
    }

    public void setYs02010101110000000100000000(Double ys02010101110000000100000000) {
        this.ys02010101110000000100000000 = ys02010101110000000100000000;
    }

    public Double getYs02010101110000000101000000() {
        return ys02010101110000000101000000;
    }

    public void setYs02010101110000000101000000(Double ys02010101110000000101000000) {
        this.ys02010101110000000101000000 = ys02010101110000000101000000;
    }

    public Double getYs02010101110000000102000000() {
        return ys02010101110000000102000000;
    }

    public void setYs02010101110000000102000000(Double ys02010101110000000102000000) {
        this.ys02010101110000000102000000 = ys02010101110000000102000000;
    }

    public Double getYs02010101110000000103000000() {
        return ys02010101110000000103000000;
    }

    public void setYs02010101110000000103000000(Double ys02010101110000000103000000) {
        this.ys02010101110000000103000000 = ys02010101110000000103000000;
    }

    public Double getYs02010101110000000111000000() {
        return ys02010101110000000111000000;
    }

    public void setYs02010101110000000111000000(Double ys02010101110000000111000000) {
        this.ys02010101110000000111000000 = ys02010101110000000111000000;
    }

    public Double getYs02010101110000000111010000() {
        return ys02010101110000000111010000;
    }

    public void setYs02010101110000000111010000(Double ys02010101110000000111010000) {
        this.ys02010101110000000111010000 = ys02010101110000000111010000;
    }

    public Double getYs02010101110000000112000000() {
        return ys02010101110000000112000000;
    }

    public void setYs02010101110000000112000000(Double ys02010101110000000112000000) {
        this.ys02010101110000000112000000 = ys02010101110000000112000000;
    }

    public Double getYs02010101110000000112010000() {
        return ys02010101110000000112010000;
    }

    public void setYs02010101110000000112010000(Double ys02010101110000000112010000) {
        this.ys02010101110000000112010000 = ys02010101110000000112010000;
    }

    public Double getYs02010101110000000113000000() {
        return ys02010101110000000113000000;
    }

    public void setYs02010101110000000113000000(Double ys02010101110000000113000000) {
        this.ys02010101110000000113000000 = ys02010101110000000113000000;
    }

    public Double getYs02010101110000000113010000() {
        return ys02010101110000000113010000;
    }

    public void setYs02010101110000000113010000(Double ys02010101110000000113010000) {
        this.ys02010101110000000113010000 = ys02010101110000000113010000;
    }

    public Double getYs02010101110000000121000000() {
        return ys02010101110000000121000000;
    }

    public void setYs02010101110000000121000000(Double ys02010101110000000121000000) {
        this.ys02010101110000000121000000 = ys02010101110000000121000000;
    }

    public Double getYs02010101110000000122000000() {
        return ys02010101110000000122000000;
    }

    public void setYs02010101110000000122000000(Double ys02010101110000000122000000) {
        this.ys02010101110000000122000000 = ys02010101110000000122000000;
    }

    public Double getYs02010101110000000123000000() {
        return ys02010101110000000123000000;
    }

    public void setYs02010101110000000123000000(Double ys02010101110000000123000000) {
        this.ys02010101110000000123000000 = ys02010101110000000123000000;
    }

    public Double getYs02010101110000000124000000() {
        return ys02010101110000000124000000;
    }

    public void setYs02010101110000000124000000(Double ys02010101110000000124000000) {
        this.ys02010101110000000124000000 = ys02010101110000000124000000;
    }

    public Double getYs02010101110000000131000000() {
        return ys02010101110000000131000000;
    }

    public void setYs02010101110000000131000000(Double ys02010101110000000131000000) {
        this.ys02010101110000000131000000 = ys02010101110000000131000000;
    }

    public Double getYs02010101110000000132000000() {
        return ys02010101110000000132000000;
    }

    public void setYs02010101110000000132000000(Double ys02010101110000000132000000) {
        this.ys02010101110000000132000000 = ys02010101110000000132000000;
    }

    public Double getYs02010101110000000133000000() {
        return ys02010101110000000133000000;
    }

    public void setYs02010101110000000133000000(Double ys02010101110000000133000000) {
        this.ys02010101110000000133000000 = ys02010101110000000133000000;
    }

    public Double getYs02010101110000000200000000() {
        return ys02010101110000000200000000;
    }

    public void setYs02010101110000000200000000(Double ys02010101110000000200000000) {
        this.ys02010101110000000200000000 = ys02010101110000000200000000;
    }

    public Double getYs02010101110000000201000000() {
        return ys02010101110000000201000000;
    }

    public void setYs02010101110000000201000000(Double ys02010101110000000201000000) {
        this.ys02010101110000000201000000 = ys02010101110000000201000000;
    }

    public Double getYs02010101110000000202000000() {
        return ys02010101110000000202000000;
    }

    public void setYs02010101110000000202000000(Double ys02010101110000000202000000) {
        this.ys02010101110000000202000000 = ys02010101110000000202000000;
    }

    public Double getYs02010101110000000203000000() {
        return ys02010101110000000203000000;
    }

    public void setYs02010101110000000203000000(Double ys02010101110000000203000000) {
        this.ys02010101110000000203000000 = ys02010101110000000203000000;
    }

    public Double getYs02010101110000000211000000() {
        return ys02010101110000000211000000;
    }

    public void setYs02010101110000000211000000(Double ys02010101110000000211000000) {
        this.ys02010101110000000211000000 = ys02010101110000000211000000;
    }

    public Double getYs02010101110000000211010000() {
        return ys02010101110000000211010000;
    }

    public void setYs02010101110000000211010000(Double ys02010101110000000211010000) {
        this.ys02010101110000000211010000 = ys02010101110000000211010000;
    }

    public Double getYs02010101110000000212000000() {
        return ys02010101110000000212000000;
    }

    public void setYs02010101110000000212000000(Double ys02010101110000000212000000) {
        this.ys02010101110000000212000000 = ys02010101110000000212000000;
    }

    public Double getYs02010101110000000212010000() {
        return ys02010101110000000212010000;
    }

    public void setYs02010101110000000212010000(Double ys02010101110000000212010000) {
        this.ys02010101110000000212010000 = ys02010101110000000212010000;
    }

    public Double getYs02010101110000000213000000() {
        return ys02010101110000000213000000;
    }

    public void setYs02010101110000000213000000(Double ys02010101110000000213000000) {
        this.ys02010101110000000213000000 = ys02010101110000000213000000;
    }

    public Double getYs02010101110000000213010000() {
        return ys02010101110000000213010000;
    }

    public void setYs02010101110000000213010000(Double ys02010101110000000213010000) {
        this.ys02010101110000000213010000 = ys02010101110000000213010000;
    }

    public Double getYs02010101110000000221000000() {
        return ys02010101110000000221000000;
    }

    public void setYs02010101110000000221000000(Double ys02010101110000000221000000) {
        this.ys02010101110000000221000000 = ys02010101110000000221000000;
    }

    public Double getYs02010101110000000222000000() {
        return ys02010101110000000222000000;
    }

    public void setYs02010101110000000222000000(Double ys02010101110000000222000000) {
        this.ys02010101110000000222000000 = ys02010101110000000222000000;
    }

    public Double getYs02010101110000000223000000() {
        return ys02010101110000000223000000;
    }

    public void setYs02010101110000000223000000(Double ys02010101110000000223000000) {
        this.ys02010101110000000223000000 = ys02010101110000000223000000;
    }

    public Double getYs02010101110000000224000000() {
        return ys02010101110000000224000000;
    }

    public void setYs02010101110000000224000000(Double ys02010101110000000224000000) {
        this.ys02010101110000000224000000 = ys02010101110000000224000000;
    }

    public Double getYs02010101110000000231000000() {
        return ys02010101110000000231000000;
    }

    public void setYs02010101110000000231000000(Double ys02010101110000000231000000) {
        this.ys02010101110000000231000000 = ys02010101110000000231000000;
    }

    public Double getYs02010101110000000232000000() {
        return ys02010101110000000232000000;
    }

    public void setYs02010101110000000232000000(Double ys02010101110000000232000000) {
        this.ys02010101110000000232000000 = ys02010101110000000232000000;
    }

    public Double getYs02010101110000000233000000() {
        return ys02010101110000000233000000;
    }

    public void setYs02010101110000000233000000(Double ys02010101110000000233000000) {
        this.ys02010101110000000233000000 = ys02010101110000000233000000;
    }

    public Double getYs02010101120000000100000000() {
        return ys02010101120000000100000000;
    }

    public void setYs02010101120000000100000000(Double ys02010101120000000100000000) {
        this.ys02010101120000000100000000 = ys02010101120000000100000000;
    }

    public Double getYs02010101120000000101000000() {
        return ys02010101120000000101000000;
    }

    public void setYs02010101120000000101000000(Double ys02010101120000000101000000) {
        this.ys02010101120000000101000000 = ys02010101120000000101000000;
    }

    public Double getYs02010101120000000102000000() {
        return ys02010101120000000102000000;
    }

    public void setYs02010101120000000102000000(Double ys02010101120000000102000000) {
        this.ys02010101120000000102000000 = ys02010101120000000102000000;
    }

    public Double getYs02010101120000000103000000() {
        return ys02010101120000000103000000;
    }

    public void setYs02010101120000000103000000(Double ys02010101120000000103000000) {
        this.ys02010101120000000103000000 = ys02010101120000000103000000;
    }

    public Double getYs02010101120000000111000000() {
        return ys02010101120000000111000000;
    }

    public void setYs02010101120000000111000000(Double ys02010101120000000111000000) {
        this.ys02010101120000000111000000 = ys02010101120000000111000000;
    }

    public Double getYs02010101120000000111010000() {
        return ys02010101120000000111010000;
    }

    public void setYs02010101120000000111010000(Double ys02010101120000000111010000) {
        this.ys02010101120000000111010000 = ys02010101120000000111010000;
    }

    public Double getYs02010101120000000112000000() {
        return ys02010101120000000112000000;
    }

    public void setYs02010101120000000112000000(Double ys02010101120000000112000000) {
        this.ys02010101120000000112000000 = ys02010101120000000112000000;
    }

    public Double getYs02010101120000000112010000() {
        return ys02010101120000000112010000;
    }

    public void setYs02010101120000000112010000(Double ys02010101120000000112010000) {
        this.ys02010101120000000112010000 = ys02010101120000000112010000;
    }

    public Double getYs02010101120000000113000000() {
        return ys02010101120000000113000000;
    }

    public void setYs02010101120000000113000000(Double ys02010101120000000113000000) {
        this.ys02010101120000000113000000 = ys02010101120000000113000000;
    }

    public Double getYs02010101120000000113010000() {
        return ys02010101120000000113010000;
    }

    public void setYs02010101120000000113010000(Double ys02010101120000000113010000) {
        this.ys02010101120000000113010000 = ys02010101120000000113010000;
    }

    public Double getYs02010101120000000121000000() {
        return ys02010101120000000121000000;
    }

    public void setYs02010101120000000121000000(Double ys02010101120000000121000000) {
        this.ys02010101120000000121000000 = ys02010101120000000121000000;
    }

    public Double getYs02010101120000000122000000() {
        return ys02010101120000000122000000;
    }

    public void setYs02010101120000000122000000(Double ys02010101120000000122000000) {
        this.ys02010101120000000122000000 = ys02010101120000000122000000;
    }

    public Double getYs02010101120000000123000000() {
        return ys02010101120000000123000000;
    }

    public void setYs02010101120000000123000000(Double ys02010101120000000123000000) {
        this.ys02010101120000000123000000 = ys02010101120000000123000000;
    }

    public Double getYs02010101120000000124000000() {
        return ys02010101120000000124000000;
    }

    public void setYs02010101120000000124000000(Double ys02010101120000000124000000) {
        this.ys02010101120000000124000000 = ys02010101120000000124000000;
    }

    public Double getYs02010101120000000131000000() {
        return ys02010101120000000131000000;
    }

    public void setYs02010101120000000131000000(Double ys02010101120000000131000000) {
        this.ys02010101120000000131000000 = ys02010101120000000131000000;
    }

    public Double getYs02010101120000000132000000() {
        return ys02010101120000000132000000;
    }

    public void setYs02010101120000000132000000(Double ys02010101120000000132000000) {
        this.ys02010101120000000132000000 = ys02010101120000000132000000;
    }

    public Double getYs02010101120000000133000000() {
        return ys02010101120000000133000000;
    }

    public void setYs02010101120000000133000000(Double ys02010101120000000133000000) {
        this.ys02010101120000000133000000 = ys02010101120000000133000000;
    }

    public Double getYs02010101120000000200000000() {
        return ys02010101120000000200000000;
    }

    public void setYs02010101120000000200000000(Double ys02010101120000000200000000) {
        this.ys02010101120000000200000000 = ys02010101120000000200000000;
    }

    public Double getYs02010101120000000201000000() {
        return ys02010101120000000201000000;
    }

    public void setYs02010101120000000201000000(Double ys02010101120000000201000000) {
        this.ys02010101120000000201000000 = ys02010101120000000201000000;
    }

    public Double getYs02010101120000000202000000() {
        return ys02010101120000000202000000;
    }

    public void setYs02010101120000000202000000(Double ys02010101120000000202000000) {
        this.ys02010101120000000202000000 = ys02010101120000000202000000;
    }

    public Double getYs02010101120000000203000000() {
        return ys02010101120000000203000000;
    }

    public void setYs02010101120000000203000000(Double ys02010101120000000203000000) {
        this.ys02010101120000000203000000 = ys02010101120000000203000000;
    }

    public Double getYs02010101120000000211000000() {
        return ys02010101120000000211000000;
    }

    public void setYs02010101120000000211000000(Double ys02010101120000000211000000) {
        this.ys02010101120000000211000000 = ys02010101120000000211000000;
    }

    public Double getYs02010101120000000211010000() {
        return ys02010101120000000211010000;
    }

    public void setYs02010101120000000211010000(Double ys02010101120000000211010000) {
        this.ys02010101120000000211010000 = ys02010101120000000211010000;
    }

    public Double getYs02010101120000000212000000() {
        return ys02010101120000000212000000;
    }

    public void setYs02010101120000000212000000(Double ys02010101120000000212000000) {
        this.ys02010101120000000212000000 = ys02010101120000000212000000;
    }

    public Double getYs02010101120000000212010000() {
        return ys02010101120000000212010000;
    }

    public void setYs02010101120000000212010000(Double ys02010101120000000212010000) {
        this.ys02010101120000000212010000 = ys02010101120000000212010000;
    }

    public Double getYs02010101120000000213000000() {
        return ys02010101120000000213000000;
    }

    public void setYs02010101120000000213000000(Double ys02010101120000000213000000) {
        this.ys02010101120000000213000000 = ys02010101120000000213000000;
    }

    public Double getYs02010101120000000213010000() {
        return ys02010101120000000213010000;
    }

    public void setYs02010101120000000213010000(Double ys02010101120000000213010000) {
        this.ys02010101120000000213010000 = ys02010101120000000213010000;
    }

    public Double getYs02010101120000000221000000() {
        return ys02010101120000000221000000;
    }

    public void setYs02010101120000000221000000(Double ys02010101120000000221000000) {
        this.ys02010101120000000221000000 = ys02010101120000000221000000;
    }

    public Double getYs02010101120000000222000000() {
        return ys02010101120000000222000000;
    }

    public void setYs02010101120000000222000000(Double ys02010101120000000222000000) {
        this.ys02010101120000000222000000 = ys02010101120000000222000000;
    }

    public Double getYs02010101120000000223000000() {
        return ys02010101120000000223000000;
    }

    public void setYs02010101120000000223000000(Double ys02010101120000000223000000) {
        this.ys02010101120000000223000000 = ys02010101120000000223000000;
    }

    public Double getYs02010101120000000224000000() {
        return ys02010101120000000224000000;
    }

    public void setYs02010101120000000224000000(Double ys02010101120000000224000000) {
        this.ys02010101120000000224000000 = ys02010101120000000224000000;
    }

    public Double getYs02010101120000000231000000() {
        return ys02010101120000000231000000;
    }

    public void setYs02010101120000000231000000(Double ys02010101120000000231000000) {
        this.ys02010101120000000231000000 = ys02010101120000000231000000;
    }

    public Double getYs02010101120000000232000000() {
        return ys02010101120000000232000000;
    }

    public void setYs02010101120000000232000000(Double ys02010101120000000232000000) {
        this.ys02010101120000000232000000 = ys02010101120000000232000000;
    }

    public Double getYs02010101120000000233000000() {
        return ys02010101120000000233000000;
    }

    public void setYs02010101120000000233000000(Double ys02010101120000000233000000) {
        this.ys02010101120000000233000000 = ys02010101120000000233000000;
    }

    public Double getYs02010101130000000100000000() {
        return ys02010101130000000100000000;
    }

    public void setYs02010101130000000100000000(Double ys02010101130000000100000000) {
        this.ys02010101130000000100000000 = ys02010101130000000100000000;
    }

    public Double getYs02010101130000000101000000() {
        return ys02010101130000000101000000;
    }

    public void setYs02010101130000000101000000(Double ys02010101130000000101000000) {
        this.ys02010101130000000101000000 = ys02010101130000000101000000;
    }

    public Double getYs02010101130000000102000000() {
        return ys02010101130000000102000000;
    }

    public void setYs02010101130000000102000000(Double ys02010101130000000102000000) {
        this.ys02010101130000000102000000 = ys02010101130000000102000000;
    }

    public Double getYs02010101130000000103000000() {
        return ys02010101130000000103000000;
    }

    public void setYs02010101130000000103000000(Double ys02010101130000000103000000) {
        this.ys02010101130000000103000000 = ys02010101130000000103000000;
    }

    public Double getYs02010101130000000111000000() {
        return ys02010101130000000111000000;
    }

    public void setYs02010101130000000111000000(Double ys02010101130000000111000000) {
        this.ys02010101130000000111000000 = ys02010101130000000111000000;
    }

    public Double getYs02010101130000000111010000() {
        return ys02010101130000000111010000;
    }

    public void setYs02010101130000000111010000(Double ys02010101130000000111010000) {
        this.ys02010101130000000111010000 = ys02010101130000000111010000;
    }

    public Double getYs02010101130000000112000000() {
        return ys02010101130000000112000000;
    }

    public void setYs02010101130000000112000000(Double ys02010101130000000112000000) {
        this.ys02010101130000000112000000 = ys02010101130000000112000000;
    }

    public Double getYs02010101130000000112010000() {
        return ys02010101130000000112010000;
    }

    public void setYs02010101130000000112010000(Double ys02010101130000000112010000) {
        this.ys02010101130000000112010000 = ys02010101130000000112010000;
    }

    public Double getYs02010101130000000113000000() {
        return ys02010101130000000113000000;
    }

    public void setYs02010101130000000113000000(Double ys02010101130000000113000000) {
        this.ys02010101130000000113000000 = ys02010101130000000113000000;
    }

    public Double getYs02010101130000000113010000() {
        return ys02010101130000000113010000;
    }

    public void setYs02010101130000000113010000(Double ys02010101130000000113010000) {
        this.ys02010101130000000113010000 = ys02010101130000000113010000;
    }

    public Double getYs02010101130000000121000000() {
        return ys02010101130000000121000000;
    }

    public void setYs02010101130000000121000000(Double ys02010101130000000121000000) {
        this.ys02010101130000000121000000 = ys02010101130000000121000000;
    }

    public Double getYs02010101130000000122000000() {
        return ys02010101130000000122000000;
    }

    public void setYs02010101130000000122000000(Double ys02010101130000000122000000) {
        this.ys02010101130000000122000000 = ys02010101130000000122000000;
    }

    public Double getYs02010101130000000123000000() {
        return ys02010101130000000123000000;
    }

    public void setYs02010101130000000123000000(Double ys02010101130000000123000000) {
        this.ys02010101130000000123000000 = ys02010101130000000123000000;
    }

    public Double getYs02010101130000000124000000() {
        return ys02010101130000000124000000;
    }

    public void setYs02010101130000000124000000(Double ys02010101130000000124000000) {
        this.ys02010101130000000124000000 = ys02010101130000000124000000;
    }

    public Double getYs02010101130000000131000000() {
        return ys02010101130000000131000000;
    }

    public void setYs02010101130000000131000000(Double ys02010101130000000131000000) {
        this.ys02010101130000000131000000 = ys02010101130000000131000000;
    }

    public Double getYs02010101130000000132000000() {
        return ys02010101130000000132000000;
    }

    public void setYs02010101130000000132000000(Double ys02010101130000000132000000) {
        this.ys02010101130000000132000000 = ys02010101130000000132000000;
    }

    public Double getYs02010101130000000133000000() {
        return ys02010101130000000133000000;
    }

    public void setYs02010101130000000133000000(Double ys02010101130000000133000000) {
        this.ys02010101130000000133000000 = ys02010101130000000133000000;
    }

    public Double getYs02010101130000000200000000() {
        return ys02010101130000000200000000;
    }

    public void setYs02010101130000000200000000(Double ys02010101130000000200000000) {
        this.ys02010101130000000200000000 = ys02010101130000000200000000;
    }

    public Double getYs02010101130000000201000000() {
        return ys02010101130000000201000000;
    }

    public void setYs02010101130000000201000000(Double ys02010101130000000201000000) {
        this.ys02010101130000000201000000 = ys02010101130000000201000000;
    }

    public Double getYs02010101130000000202000000() {
        return ys02010101130000000202000000;
    }

    public void setYs02010101130000000202000000(Double ys02010101130000000202000000) {
        this.ys02010101130000000202000000 = ys02010101130000000202000000;
    }

    public Double getYs02010101130000000203000000() {
        return ys02010101130000000203000000;
    }

    public void setYs02010101130000000203000000(Double ys02010101130000000203000000) {
        this.ys02010101130000000203000000 = ys02010101130000000203000000;
    }

    public Double getYs02010101130000000211000000() {
        return ys02010101130000000211000000;
    }

    public void setYs02010101130000000211000000(Double ys02010101130000000211000000) {
        this.ys02010101130000000211000000 = ys02010101130000000211000000;
    }

    public Double getYs02010101130000000211010000() {
        return ys02010101130000000211010000;
    }

    public void setYs02010101130000000211010000(Double ys02010101130000000211010000) {
        this.ys02010101130000000211010000 = ys02010101130000000211010000;
    }

    public Double getYs02010101130000000212000000() {
        return ys02010101130000000212000000;
    }

    public void setYs02010101130000000212000000(Double ys02010101130000000212000000) {
        this.ys02010101130000000212000000 = ys02010101130000000212000000;
    }

    public Double getYs02010101130000000212010000() {
        return ys02010101130000000212010000;
    }

    public void setYs02010101130000000212010000(Double ys02010101130000000212010000) {
        this.ys02010101130000000212010000 = ys02010101130000000212010000;
    }

    public Double getYs02010101130000000213000000() {
        return ys02010101130000000213000000;
    }

    public void setYs02010101130000000213000000(Double ys02010101130000000213000000) {
        this.ys02010101130000000213000000 = ys02010101130000000213000000;
    }

    public Double getYs02010101130000000213010000() {
        return ys02010101130000000213010000;
    }

    public void setYs02010101130000000213010000(Double ys02010101130000000213010000) {
        this.ys02010101130000000213010000 = ys02010101130000000213010000;
    }

    public Double getYs02010101130000000221000000() {
        return ys02010101130000000221000000;
    }

    public void setYs02010101130000000221000000(Double ys02010101130000000221000000) {
        this.ys02010101130000000221000000 = ys02010101130000000221000000;
    }

    public Double getYs02010101130000000222000000() {
        return ys02010101130000000222000000;
    }

    public void setYs02010101130000000222000000(Double ys02010101130000000222000000) {
        this.ys02010101130000000222000000 = ys02010101130000000222000000;
    }

    public Double getYs02010101130000000223000000() {
        return ys02010101130000000223000000;
    }

    public void setYs02010101130000000223000000(Double ys02010101130000000223000000) {
        this.ys02010101130000000223000000 = ys02010101130000000223000000;
    }

    public Double getYs02010101130000000224000000() {
        return ys02010101130000000224000000;
    }

    public void setYs02010101130000000224000000(Double ys02010101130000000224000000) {
        this.ys02010101130000000224000000 = ys02010101130000000224000000;
    }

    public Double getYs02010101130000000231000000() {
        return ys02010101130000000231000000;
    }

    public void setYs02010101130000000231000000(Double ys02010101130000000231000000) {
        this.ys02010101130000000231000000 = ys02010101130000000231000000;
    }

    public Double getYs02010101130000000232000000() {
        return ys02010101130000000232000000;
    }

    public void setYs02010101130000000232000000(Double ys02010101130000000232000000) {
        this.ys02010101130000000232000000 = ys02010101130000000232000000;
    }

    public Double getYs02010101130000000233000000() {
        return ys02010101130000000233000000;
    }

    public void setYs02010101130000000233000000(Double ys02010101130000000233000000) {
        this.ys02010101130000000233000000 = ys02010101130000000233000000;
    }

    public Double getYs02010101140000000100000000() {
        return ys02010101140000000100000000;
    }

    public void setYs02010101140000000100000000(Double ys02010101140000000100000000) {
        this.ys02010101140000000100000000 = ys02010101140000000100000000;
    }

    public Double getYs02010101140000000101000000() {
        return ys02010101140000000101000000;
    }

    public void setYs02010101140000000101000000(Double ys02010101140000000101000000) {
        this.ys02010101140000000101000000 = ys02010101140000000101000000;
    }

    public Double getYs02010101140000000102000000() {
        return ys02010101140000000102000000;
    }

    public void setYs02010101140000000102000000(Double ys02010101140000000102000000) {
        this.ys02010101140000000102000000 = ys02010101140000000102000000;
    }

    public Double getYs02010101140000000103000000() {
        return ys02010101140000000103000000;
    }

    public void setYs02010101140000000103000000(Double ys02010101140000000103000000) {
        this.ys02010101140000000103000000 = ys02010101140000000103000000;
    }

    public Double getYs02010101140000000111000000() {
        return ys02010101140000000111000000;
    }

    public void setYs02010101140000000111000000(Double ys02010101140000000111000000) {
        this.ys02010101140000000111000000 = ys02010101140000000111000000;
    }

    public Double getYs02010101140000000111010000() {
        return ys02010101140000000111010000;
    }

    public void setYs02010101140000000111010000(Double ys02010101140000000111010000) {
        this.ys02010101140000000111010000 = ys02010101140000000111010000;
    }

    public Double getYs02010101140000000112000000() {
        return ys02010101140000000112000000;
    }

    public void setYs02010101140000000112000000(Double ys02010101140000000112000000) {
        this.ys02010101140000000112000000 = ys02010101140000000112000000;
    }

    public Double getYs02010101140000000112010000() {
        return ys02010101140000000112010000;
    }

    public void setYs02010101140000000112010000(Double ys02010101140000000112010000) {
        this.ys02010101140000000112010000 = ys02010101140000000112010000;
    }

    public Double getYs02010101140000000113000000() {
        return ys02010101140000000113000000;
    }

    public void setYs02010101140000000113000000(Double ys02010101140000000113000000) {
        this.ys02010101140000000113000000 = ys02010101140000000113000000;
    }

    public Double getYs02010101140000000113010000() {
        return ys02010101140000000113010000;
    }

    public void setYs02010101140000000113010000(Double ys02010101140000000113010000) {
        this.ys02010101140000000113010000 = ys02010101140000000113010000;
    }

    public Double getYs02010101140000000121000000() {
        return ys02010101140000000121000000;
    }

    public void setYs02010101140000000121000000(Double ys02010101140000000121000000) {
        this.ys02010101140000000121000000 = ys02010101140000000121000000;
    }

    public Double getYs02010101140000000122000000() {
        return ys02010101140000000122000000;
    }

    public void setYs02010101140000000122000000(Double ys02010101140000000122000000) {
        this.ys02010101140000000122000000 = ys02010101140000000122000000;
    }

    public Double getYs02010101140000000123000000() {
        return ys02010101140000000123000000;
    }

    public void setYs02010101140000000123000000(Double ys02010101140000000123000000) {
        this.ys02010101140000000123000000 = ys02010101140000000123000000;
    }

    public Double getYs02010101140000000124000000() {
        return ys02010101140000000124000000;
    }

    public void setYs02010101140000000124000000(Double ys02010101140000000124000000) {
        this.ys02010101140000000124000000 = ys02010101140000000124000000;
    }

    public Double getYs02010101140000000131000000() {
        return ys02010101140000000131000000;
    }

    public void setYs02010101140000000131000000(Double ys02010101140000000131000000) {
        this.ys02010101140000000131000000 = ys02010101140000000131000000;
    }

    public Double getYs02010101140000000132000000() {
        return ys02010101140000000132000000;
    }

    public void setYs02010101140000000132000000(Double ys02010101140000000132000000) {
        this.ys02010101140000000132000000 = ys02010101140000000132000000;
    }

    public Double getYs02010101140000000133000000() {
        return ys02010101140000000133000000;
    }

    public void setYs02010101140000000133000000(Double ys02010101140000000133000000) {
        this.ys02010101140000000133000000 = ys02010101140000000133000000;
    }

    public Double getYs02010101140000000200000000() {
        return ys02010101140000000200000000;
    }

    public void setYs02010101140000000200000000(Double ys02010101140000000200000000) {
        this.ys02010101140000000200000000 = ys02010101140000000200000000;
    }

    public Double getYs02010101140000000201000000() {
        return ys02010101140000000201000000;
    }

    public void setYs02010101140000000201000000(Double ys02010101140000000201000000) {
        this.ys02010101140000000201000000 = ys02010101140000000201000000;
    }

    public Double getYs02010101140000000202000000() {
        return ys02010101140000000202000000;
    }

    public void setYs02010101140000000202000000(Double ys02010101140000000202000000) {
        this.ys02010101140000000202000000 = ys02010101140000000202000000;
    }

    public Double getYs02010101140000000203000000() {
        return ys02010101140000000203000000;
    }

    public void setYs02010101140000000203000000(Double ys02010101140000000203000000) {
        this.ys02010101140000000203000000 = ys02010101140000000203000000;
    }

    public Double getYs02010101140000000211000000() {
        return ys02010101140000000211000000;
    }

    public void setYs02010101140000000211000000(Double ys02010101140000000211000000) {
        this.ys02010101140000000211000000 = ys02010101140000000211000000;
    }

    public Double getYs02010101140000000211010000() {
        return ys02010101140000000211010000;
    }

    public void setYs02010101140000000211010000(Double ys02010101140000000211010000) {
        this.ys02010101140000000211010000 = ys02010101140000000211010000;
    }

    public Double getYs02010101140000000212000000() {
        return ys02010101140000000212000000;
    }

    public void setYs02010101140000000212000000(Double ys02010101140000000212000000) {
        this.ys02010101140000000212000000 = ys02010101140000000212000000;
    }

    public Double getYs02010101140000000212010000() {
        return ys02010101140000000212010000;
    }

    public void setYs02010101140000000212010000(Double ys02010101140000000212010000) {
        this.ys02010101140000000212010000 = ys02010101140000000212010000;
    }

    public Double getYs02010101140000000213000000() {
        return ys02010101140000000213000000;
    }

    public void setYs02010101140000000213000000(Double ys02010101140000000213000000) {
        this.ys02010101140000000213000000 = ys02010101140000000213000000;
    }

    public Double getYs02010101140000000213010000() {
        return ys02010101140000000213010000;
    }

    public void setYs02010101140000000213010000(Double ys02010101140000000213010000) {
        this.ys02010101140000000213010000 = ys02010101140000000213010000;
    }

    public Double getYs02010101140000000221000000() {
        return ys02010101140000000221000000;
    }

    public void setYs02010101140000000221000000(Double ys02010101140000000221000000) {
        this.ys02010101140000000221000000 = ys02010101140000000221000000;
    }

    public Double getYs02010101140000000222000000() {
        return ys02010101140000000222000000;
    }

    public void setYs02010101140000000222000000(Double ys02010101140000000222000000) {
        this.ys02010101140000000222000000 = ys02010101140000000222000000;
    }

    public Double getYs02010101140000000223000000() {
        return ys02010101140000000223000000;
    }

    public void setYs02010101140000000223000000(Double ys02010101140000000223000000) {
        this.ys02010101140000000223000000 = ys02010101140000000223000000;
    }

    public Double getYs02010101140000000224000000() {
        return ys02010101140000000224000000;
    }

    public void setYs02010101140000000224000000(Double ys02010101140000000224000000) {
        this.ys02010101140000000224000000 = ys02010101140000000224000000;
    }

    public Double getYs02010101140000000231000000() {
        return ys02010101140000000231000000;
    }

    public void setYs02010101140000000231000000(Double ys02010101140000000231000000) {
        this.ys02010101140000000231000000 = ys02010101140000000231000000;
    }

    public Double getYs02010101140000000232000000() {
        return ys02010101140000000232000000;
    }

    public void setYs02010101140000000232000000(Double ys02010101140000000232000000) {
        this.ys02010101140000000232000000 = ys02010101140000000232000000;
    }

    public Double getYs02010101140000000233000000() {
        return ys02010101140000000233000000;
    }

    public void setYs02010101140000000233000000(Double ys02010101140000000233000000) {
        this.ys02010101140000000233000000 = ys02010101140000000233000000;
    }

    public Double getYs02010101140100000100000000() {
        return ys02010101140100000100000000;
    }

    public void setYs02010101140100000100000000(Double ys02010101140100000100000000) {
        this.ys02010101140100000100000000 = ys02010101140100000100000000;
    }

    public Double getYs02010101140100000101000000() {
        return ys02010101140100000101000000;
    }

    public void setYs02010101140100000101000000(Double ys02010101140100000101000000) {
        this.ys02010101140100000101000000 = ys02010101140100000101000000;
    }

    public Double getYs02010101140100000102000000() {
        return ys02010101140100000102000000;
    }

    public void setYs02010101140100000102000000(Double ys02010101140100000102000000) {
        this.ys02010101140100000102000000 = ys02010101140100000102000000;
    }

    public Double getYs02010101140100000103000000() {
        return ys02010101140100000103000000;
    }

    public void setYs02010101140100000103000000(Double ys02010101140100000103000000) {
        this.ys02010101140100000103000000 = ys02010101140100000103000000;
    }

    public Double getYs02010101140100000111000000() {
        return ys02010101140100000111000000;
    }

    public void setYs02010101140100000111000000(Double ys02010101140100000111000000) {
        this.ys02010101140100000111000000 = ys02010101140100000111000000;
    }

    public Double getYs02010101140100000111010000() {
        return ys02010101140100000111010000;
    }

    public void setYs02010101140100000111010000(Double ys02010101140100000111010000) {
        this.ys02010101140100000111010000 = ys02010101140100000111010000;
    }

    public Double getYs02010101140100000112000000() {
        return ys02010101140100000112000000;
    }

    public void setYs02010101140100000112000000(Double ys02010101140100000112000000) {
        this.ys02010101140100000112000000 = ys02010101140100000112000000;
    }

    public Double getYs02010101140100000112010000() {
        return ys02010101140100000112010000;
    }

    public void setYs02010101140100000112010000(Double ys02010101140100000112010000) {
        this.ys02010101140100000112010000 = ys02010101140100000112010000;
    }

    public Double getYs02010101140100000113000000() {
        return ys02010101140100000113000000;
    }

    public void setYs02010101140100000113000000(Double ys02010101140100000113000000) {
        this.ys02010101140100000113000000 = ys02010101140100000113000000;
    }

}