'use collaborative_management';

/* Controllers */

app.controller('Collaborative_managementCtrl', ['$scope', function($scope) {

    $scope.folds = [
        {name: '经营业户信息', filter:'',url:'list'},
        {name: '营运车辆信息', filter:'starred',url:'vehicle'},
        {name: '从业人员信息', filter:'sent',url:'list'},
        {name: '营运线路信息', filter:'important',url:'list'},
        {name: '道路运政执法信息', filter:'draft',url:'list'},
        {name: '道路运输管理机构信息', filter:'trash',url:'list'}
    ];

}]);

app.controller('Collaborative_managementListCtrl', ['$scope', '$stateParams', function($scope, $stateParams) {
    $scope.fold = $stateParams.fold;
    $scope.indexBtn = 0
    $scope.data={
        business:{
            secondLevel:['经营业户基本信息','道路运输经营许可证信息','经营业户质量信誉考核信息',' 经营业户工商注册信息','经营业户税务登记信息','道路客运站专项信息','机动车维修经营业户专项信息','机动车驾驶员培训业户专项信息','经营业户安全生产事故信息'],
            threeLevel:[
                ['省份行政区划代码','省级系统经营业户ID','经营业户名称','业户地址','企业组织机构代码','上级企业名称','上级企业经营许可证号','经营业户所在地行政区划代码','经营业户负责人姓名','经营业户负责人电话号码','经营业户电话号码','经营状态','经营状态编码','经济类型编码','所在地中心纬度','创建时间','更新时间'],
                ['省份行政区划代码','省级系统经营业户ID','经营业户名称','经营范围文字描述','经营许可证号','有效期起','有效期止','发证机构代码','发证机构名称','核发日期','业户地址经营状态','证照类别','证照状态','创建时间','更新时间'],
                ['省份行政区划代码','省级系统经营业户ID','营业户名称','业户地址','证照类别','照发放类型','照补换原因','证前经营许可证号','证前有效期起','换证前有效期止','证后经营许可证号','证后有效期起','证后有效期止','申请日期','证照补换发日期'],
                ['省份行政区划代码','省级系统经营业户ID','经营业户名称','业户地址','考核经营范围代码','考核日期','考核年度','考核机构名称','考核总分','质量信誉考核结果'],
                ['省份行政区划代码','级系统经营业户ID','营业户名称','业户地址','工商注册号','工商注册发证日期','经济类型','注册资本','企业投资者名称','企业投资者国籍','企业投资者国籍代码','外商投资额'],
                ['省份行政区划代码','省级系统经营业户ID','经营业户名称','业户地址','国税税务登记号','国税税务发证日期','地税税务登记号','地税税务发证日期'],
                ['省份行政区划代码','省级系统经营业户ID','经营业户名称','业户地址','客运站名称','建站日期','投入营运日期','投资规模','客运站级别','占地面积','建筑面积','设计年度平均日旅客发送量','设计班次','设计年度旅客发送量','车站服务方式','车站规模','停车场','发车位','候车厅','职工总数','管理人员','站务人员','其他人员','客运班线','省际班线','市际班线','县际班线','县内班线','出入境班线','客运日发班次','省际班线日发班次','市际班线日发班次','县际班线日发班次','县内班线日发班次','出入境班线日发班次','危险品安全检测仪','场站中心经度','场站中心纬度'],
                ['省份行政区划代码','省级系统经营业户ID','经营业户名称','业户地址','货运站名称','建站日期','投入营运日期','投资规模','货运站级别','占地面积','建筑面积','通用仓库','停车场','货物托运场所','职工总数','管理人员','专业人员','其他人员','场站中心经度','场站中心纬度'],
                ['省份行政区划代码','省级系统经营业户ID','经营业户名称','业户地址','机动车维修标志牌号','维修对象','维修类别','职工总数','管理人员','技术负责人员','维修技术人员','质量检验人员','总质量检验人员','价格结算人员','其他人员','场站中心经度','场站中心纬度'],
                ['省份行政区划代码','省级系统经营业户ID','经营业户名称','业户地址','驾校类别','教练车总数',' 教学场地（含租赁场地）面积','服务方式','职工总数','管理人员','理论教学负责人','驾驶操作训练负责人','教学车辆管理人员','计算机管理人员','教练员人数','理论教练员','驾驶操作教练员','道路客货运输驾驶员从业资格培训教练员','危险货物运输驾驶员从业资格培训教练员','其他人员','残疾人教学车辆','大型客车','通用货车半挂车（牵引车）','城市公共客运车','中型客车','大型货车','小型汽车','摩托车','其他车型','机动车驾驶模拟器','被动式模拟器','场站中心经度','场站中心纬度'],
                ['省份行政区划代码','省级系统经营业户ID','经营业户名称','业户地址','从业人员姓名','证件类型','证件号码','发生时间','发生地点','车牌号码','车牌颜色代码','事故原因','路况信息','天气状况','线路类别','事故经过','车损情况','死亡人数','重伤人数','轻伤人数','事故等级(事故类别)','经济损失','赔偿损失金额','事故责任认定','责任认定时间','填报机构','记录时间']
            ]
        }
    }
    $scope.tabBtn = function (index) {
        $scope.indexBtn = index
    }
}]);
app.controller('Collaborative_managementVehicleCtrl', ['$scope', '$stateParams', function($scope, $stateParams) {
    $scope.fold = $stateParams.fold;
    $scope.indexBtn = 0
    $scope.data={
        business:{
            secondLevel:['营运车辆基本信息','营运车辆年度审验信息','道路运输证换证信息','营运车辆技术等级评定信息','营运车辆二级维护信息','营运车辆承运人责任险交纳信息','营运车辆转籍信息','营运车辆过户信息'],
            threeLevel:[
                ['省份行政区划代码','省级系统经营业户ID','省级系统营运车辆ID',' 车辆（挂车）号牌',' 车牌颜色','车牌颜色代码','车辆厂牌','车辆厂牌型号','发动机号','车辆识别VIN码','车辆类型','车辆类型代码','客车类型与等级','出厂日期','注册日期','车辆燃料类型代码','车辆轴距','车辆车长','车辆车宽','车辆车高','车辆车轴数','准牵引总质量','发动机功率','核定载客位数','核定载质量',' 车辆（挂车）总质量','车辆罐体容积','车辆接入卫星定位平台名称','车辆接入卫星定位平台代码','车辆卫星定位终端型号','车辆营运状态','车辆营运状态代码','车籍地行政区域代码','创建时间','更新时间'],
                ['省份行政区划代码','省级系统营运车辆ID',' 车辆（挂车）号牌','车牌颜色','车牌颜色代码','道路运输证号','发证机构代码','发证机构名称','有效期起','有效期止','经营范围代码','经营范围文字证照类别','证照状态','证照介质类型','创建时间','更新时间'],
                ['省份行政区划代码','省级系统营运车辆ID','车辆（挂车）号牌','车牌颜色','车牌颜色代码','车辆审验年度','车辆年度审验状态','车辆年度审验日期','车辆年度审验有效期至','车辆下次年度审验日期'],
                ['省份行政区划代码','省级系统营运车辆ID','车辆（挂车）号牌','车牌颜色','车牌颜色代码','证照类别','证照发放类型','证照补换原因','换证前道路运输证号','换证后道路运输证号','申请日期','证照补换发日期'],
                ['省份行政区划代码','省份系统营运车辆ID',' 车辆（挂车）号牌','车牌颜色','车牌颜色代码','检测站','检测站编号','检测日期','检测结果','送检前技术等级','评定等级','评定时间','下次技术等级评定时间'],
                ['省份行政区划代码','省份系统营运车辆ID','车辆（挂车）号牌','车牌颜色','车牌颜色代码','本次维护日期','本次维护里程','下次维护里程','维护单位','维护合同号','维护发票号','维修合格证号','维修结果','检测站','检测站编号','检测日期','检测次数','检测结果'],
                ['省份行政区划代码','省份系统营运车辆ID','车辆（挂车）号牌','车牌颜色','车牌颜色代码','投保险种','投保日期','投保金额','投保单位','保险机构','保险单号','有效期起','有效期止'],
                ['省份行政区划代码','省份系统营运车辆ID','发动机号','车辆识别VIN码','业务类型','是否跨省转籍','转入地行政区划','转出地行政区划','操作员','记录时间'],
                ['省份行政区划代码','省份系统营运车辆ID','发动机号','车辆识别VIN码','原业户ID','新业户ID','原车牌号','原车牌颜色','原车牌颜色代码','新车牌号','新车牌颜色','新车牌颜色代码','操作员','记录时间']
            ]
        }
    }
    $scope.tabBtn = function (index) {
        $scope.indexBtn = index
    }
}]);











