'use collaborative_management';

/* Controllers */

app.controller('Collaborative_managementCtrl', ['$scope', function($scope) {

    $scope.folds = [
        {name: '经营业户信息', filter:'',url:'list'},
        {name: '营运车辆信息', filter:'starred',url:'vehicle'},
        {name: '从业人员信息', filter:'sent',url:'personnel'},
        {name: '营运线路信息', filter:'important',url:'line'},
        {name: '道路运政执法信息', filter:'draft',url:'road'},
        {name: '道路运输管理机构信息', filter:'trash',url:'transport'}
    ];

}]);

app.controller('Collaborative_managementListCtrl', ['$scope', '$stateParams', function($scope, $stateParams) {
    $scope.fold = $stateParams.fold;
    $scope.indexBtn = 0
    $scope.data={
        business:{
            secondLevel:['经营业户基本信息','道路运输经营许可证信息','经营业户质量信誉考核信息',' 经营业户工商注册信息','经营业户税务登记信息','道路客运站专项信息','机动车维修经营业户专项信息','机动车驾驶员培训业户专项信息','经营业户安全生产事故信息'],
            threeLevel:[
                ['省份行政区划代码','省级系统经营业户ID','经营业户名称','业户地址','企业组织机构代码','上级企业名称','上级企业经营许可证号','经营业户所在地行政区划代码','经营业户负责人姓名','经营业户负责人电话号码','经营业户电话号码','经营状态','经营状态编码','经济类型编码','所在地中心纬度','创建时间','更新时间'],
                ['省份行政区划代码','省级系统经营业户ID','经营业户名称','经营范围文字描述','经营许可证号','有效期起','有效期止','发证机构代码','发证机构名称','核发日期','业户地址经营状态','证照类别','证照状态','创建时间','更新时间'],
                ['省份行政区划代码','省级系统经营业户ID','营业户名称','业户地址','证照类别','照发放类型','照补换原因','证前经营许可证号','证前有效期起','换证前有效期止','证后经营许可证号','证后有效期起','证后有效期止','申请日期','证照补换发日期'],
                ['省份行政区划代码','省级系统经营业户ID','经营业户名称','业户地址','考核经营范围代码','考核日期','考核年度','考核机构名称','考核总分','质量信誉考核结果'],
                ['省份行政区划代码','级系统经营业户ID','营业户名称','业户地址','工商注册号','工商注册发证日期','经济类型','注册资本','企业投资者名称','企业投资者国籍','企业投资者国籍代码','外商投资额'],
                ['省份行政区划代码','省级系统经营业户ID','经营业户名称','业户地址','国税税务登记号','国税税务发证日期','地税税务登记号','地税税务发证日期'],
                ['省份行政区划代码','省级系统经营业户ID','经营业户名称','业户地址','客运站名称','建站日期','投入营运日期','投资规模','客运站级别','占地面积','建筑面积','设计年度平均日旅客发送量','设计班次','设计年度旅客发送量','车站服务方式','车站规模','停车场','发车位','候车厅','职工总数','管理人员','站务人员','其他人员','客运班线','省际班线','市际班线','县际班线','县内班线','出入境班线','客运日发班次','省际班线日发班次','市际班线日发班次','县际班线日发班次','县内班线日发班次','出入境班线日发班次','危险品安全检测仪','场站中心经度','场站中心纬度'],
                ['省份行政区划代码','省级系统经营业户ID','经营业户名称','业户地址','货运站名称','建站日期','投入营运日期','投资规模','货运站级别','占地面积','建筑面积','通用仓库','停车场','货物托运场所','职工总数','管理人员','专业人员','其他人员','场站中心经度','场站中心纬度'],
                ['省份行政区划代码','省级系统经营业户ID','经营业户名称','业户地址','机动车维修标志牌号','维修对象','维修类别','职工总数','管理人员','技术负责人员','维修技术人员','质量检验人员','总质量检验人员','价格结算人员','其他人员','场站中心经度','场站中心纬度'],
                ['省份行政区划代码','省级系统经营业户ID','经营业户名称','业户地址','驾校类别','教练车总数',' 教学场地（含租赁场地）面积','服务方式','职工总数','管理人员','理论教学负责人','驾驶操作训练负责人','教学车辆管理人员','计算机管理人员','教练员人数','理论教练员','驾驶操作教练员','道路客货运输驾驶员从业资格培训教练员','危险货物运输驾驶员从业资格培训教练员','其他人员','残疾人教学车辆','大型客车','通用货车半挂车（牵引车）','城市公共客运车','中型客车','大型货车','小型汽车','摩托车','其他车型','机动车驾驶模拟器','被动式模拟器','场站中心经度','场站中心纬度'],
                ['省份行政区划代码','省级系统经营业户ID','经营业户名称','业户地址','从业人员姓名','证件类型','证件号码','发生时间','发生地点','车牌号码','车牌颜色代码','事故原因','路况信息','天气状况','线路类别','事故经过','车损情况','死亡人数','重伤人数','轻伤人数','事故等级(事故类别)','经济损失','赔偿损失金额','事故责任认定','责任认定时间','填报机构','记录时间']
            ]
        }
    }
    $scope.responseData = {
        basicInfo : [{
            administrativeCode:'093850973598',
            businessOwnerID:'21434',
            operatingVehicleID:'235345',
            licensePlateNumber:'092098493',
            licensePlateColor:'黑',
            licensePlateColorCode:'black',
            vehicleBrand:'df',
            vehicleBrandModel:'MS',
            engineNo:'MS/S',
            vehicleIdentificationVINCode:'122233',
            vehicleType:"好车",
            vehicleTypeCode:"good",
            passengerCarLevelAndType:'好车一等',
            manufactureDate:'2017-09-08',
            registrationDate:'2016-09-08',
            vehicleFuelTypeCode:'34322',
            wheelbase:'2米',
            vehicleCarWide:'1米',
            highVehicleCar:'0.9米',
            vehiclesAxlesNum:'2根',
            totalMassOfQuasiTraction:'优',
            enginePower:'3/w',
            passengerDigit:'32位',
            vehicleTotalMass :'2000KG',
            vehicleTankVolume:'25m³',
            accessSatelliteLocationName:'我是车',
            accessSatelliteLocationCode:'MC9837',
            accessSatelliteLocationType:'THPOI',
            vehicleOperatingCondition:'正常',
            vehicleOperatingConditionCode:'normal',
            vehiclePhotoName:'车',
            administrativeAreaCodeOfVehicleRegistration:'VD**',
            creationTime:'2015-09-07',
            updateTime:'2019-07-09'
        }]
    }
    $scope.tabBtn = function (index) {
        $scope.indexBtn = index
    }
}]);
app.controller('Collaborative_managementVehicleCtrl', ['$scope', '$stateParams', function($scope, $stateParams) {
    $scope.fold = $stateParams.fold;
    $scope.indexBtn = 0
    $scope.data={
        business:{
            secondLevel:['营运车辆基本信息','营运车辆年度审验信息','道路运输证换证信息','营运车辆技术等级评定信息','营运车辆二级维护信息','营运车辆承运人责任险交纳信息','营运车辆转籍信息','营运车辆过户信息'],
            threeLevel:[
                ['省份行政区划代码','省级系统经营业户ID','省级系统营运车辆ID',' 车辆（挂车）号牌',' 车牌颜色','车牌颜色代码','车辆厂牌','车辆厂牌型号','发动机号','车辆识别VIN码','车辆类型','车辆类型代码','客车类型与等级','出厂日期','注册日期','车辆燃料类型代码','车辆轴距','车辆车长','车辆车宽','车辆车高','车辆车轴数','准牵引总质量','发动机功率','核定载客位数','核定载质量',' 车辆（挂车）总质量','车辆罐体容积','车辆接入卫星定位平台名称','车辆接入卫星定位平台代码','车辆卫星定位终端型号','车辆营运状态','车辆营运状态代码','车籍地行政区域代码','创建时间','更新时间'],
                ['省份行政区划代码','省级系统营运车辆ID',' 车辆（挂车）号牌','车牌颜色','车牌颜色代码','道路运输证号','发证机构代码','发证机构名称','有效期起','有效期止','经营范围代码','经营范围文字证照类别','证照状态','证照介质类型','创建时间','更新时间'],
                ['省份行政区划代码','省级系统营运车辆ID','车辆（挂车）号牌','车牌颜色','车牌颜色代码','车辆审验年度','车辆年度审验状态','车辆年度审验日期','车辆年度审验有效期至','车辆下次年度审验日期'],
                ['省份行政区划代码','省级系统营运车辆ID','车辆（挂车）号牌','车牌颜色','车牌颜色代码','证照类别','证照发放类型','证照补换原因','换证前道路运输证号','换证后道路运输证号','申请日期','证照补换发日期'],
                ['省份行政区划代码','省份系统营运车辆ID',' 车辆（挂车）号牌','车牌颜色','车牌颜色代码','检测站','检测站编号','检测日期','检测结果','送检前技术等级','评定等级','评定时间','下次技术等级评定时间'],
                ['省份行政区划代码','省份系统营运车辆ID','车辆（挂车）号牌','车牌颜色','车牌颜色代码','本次维护日期','本次维护里程','下次维护里程','维护单位','维护合同号','维护发票号','维修合格证号','维修结果','检测站','检测站编号','检测日期','检测次数','检测结果'],
                ['省份行政区划代码','省份系统营运车辆ID','车辆（挂车）号牌','车牌颜色','车牌颜色代码','投保险种','投保日期','投保金额','投保单位','保险机构','保险单号','有效期起','有效期止'],
                ['省份行政区划代码','省份系统营运车辆ID','发动机号','车辆识别VIN码','业务类型','是否跨省转籍','转入地行政区划','转出地行政区划','操作员','记录时间'],
                ['省份行政区划代码','省份系统营运车辆ID','发动机号','车辆识别VIN码','原业户ID','新业户ID','原车牌号','原车牌颜色','原车牌颜色代码','新车牌号','新车牌颜色','新车牌颜色代码','操作员','记录时间']
            ]
        }
    }
    $scope.tabBtn = function (index) {
        $scope.indexBtn = index
    }
}]);

app.controller('Collaborative_managementPersonnelCtrl', ['$scope', '$stateParams', function($scope, $stateParams) {
    $scope.fold = $stateParams.fold;
    $scope.indexBtn = 0
    $scope.data={
        business:{
            secondLevel:['从业人员资格证信息','从业人员基本信息','从业人员服务单位备案信息','从业人员继续教育信息','从业人员考试信息','从业人员违章记分信息','从业人员记分教育信息','营运驾驶员准驾车型信息','教练员准教车型信息','从业人员诚信考核信息','从业人员黑名单信息','从业人员证件办理信息','职业技能鉴定信息'],
            threeLevel:[
                ['省份行政区划代码','原省级系统从业人员ID','姓名','性别','证件类型','民族','联系电话','联系地址','文化程度','技术职称','从业人员状况','从业人员状况代码','从业人员照片名称','从业人员户籍地行政区划','证件号码','出生日期','创建时间'],
                ['省份行政区划代码','原省级系统从业人员ID','证件类型','证件号码','从业资格类别','从业资格证号','从业资格证初领时间','从业资格证发证日期','证件有效期至','发证机构代码','发证机构名称','发证机关所在地行政区划代码','证照状态','证照介质类型','IC卡道路运输证件卡号','办理类型','创建时间','更新时间'],
                ['省份行政区划代码','原省级系统从业人员ID','证件类型','证件号码','省级系统经营业户ID','经营业户名称','业户地址','从业人员备案日期','创建时间'],
                ['省份行政区划代码','原省级系统从业人员ID','证件类型','证件号码','从业资格证号','从业资格类别','学习内容','培训成绩','培训实施单位','结业证书编号','学时','开始日期','结束日期'],
                ['省份行政区划代码','从业人员申请ID','证件类型','证件号码','申请人姓名','原省级系统从业人员ID','考试单位名称','考试科目Id','考试科目名称','准考证号','考试成绩'],
                ['省份行政区划代码','原省级系统从业人员ID','证件类型','证件号码','从业资格证号','违章日期','违章地点','违章行为','车牌号码','车牌颜色代码','计分类别','计分标准','计分值','处罚金额','处罚单位','修改时间'],
                ['省份行政区划代码','原省级系统从业人员ID','证件类型','证件号码','从业资格证号','诚信考核周期','当前诚信等级','教育开始时间','教育结束时间','记录时间','清除记分时间','从业人员计分考核计分人记分教育原因'],
                ['省份行政区划代码','原省级系统从业人员ID','证件类型','证件号码','驾驶证号','准驾车型代码','初次领取驾驶证日期','驾驶证有效期始','驾驶证有效期止','驾驶证发证机关'],
                ['省份行政区划代码','原省级系统从业人员ID','证件号码','准教类别','准教车型代码','准教车型','发证日期','证件有效期始','证件有效年限'],
                ['省份行政区划代码','原省级系统从业人员ID','证件类型','证件号码','从业资格证号','考核周期','考核日期','考核年度','累计计分分值','当前诚信等级','下次考核时间','备注'],
                ['省份行政区划代码','原省级系统从业人员ID','证件类型','证件号码','原系统黑名单Id','有效期起始日期','有效期截止日期','从业资格证号','原因','操作员','录时间','所属机构','所在部门'],
                ['省份行政区划代码','原省级系统从业人员ID','证件类型','证件号码','从业人员申请ID','原从业资格证号','原从业资格类别','办理类型','审核状态','办理人隶属区县代码','受理地行政区划代码','健康状况代码','培训单位名称','办理机构代码','办理机构名称','驾驶证号','记录时间','操作员'],
                ['省份行政区划代码','原省级系统从业人员ID','证件类型','证件号码','从业资格类别','从业资格证号','所属单位','鉴定日期','鉴定部门','考试时间','考试地点','鉴定结果','材料审核状态','办理时间','操作员']
            ]
        }
    }
    $scope.tabBtn = function (index) {
        $scope.indexBtn = index
    }
}]);
app.controller('Collaborative_managementLineCtrl', ['$scope', '$stateParams', function($scope, $stateParams) {
    $scope.fold = $stateParams.fold;
    $scope.indexBtn = 0
    $scope.data={
        business:{
            secondLevel:['物理线路信息','客运经营线路信息','线路标志牌信息'],
            threeLevel:[
                ['省份行政区划代码','物理线路ID','线路编码','客运班线经营区域','客运班线经营区域代码','起点地名','起点所在行政区划代码','讫点地名','讫点所在行政区划代码','途经主要地点或道路','途经主要经纬度坐标点','线路里程','线路高速里程','创建时间'],
                ['省份行政区划代码','物理线路ID','经营线路ID','经营线路名称','原省级系统经营业户ID','客运班线类型','客运班线类型代码','始发客运站','始发客运站所在行政区划代码','讫点客运站','讫点客运站所在行政区划代码','客运班线途经主要站点','日发班次','营运里程','其中高速公路里程','客运班线经营区域','客运班线经营区域代码','是否农村班线','客运班线营运状态','客运班线营运状态代码','线路有效期始','线路有效期止','发放日期'],
                ['省份行政区划代码','标志牌ID','经营线路ID','标志牌号','车牌颜色代码','车辆号牌','标志牌类型','有效起始日期','有效截止日期','发放日期']
            ]
        }
    }
    $scope.tabBtn = function (index) {
        $scope.indexBtn = index
    }
}]);
app.controller('Collaborative_managementRoadCtrl', ['$scope', '$stateParams', function($scope, $stateParams) {
    $scope.fold = $stateParams.fold;
    $scope.indexBtn = 0
    $scope.data={
        business:{
            secondLevel:['道路运政案件处罚立案信息','道路运政案件处罚决定信息','道路运政案件结案信息'],
            threeLevel:[
                ['省份行政区划代码','案件编号','案件来源','违法行为立案理由','案件来源代码','案件行政处罚程序','行政处罚对象','从业人员姓名','从业人员资格证编号','经营业户名称','省级系统经营业户ID','经营业户道路运输经营许可证号','案件发生时间','案件发生地点','违法类型','违法类型代码','违法内容','违法车辆号牌','违法车辆车牌颜色代码','违法车辆车籍地行政区划代码','立案日期','执法人员证件号码'],
                ['省份行政区划代码','案件编号','行政处罚决定日期','处理决定类型','处理决定类型代码','行政处罚罚款金额','经营业户名称','经营业户道路运输经营许可证号','从业人员姓名','从业人员资格证编号','从业人员计分'],
                ['省份行政区划代码','案件编号','案件结案原因','处罚执行状态','案件执行情况','案件结案日期']

            ]
        }
    }
    $scope.tabBtn = function (index) {
        $scope.indexBtn = index
    }
}]);
app.controller('Collaborative_managementTransportCtrl', ['$scope', '$stateParams', function($scope, $stateParams) {
    $scope.fold = $stateParams.fold;
    $scope.indexBtn = 0
    $scope.data={
        business:{
            secondLevel:['道路运输管理机构信息','执法人员信息'],
            threeLevel:[
                ['省份行政区划代码','原省级系统执法人员ID','执法人员姓名','所属道路运输管理机构代码','职务','参加工作日期','从事执法日','执法证件号码','执法证初领日期','有效期起','有效期止','执法证发证机关','执法证发证机关名称','执法岗位代码','执法岗位名称','执法证审验日期','执法证审验年度','执法证审验状态'],
                ['省份行政区划代码','管理机构名称','管理机构代码','管理机构类型','管理机构类型代码','管理机构地址','管理机构行政区划','管理机构联系电话','管理机构应急值班电话','管理机构投诉电话','管理机构传真','管理机构负责人','管理机构曾用名']

            ]
        }
    }
    $scope.tabBtn = function (index) {
        $scope.indexBtn = index
    }
}]);









